[{"q":"<p>A retailer buys lentil A at Rs. 20.40 per kg and lentil B at Rs. 18.60 per kg. He wants to mix A and B to make a new mixture C that costs Rs. 19.40 per kg.<br>\nIn what ratio should he mix lentil A and B to do so?</p>","a":[{"id":1401017,"option":"8 : 10","correct":true},{"id":1401018,"option":"10 : 8","correct":false},{"id":1401019,"option":"4 : 10 ","correct":false},{"id":1401020,"option":"10 : 4","correct":false}]},{"q":"<p>You have a mixture of <em>100</em> liters of water and milk which contains <em>25% </em>milk. Let the amount of milk that should be added to the mixture so that the percentage of milk in the new mixture is <em>30%</em> be <em>X.YZ</em> liters when rounded off to two decimal places. What is the value of <em>X + Y</em>?</p>","a":[{"id":1418125,"option":"8","correct":true},{"id":1418126,"option":"11","correct":false},{"id":1418127,"option":"4","correct":false},{"id":1418128,"option":"6","correct":false}]},{"q":"<p>Alice wants to sell artisanal drinks during the holiday season. He produces 160 litres of the drink and sells a part of it at 10% profit. He then sells the rest of the drink at 6% profit.<br>\nWhat quantity of the drink did he sell at 10% profit if he gained 9% profit on the entire 160 litres?</p>","a":[{"id":1401027,"option":"120 litres","correct":true},{"id":1401028,"option":"100 litres","correct":false},{"id":1401029,"option":"140 litres","correct":false},{"id":1401030,"option":"90 litres","correct":false}]},{"q":"<p>A wholesaler decides to mix two varieties of lentils worth Rs. 170 per kg and Rs. 180 per kg with a third variety of lentils in the ratio 2:2:3.<br>\nWhat is the price per kg of the third variety of lentils if the lentil mixture is worth 173 per kg?</p>","a":[{"id":1401022,"option":"Rs. 174.30","correct":false},{"id":1401023,"option":"Rs. 178.33","correct":false},{"id":1401024,"option":"Rs. 176.40","correct":false},{"id":1401025,"option":"Rs. 170.33","correct":true}]},{"q":"<p><em>4</em> units are drawn from a container full of milk and is then filled with water. This operation is performed two more times. The ratio of the quantity of milk now left in the container to that of water is <em>8:19</em>.<br>\nHow much milk did the container hold originally?</p>","a":[{"id":1404107,"option":"11 units","correct":false},{"id":1404108,"option":"12 units","correct":true},{"id":1404109,"option":"9 units","correct":false},{"id":1404110,"option":"10 units","correct":false}]},{"q":"<p>You have a mason jar of juice containing 44% of lemon juice. You decide to replace a part of this juice with another juice containing 20% of lemon juice.<br>\nWhat fraction of juice did you replace if the mixture now contains 24% of lemon juice?</p>","a":[{"id":1401032,"option":"5/6","correct":true},{"id":1401033,"option":"4/5","correct":false},{"id":1401034,"option":"3/5","correct":false},{"id":1401035,"option":"2/5","correct":false}]}]