[{"q":"<p>You can disable animations globally for any of the required animations to increase the rendering speed. You want to configure the animations using a function while allowing the following:<br>\n<strong>Rules</strong><br>\n&nbsp;&nbsp;&nbsp;&nbsp;1. You can call the function even during the config phase of the app.<br>\n&nbsp;&nbsp;&nbsp;&nbsp;2. The function must take only a single filter function.<br>\n&nbsp;&nbsp;&nbsp;&nbsp;3. The animations must work only if the filter function returns true.<br>\n&nbsp;&nbsp;&nbsp;&nbsp;4. It must not be a difficult task to set up rules allow some of the specific events along with the animations for the DOM’s subtrees (with dynamic modification feature).</p>\n\n<p>Which of the following functions would you use to enable the developer to perform the given functions?</p>","a":[{"id":1719311,"option":"$animateProvider.customFilter()","correct":true},{"id":1719312,"option":"$animateProvider.classNameFilter()","correct":false},{"id":1719313,"option":"$animate.enabled()","correct":false},{"id":1719314,"option":"$animateProvider.Filter()","correct":false}]},{"q":"<p>You are working on animations in XAML in the Universal Windows Platform (UWP). Easing functions allow you to apply custom mathematical formulas to your animations.</p>\n\n<p>Which of the following statements about the CubeEase easing function are correct:</p>\n\n<ol>\n\t<li>The ClearValue(DependencyProperty) method returns the current effective value of a dependency property from the class DependencyProperty.</li>\n\t<li>The ReadLocalValue(DependencyProperty) method returns the local value of a dependency property.</li>\n\t<li>The GetAnimationBaseValue(DependencyProperty) method returns any base value established for a dependency property, which would apply in cases where animation is not active.</li>\n\t<li>The Ease(Double) method transforms normalized time to control the pace of an animation.</li>\n</ol>","a":[{"id":1113669,"option":"1, 2, and 3","correct":false},{"id":1113670,"option":"2, 3, and 4","correct":true},{"id":1113671,"option":"1, 2, and 4","correct":false},{"id":1113672,"option":"1, 3, and 4","correct":false}]}]