[{"q":"<p>You want to dynamically scale your database when using an Azure SQL single database. You also want to define the maximum amount of resources that will be assigned to each database for scalability. Which of the following will you use to define the maximum amount of resources in the given scenario?</p>","a":[{"id":1688873,"option":"DTU","correct":false},{"id":1688874,"option":"vCore","correct":false},{"id":1688875,"option":"Elastic Pools","correct":false},{"id":1688876,"option":"Either DTU or vCore","correct":true}]},{"q":"<p>You are able to login to the Azure database but you are failing to access data from any of the tables when working with Azure SQL Database. You also are unable to see any other DB objects like SP or views. The problem in the given scenario could be related to which of the following?</p>","a":[{"id":1688869,"option":"Authentication","correct":false},{"id":1688870,"option":"Authorization","correct":true},{"id":1688871,"option":"Row level security","correct":false},{"id":1688872,"option":"Dynamic data masking","correct":false}]},{"q":"<p>You have been assigned a task to make an Azure SQL database instance private enabling only applications or resources within a specific subnet to access the database resources. Which of the following security setting will you configure in the given scenario?</p>","a":[{"id":1688865,"option":"Network Security","correct":true},{"id":1688866,"option":"Authorization","correct":false},{"id":1688867,"option":"Authentication","correct":false},{"id":1688868,"option":"Transparent data encryption","correct":false}]},{"q":"<p>A company has a on-premise SQL Server instance with 16 databases out of which 4 of them require common Language Runtime (CLR) features. You want to be able to manage each of these databases separately as each of them have their own resource needs. In order to achieve this, you decide to migrate these databases to Azure using SQL commands for backup and restore. Which of the following is the most suitable deployment option to use in the given scenario?</p>","a":[{"id":1688861,"option":"Azure SQL Database managed instance","correct":true},{"id":1688862,"option":"Azure Cosmos DB with SQL API","correct":false},{"id":1688863,"option":"Azure SQL Database with an elastic pool","correct":false},{"id":1688864,"option":"Azure Cosmos DB with the Table API","correct":false}]},{"q":"<p>Your company wants to migrate an on-premise Microsoft SQL Server database to Azure. &nbsp;You are given the requirement that should be considered when migrating the database.<br>\nSERVER-1: This server hosts 2 databases. The company wants to have complete control over the underlying database server<br>\nWhich of the following will you recommend as the right technology in Azure for SERVER-1 ensuring costs are kept in check?</p>","a":[{"id":1688857,"option":"Azure SQL Database - Hyperscale","correct":false},{"id":1688858,"option":"Azure SQL Database - Elastic pools","correct":false},{"id":1688859,"option":"Azure SQL Database - Managed Instance","correct":false},{"id":1688860,"option":"SQL Database hosted on a virtual machine","correct":true}]},{"q":"<p>Your company wants to migrate an on-premises Microsoft SQL Server database to Azure SQL. You are given the requirement that should be considered when migrating the database.<br>\n<br>\nSERVER-1: This database server is hosting a single database. The company wants to ensure a simple Lift-and-shift migration for this database<br>\n<br>\nWhich of the following will you recommend as the right technology in Azure for SERVER-1 ensuring costs are kept in check?</p>","a":[{"id":1688853,"option":"Azure SQL Database - Hyperscale","correct":false},{"id":1688854,"option":"Azure SQL Database - Elastic pools","correct":false},{"id":1688855,"option":"Azure SQL Database - Managed Instance","correct":true},{"id":1688856,"option":"SQL Database hosted on a virtual machine","correct":false}]},{"q":"<p>Which of the following can be used to create more powerful application user accounts or less powerful management accounts when securing a dedicated SQL pool?</p>","a":[{"id":1688849,"option":"Use RBAC roles","correct":false},{"id":1688850,"option":"Create an Azure service principal ","correct":false},{"id":1688851,"option":"Create a database firewall rule","correct":false},{"id":1688852,"option":"Use database roles","correct":true}]},{"q":"<p>A company has set up an Azure SQL data warehouse where data would be loaded weekly from an Azure SQL database instance. You have to ensure that data engineers can only connect from their on-premise workstations to meet the security requirements for the data warehouse.<br>\nWhich of the following port must be enabled on the firewall for the data engineer's workstation in the given scenario?</p>","a":[{"id":1688845,"option":"80","correct":false},{"id":1688846,"option":"1433","correct":true},{"id":1688847,"option":"3306","correct":false},{"id":1688848,"option":"8080","correct":false}]},{"q":"<p>Your company wants to set up an Azure SQL database that will store sensitive Personally Identifiable Information (PII) data. Their objective behind this setup is to have the ability to track and store all the queries that are executed against the PII data. What should you do as a database administrator to achieve the objective behind the setup?</p>","a":[{"id":1688841,"option":"Adding classifications to the columns that contain sensitive data","correct":false},{"id":1688842,"option":"Add classifications to the columns that contain sensitive data and turn the Auditing on for the database","correct":true},{"id":1688843,"option":"Turn the Auditing on for the database","correct":false},{"id":1688844,"option":"Add classifications to all the rows of the table and turn the Auditing on for the database","correct":false}]},{"q":"<p>You have a collection of single databases with a shared set of resources such as CPU or memory. Which of the following Azure databases are you likely to be working with?</p>","a":[{"id":1688837,"option":"Single database","correct":false},{"id":1688838,"option":"Elastic Pool","correct":true},{"id":1688839,"option":"Managed Instance","correct":false},{"id":1688840,"option":"Database pool","correct":false}]},{"q":"<p>Your company is using an Azure SQL database containing tables and columns containing sensitive data. You have been asked to implement a solution to ensure that the sensitive data accessed from the columns is encrypted in transit.<br>\nWhich of the following would you use to encrypt the data in the given scenario?</p>","a":[{"id":1688833,"option":"Dynamic data masking","correct":false},{"id":1688834,"option":"Always encrypted","correct":true},{"id":1688835,"option":"Row-level security","correct":false},{"id":1688836,"option":"Transparent data encryption ","correct":false}]},{"q":"<p>A company wants to use an Azure SQL database service for some business applications that are accessing the database. In order to do so, it decides to create an Azure SQL database-managed instance. Which of the following will help the company if the database has to recover automatically in case of full or partial loss of the Azure SQL database service in the primary region?</p>","a":[{"id":1688829,"option":"Azure SQL data sync","correct":false},{"id":1688830,"option":"SQL Replication","correct":false},{"id":1688831,"option":"Failover-groups","correct":true},{"id":1688832,"option":"Active geo-replication","correct":false}]},{"q":"<p>Your company is using an on-premise Microsoft SQL Server and wants to migrate the database to Azure SQL databases. Which of the following must be used as the underlying storage type for the exported data in the given scenario?</p>","a":[{"id":1688825,"option":"Disk","correct":false},{"id":1688826,"option":"Blob","correct":true},{"id":1688827,"option":"File","correct":false},{"id":1688828,"option":"Queue","correct":false}]},{"q":"<p>Which of the following are valid monitoring and troubleshooting features provided by the Azure SQL database:</p>\n\n<ol>\n\t<li>Archive vast amounts of telemetry for a small price</li>\n\t<li>Integration of SQL Database telemetry with your custom monitoring solution or hot pipelines</li>\n\t<li>Identification of the potential performance issues</li>\n\t<li>A built-in monitoring solution with reporting, alerting, and mitigating capabilities</li>\n</ol>","a":[{"id":1688821,"option":"Only 2","correct":false},{"id":1688822,"option":"2, 3, and 4","correct":false},{"id":1688823,"option":"2 and 4","correct":false},{"id":1688824,"option":"Only 4","correct":true}]},{"q":"<p>Your company is using an on-premise Microsoft SQL Server and wants to migrate the database to Azure SQL databases. Which of the following must be used as a file type for exporting the on-premise database in the given scenario?</p>","a":[{"id":1688817,"option":"VHD","correct":false},{"id":1688818,"option":"DAC","correct":false},{"id":1688819,"option":"BACPAC","correct":true},{"id":1688820,"option":"VHDX","correct":false}]},{"q":"<p>You are working on an application where you would be using Azure SQL database and Azure storage accounts. The functions of the application includes</p>\n\n<ol>\n\t<li>Extracting data.</li>\n\t<li>Converting it to text documents.</li>\n\t<li>Storing them in storage accounts where the text documents would be accessible from an SMB network share.</li>\n</ol>\n\n<p>Which of the following will you use as the underlying service type for the Azure storage account in the given scenario?</p>","a":[{"id":1688813,"option":"Blob","correct":false},{"id":1688814,"option":"Queue","correct":false},{"id":1688815,"option":"Files","correct":true},{"id":1688816,"option":"Table","correct":false}]},{"q":"<p>You have used the proxy connection type to establish a TCP session using a gateway for an Azure managed instance. Which of the following is likely to occur once this session is established?</p>","a":[{"id":1688809,"option":"All subsequent packets flow through gateway","correct":true},{"id":1688810,"option":"Client session will obtain the destination virtual IP of the virtual cluster node from the load balancer","correct":false},{"id":1688811,"option":"Subsequent packets flow directly to the virtual cluster node","correct":false},{"id":1688812,"option":"None of these","correct":false}]},{"q":"<p>You want to connect directly to the node hosting the database while working with an Azure SQL Managed instance. Which of the following connections would you use to establish the connection in the given scenario?</p>","a":[{"id":1688805,"option":"Redirect","correct":true},{"id":1688806,"option":"Proxy","correct":false},{"id":1688807,"option":"Direct","correct":false},{"id":1688808,"option":"EIther Redirect or Proxy","correct":false}]},{"q":"<p>When working on a SQL database in Azure SQL, you get the following error message.</p>\n\n<p><strong>Error message</strong></p>\n\n<pre class=\"prettyprint\"><code>\"SqlErrorNumber=47073\". Error: Cannot connect to SQL Database: '%server;', Database: '%database;', User: '%user;'. Check the linked service configuration is correct, and make sure the SQL Database firewall allows the integration runtime to access.</code></pre>\n\n<p>What might be the potential cause for this error to occur?</p>","a":[{"id":1688753,"option":"Some specific operation failed","correct":false},{"id":1688754,"option":"An unstable network connection","correct":false},{"id":1688755,"option":"A mismatch between the source and sink column sizes","correct":false},{"id":1688756,"option":"The public network access is denied in the connectivity setting","correct":true}]},{"q":"<p>You get the following error message when working with Azure SQL Database.<br>\n&nbsp;<strong>Error message</strong></p>\n\n<pre class=\"prettyprint\"><code>A database operation failed. Check the SQL errors.</code></pre>\n\n<p>During troubleshooting, you find that such issues occur in the SQL sink and the error is related to SqlDateTime overflow. Which of the following is the best possible way to resolve this kind of error?</p>","a":[{"id":1688749,"option":"Cast the type to the string in the source SQL query","correct":false},{"id":1688750,"option":"Retry the activity and review the SQL database side metrics","correct":false},{"id":1688751,"option":"Change the column type to string in the copy activity column mapping","correct":false},{"id":1688752,"option":"Update the corresponding column type to the datetime2 type in the sink table","correct":true}]},{"q":"<p>You get the following error message when working with Azure SQL Database.</p>\n\n<p><strong>Error message</strong></p>\n\n<pre class=\"prettyprint\"><code>Column '%column;' does not exist in the table '%tableName;', ServerName: '%serverName;', DatabaseName: '%dbName;'.</code></pre>\n\n<p>What might be the possible reason behind this?</p>","a":[{"id":1688745,"option":"The credentials are incorrect","correct":false},{"id":1688746,"option":"A SQL database transient failure","correct":false},{"id":1688747,"option":"The query does not return any data","correct":false},{"id":1688748,"option":"The configuration might be incorrect","correct":true}]},{"q":"<p>When working with the Azure SQL database, you encountered an issue in the SQL source related to SqlDateTime overflow. Which of the following error codes will be displayed as a result of this?</p>","a":[{"id":1688741,"option":"SqlInvalidColumnName","correct":false},{"id":1688742,"option":"SqlInvalidDbQueryString","correct":false},{"id":1688743,"option":"SqlDataTypeNotSupported","correct":true},{"id":1688744,"option":"SqlInvalidDbStoredProcedure","correct":false}]},{"q":"<p>You get the following transient fault error when working on an Azure SQL Database service.</p>\n\n<p><strong>Error</strong></p>\n\n<pre class=\"prettyprint\"><code>\"The service has encountered an error processing your request. Please try again. Error code %d\".</code></pre>\n\n<p>What might be the possible cause for such an error to occur?</p>","a":[{"id":1688737,"option":"Requests are blocked for resource optimization","correct":false},{"id":1688738,"option":"There is already an existing dedicated administrator connection established to the SQL database","correct":false},{"id":1688739,"option":"The service is busy processing multiple create or update requests for your subscription or server","correct":false},{"id":1688740,"option":"The service is down due to software or hardware upgrades, hardware failures, or any other failover problems","correct":true}]},{"q":"<p>You get a transient error during the Azure SQL Database and SQL Managed Instance query command. What will you do in the given scenario?</p>","a":[{"id":1688733,"option":"After a delay of several seconds, retry the connection","correct":false},{"id":1688734,"option":"Immediately retry the command","correct":false},{"id":1688735,"option":"After a delay, freshly establish the connection and do not retry the command","correct":false},{"id":1688736,"option":"After a delay, freshly establish the connection and then retry the command","correct":true}]},{"q":"<p>You get the following error when working with the Azure SQL database.</p>\n\n<p><strong>Error</strong></p>\n\n<pre class=\"prettyprint\"><code>\"PdwManagedToNativeInteropException\". Error: A database operation failed. Please search error to get more details.</code></pre>\n\n<p>What might be the potential cause for the respective error?</p>","a":[{"id":1688729,"option":"Invalid input data","correct":false},{"id":1688730,"option":"Some specific operation failed","correct":false},{"id":1688731,"option":"An Azure SQL Database firewall issue","correct":false},{"id":1688732,"option":"A mismatch between the source and sink column sizes","correct":true}]},{"q":"<p>In which of the given scenarios is sharding required when working with Azure SQL databases?</p>\n\n<p><strong>Scenarios</strong></p>\n\n<ol>\n\t<li>The total amount of data is too large to fit within the constraints of an individual database.</li>\n\t<li>Transaction throughput of the overall workload exceeds the capabilities of an individual database.</li>\n\t<li>Separate databases are needed for each tenant.</li>\n</ol>","a":[{"id":1688725,"option":"1 and 2","correct":false},{"id":1688726,"option":"2 and 3","correct":false},{"id":1688727,"option":"1 and 3","correct":false},{"id":1688728,"option":"1, 2, and 3","correct":true}]},{"q":"<p>Which of these techniques is the most common way to horizontally scale an Azure SQL database?</p>","a":[{"id":1688721,"option":"Sharding","correct":true},{"id":1688722,"option":"Transaction","correct":false},{"id":1688723,"option":"Splitting","correct":false},{"id":1688724,"option":"None of these","correct":false}]},{"q":"<p>You want to scale a Azure SQL database using elastic database tools. In the given context, which of these dimensions of scaling can be used if you want to remove databases to adjust overall performance?</p>","a":[{"id":1688717,"option":"Horizontal scaling","correct":true},{"id":1688718,"option":"Vertical Scaling","correct":false},{"id":1688719,"option":"Sharding","correct":false},{"id":1688720,"option":"Either 2 or 3","correct":false}]},{"q":"<p>An Azure SQL database is unavailable because of an incident in the region where the database is hosted. Which of these business continuity options in an elastic pool can be used to provide default recovery for the database?</p>","a":[{"id":1688713,"option":"Point-in-time restore","correct":false},{"id":1688714,"option":"Geo-restore","correct":true},{"id":1688715,"option":"Active geo-replication","correct":false},{"id":1688716,"option":"Active db-restore","correct":false}]},{"q":"<p>Which of the following is irrelevant when choosing the best size for an elastic pool in Azure SQL Database?</p>","a":[{"id":1688709,"option":"Maximum compute resources and storage bytes utilized by all databases in the pool","correct":false},{"id":1688710,"option":"Maximum storage bytes utilized by a single database in the pool","correct":false},{"id":1688711,"option":"Maximum compute resources utilized by a single database in the pool","correct":false},{"id":1688712,"option":"Both 2 and 3","correct":true}]},{"q":"<p>You are using in-memory technology in Azure SQL to optimize performance. Which of these workloads can be used to update smaller sets of data when doing so?</p>","a":[{"id":1688705,"option":"Transactional (online transactional processing (OLTP))","correct":true},{"id":1688706,"option":"Analytic (online analytical processing (OLAP)) ","correct":false},{"id":1688707,"option":"Mixed (hybrid transaction/analytical processing (HTAP))","correct":false},{"id":1688708,"option":"Either 1 or 2","correct":false}]},{"q":"<p>You want to integrate Azure SQL Database telemetry with your custom monitoring solution or hot pipelines. Which of these Azure resources can be used to achieve this?</p>","a":[{"id":1688701,"option":"Azure Event Hubs","correct":true},{"id":1688702,"option":"Azure Storage","correct":false},{"id":1688703,"option":"Azure Monitor Logs","correct":false},{"id":1688704,"option":"None of these","correct":false}]},{"q":"<p>What is the benefit of using Access Control (IAM) module in Azure SQL?</p>","a":[{"id":1688697,"option":"You can control role assignments","correct":false},{"id":1688698,"option":"You can manage access to Azure resources","correct":false},{"id":1688699,"option":"Both 1 and 2","correct":true},{"id":1688700,"option":"Neither 1 nor 2","correct":false}]},{"q":"<p>You are running an application that accesses SQL Server on the same VM in Azure SQL. Which of the following SQL Server connectivity option is the most secure in the given context?</p>","a":[{"id":1688693,"option":"Local(inside VM only)","correct":true},{"id":1688694,"option":"Private(within virtual network)","correct":false},{"id":1688695,"option":"Public(Internet)","correct":false},{"id":1688696,"option":"Both 1 and 3","correct":false}]},{"q":"<p>Which of these services allows you to run SQL Server inside a fully managed virtual machine (VM) in Azure?</p>","a":[{"id":1688689,"option":"Platform as a Service","correct":false},{"id":1688690,"option":"Infrastructure as a Service","correct":true},{"id":1688691,"option":"Software as a Service","correct":false},{"id":1688692,"option":"Both Platform as a Service and Infrastructure as a Service","correct":false}]},{"q":"<p>Which of these steps should be taken first when trying to restore the Wide World Importers database to SQL Managed Instance in SQL Server Management Studio?</p>\n\n<ol>\n\t<li>Open SSMS</li>\n\t<li>Connect to your managed instance.</li>\n\t<li>Open SSMS and then connect to your managed instance</li>\n\t<li>Open object explorer and then connect to your managed instance</li>\n</ol>","a":[{"id":1687133,"option":"1","correct":false},{"id":1687134,"option":"2","correct":false},{"id":1687135,"option":"3","correct":true},{"id":1687136,"option":"4","correct":false}]},{"q":"<p>In which of these scenarios should you consider using instance pools?</p>\n\n<ol>\n\t<li>Scenarios where minimal IP address allocation in a VNet subnet is important.</li>\n\t<li>Scenarios where having a fixed cost or spending limit is important.</li>\n\t<li>Scenarios where minimal IP address allocation in a VNet subnet is important.</li>\n</ol>","a":[{"id":1687129,"option":"Only 1 and 2","correct":false},{"id":1687130,"option":"Only 2 and 3","correct":false},{"id":1687131,"option":"Only 1 and 3","correct":false},{"id":1687132,"option":"All 1, 2 and 3","correct":true}]},{"q":"<p>You have created a SQL Server virtual machine(VM) with a gallery image. You are running an application that accesses the SQL Server on the same VM.<br>\nWhich of the following is the most secure choice to provide accessibility to the application?</p>","a":[{"id":1687125,"option":"Local(inside VM only)","correct":true},{"id":1687126,"option":"Private(within virtual network)","correct":false},{"id":1687127,"option":"Public(Internet)","correct":false},{"id":1687128,"option":"None of these","correct":false}]},{"q":"<p>You are organising your data in Azure SQL database such that the rows in the table are placed in columnar format enabling the data to be compressed and execute fast analytical queries and reports on the table.<br>\nWhich of the following columnstore model will you use to achieve this?</p>\n\n<ol>\n\t<li>Clustered columnstore</li>\n\t<li>Non-clustered columnstore</li>\n\t<li>You can use both the models in the given scenario</li>\n\t<li>There is no model that highly compresses the data in the given scenario</li>\n</ol>","a":[{"id":1687101,"option":"1","correct":true},{"id":1687102,"option":"2","correct":false},{"id":1687103,"option":"3","correct":false},{"id":1687104,"option":"4","correct":false}]},{"q":"<p>While working with elastic pools in Azure SQL database, you found that the in-Memory OLTP storage is shared across all databases in the pool. This causes the usage in one database to potentially affect other databases.<br>\nWhat can you do to mitigate this issue?</p>\n\n<p><strong>Options</strong></p>\n\n<ol>\n\t<li>Configure a Max-eDTU that is lower than the eDTU count for the pool as a whole</li>\n\t<li>Configure a Min-eDTU or MinvCore that is greater than 0</li>\n\t<li>Configure a Min-eDTU or MinvCore that is smaller than 0</li>\n\t<li>Configure a MaxvCore that is higher than the vCore count for the pool as a whole</li>\n</ol>","a":[{"id":1687097,"option":"1","correct":true},{"id":1687098,"option":"2","correct":false},{"id":1687099,"option":"3","correct":false},{"id":1687100,"option":"4","correct":false}]},{"q":"<p>You get an out-ofquota error and you are not able to insert or update the data when working with in-Memory OLTP in Azure SQL database.<br>\nWhat will be the right course of action to mitigate this issue in the given scenario?</p>\n\n<p><strong>Options</strong></p>\n\n<ol>\n\t<li>Delete the data</li>\n\t<li>Increase the pricing tier of the database</li>\n</ol>\n\n<p> </p>","a":[{"id":1687093,"option":"1","correct":false},{"id":1687094,"option":"2","correct":false},{"id":1687095,"option":"Either 1 or 2","correct":true},{"id":1687096,"option":"None of these","correct":false}]},{"q":"<p>Which of the following items count towards your <em>In-Memory</em> OLTP storage cap when working with Azure SQL Database?</p>\n\n<ol>\n\t<li>Active user data rows in memory-optimized tables and table variables</li>\n\t<li>Indexes on memory-optimized tables</li>\n\t<li>Operational overhead of ALTER TABLE operations</li>\n</ol>","a":[{"id":1687089,"option":"1 and 2","correct":false},{"id":1687090,"option":"2 and 3","correct":false},{"id":1687091,"option":"1 and 3","correct":false},{"id":1687092,"option":"1, 2 and 3","correct":true}]},{"q":"<p>You decide to use the Azure SQL Database single databases using the DTU purchasing model. If you are going by the Basic Service Tier, what would be the Max DTUs in this tier?</p>","a":[{"id":1687085,"option":"2","correct":false},{"id":1687086,"option":"5","correct":true},{"id":1687087,"option":"7","correct":false},{"id":1687088,"option":"9","correct":false}]},{"q":"<p>You want to organize your in-memory data in Azure SQL Database in such a way that every row becomes a separate memory object.<br>\nWhich of the following methods will you use to do so?</p>\n\n<ol>\n\t<li>Memory-optimized rowstore</li>\n\t<li>Memory-optimized columnstore</li>\n\t<li>Memory-optimized Non-durable tables</li>\n\t<li>Memory-optimized durable tables</li>\n</ol>","a":[{"id":1687081,"option":"1","correct":true},{"id":1687082,"option":"2","correct":false},{"id":1687083,"option":"3","correct":false},{"id":1687084,"option":"4","correct":false}]},{"q":"<p>You decide to use the in-memory technology - clustered columnstore indexes to fit more data in your Azure SQL database and improve performance. How will you achieve this?</p>\n\n<p><strong>Options</strong></p>\n\n<ol>\n\t<li>By using it with fact tables in your data marts to fit more data in your database</li>\n\t<li>By concurrently running analytics queries very quickly on the same data</li>\n\t<li>By running an expensive extract, transform, and load (ETL) process</li>\n\t<li>By ingesting data from events or IoT devices</li>\n</ol>","a":[{"id":1687077,"option":"1","correct":true},{"id":1687078,"option":"2","correct":false},{"id":1687079,"option":"3","correct":false},{"id":1687080,"option":"4","correct":false}]},{"q":"<p>Which of these in-memory technology can you use in Azure SQL Database to do the following?<br>\na. Increase the number of transactions per second.<br>\nb. Reduce the latency for transaction processing.</p>\n\n<p><strong>Options</strong></p>\n\n<ol>\n\t<li>Clustered columnstore indexes</li>\n\t<li>In-Memory OLTP</li>\n\t<li>Nonclustered columnstore indexes</li>\n\t<li>Memory-optimized clustered columnstore indexes</li>\n</ol>","a":[{"id":1687073,"option":"1","correct":false},{"id":1687074,"option":"2","correct":true},{"id":1687075,"option":"3","correct":false},{"id":1687076,"option":"4","correct":false}]},{"q":"<p>You get the following error message when working with Azure SQL Database. SQL transaction commits failed. Which of these error codes will be displayed as a result of this?</p>","a":[{"id":1687069,"option":"SqlBatchWriteTimeout","correct":false},{"id":1687070,"option":"SqlUnauthorizedAccess","correct":false},{"id":1687071,"option":"SqlOpenConnectionTimeout","correct":false},{"id":1687072,"option":"SqlBatchWriteTransactionFailed","correct":true}]},{"q":"<p>You get the following error message when working with Azure SQL Database<br>\n\"Type '%dataType;' in source side cannot be mapped to a type that supported by sink side(column name:'%columnName;') in auto create the table.\"<br>\nWhich of the following is the best possible way to resolve this issue?</p>\n\n<ol>\n\t<li>Update the column type in mappings</li>\n\t<li>Manually create the sink table in the target server</li>\n\t<li>Verify the column in the query, structure in the dataset, and mappings in the activity</li>\n</ol>","a":[{"id":1687065,"option":"1","correct":false},{"id":1687066,"option":"2","correct":false},{"id":1687067,"option":"3","correct":false},{"id":1687068,"option":"Either 1 or 2","correct":true}]},{"q":"<p>Your company is planning to design a system that will consist of Azure virtual machine and an Azure SQL database. Since the database will not have internet connectivity, you need to implement a solution that can ensure the accessibility of the virtual machine to the database.<br>\nWhich of the following solutions will you choose to implement in the given scenario?</p>","a":[{"id":1686985,"option":"Add an application gateway","correct":false},{"id":1686986,"option":"Add a virtual network gateway","correct":false},{"id":1686987,"option":"Add an Azure load balancer","correct":false},{"id":1686988,"option":"Add a virtual network service endpoint","correct":true}]},{"q":"<p><strong>Scenario</strong></p>\n\n<p>Your company has been assigned a task to set up an Azure SQL database that will be used to store sensitive data. The following requirements need to be met by your solution:</p>\n\n<ul>\n\t<li>Encryption can be performed only by the application accessing the data.</li>\n\t<li>Access keys for encrypting and decrypting the data should be there with the client application.</li>\n\t<li>The data must not appear in plaintext in the database.</li>\n\t<li>The strongest encryption method must be used on the database</li>\n</ul>\n\n<p><strong>Problem</strong><br>\nWhich of the following would you use as the encryption method for Non-Searchable data in the given scenario?</p>\n\n<ol>\n\t<li>Always Encrypted with randomized encryption</li>\n\t<li>CREATE SYMMETRIC KEY statement</li>\n\t<li>Always Encrypted with deterministic encryption</li>\n\t<li>CREATE CERTIFICATE statement </li>\n</ol>","a":[{"id":1686981,"option":"1","correct":true},{"id":1686982,"option":"2","correct":false},{"id":1686983,"option":"3","correct":false},{"id":1686984,"option":"4","correct":false}]},{"q":"<p><strong>Scenario</strong></p>\n\n<p>Your company has been assigned a task to set up an Azure SQL database that will be used to store sensitive data. The following requirements need to be met by your solution:</p>\n\n<ul>\n\t<li>Encryption can be performed only by the application accessing the data</li>\n\t<li>Access keys for encrypting and decrypting the data should be there with the client application</li>\n\t<li>The data must not appear in plaintext in the database</li>\n\t<li>The strongest encryption method must be used on the database.</li>\n</ul>\n\n<p><strong>Problem</strong><br>\nWhich of the following would you use as the encryption method for Searchable data in the given scenario?</p>\n\n<ol>\n\t<li>Always Encrypted with randomized encryption</li>\n\t<li>CREATE SYMMETRIC KEY statement</li>\n\t<li>Always Encrypted with deterministic encryption</li>\n\t<li>CREATE CERTIFICATE statement </li>\n</ol>","a":[{"id":1686977,"option":"1","correct":false},{"id":1686978,"option":"2","correct":false},{"id":1686979,"option":"3","correct":true},{"id":1686980,"option":"4","correct":false}]},{"q":"<p>Your company uses an Azure SQL data warehouse. You have been asked to implement a solution that can ensure the availability of data in case of a data center failure. Also, the recovery point objective, in this case, should be an hour.<br>\nWhich of the following solutions will you implement in the given scenario?</p>\n\n<ol>\n\t<li>Restore the data warehouse from a geo-redundant backup</li>\n\t<li>Restore the data warehouse from a user-defined restore point</li>\n\t<li>Ensure to modify the Azure firewall rules of the data warehouse</li>\n</ol>","a":[{"id":1686973,"option":"1","correct":false},{"id":1686974,"option":"2","correct":true},{"id":1686975,"option":"3","correct":false},{"id":1686976,"option":"Both 1 and 2","correct":false}]},{"q":"<p>Your company is setting up an Azure SQL Data warehouse. The company wants to use users to use two-factor authentication when they access data from data warehouse using SQL Server Management Studio.<br>\nWhich of the following solutions should the company implement to achieve the desired objective?</p>\n\n<ol>\n\t<li>Azure AD Privileged Identity Management</li>\n\t<li>Azure AD Identity Protection</li>\n\t<li>Azure key vault</li>\n\t<li>Azure conditional access policies</li>\n</ol>","a":[{"id":1686969,"option":"1","correct":false},{"id":1686970,"option":"2","correct":false},{"id":1686971,"option":"3","correct":false},{"id":1686972,"option":"4","correct":true}]},{"q":"<p>In an SQL database, you are want to create SQL logins with limited administrative permissions.<br>\nWhen will you use the ALTER ROLE statement in the given scenario?</p>\n\n<ol>\n\t<li>To add the user account to dbmanager role </li>\n\t<li>To add the user account to loginmanager role</li>\n\t<li>To add the user account to dbmanager and loginmanager role</li>\n</ol>","a":[{"id":1686965,"option":"1","correct":false},{"id":1686966,"option":"2","correct":false},{"id":1686967,"option":"3","correct":true},{"id":1686968,"option":"None of these","correct":false}]},{"q":"<p>You want to create SQL logins with full administrative permissions in an Azure SQL Managed instance. Which of the following statements will you use to add the login to the sysadmin fixed server role in the given context?</p>","a":[{"id":1686961,"option":" ALTER SERVER ROLE","correct":true},{"id":1686962,"option":"CREATE LOGIN","correct":false},{"id":1686963,"option":"ALTER AD LOGIN","correct":false},{"id":1686964,"option":" CREATE SERVER ROLE","correct":false}]},{"q":"<p>You want to use the FileTable options while working with the CREATE and ALTER TABLE statements.<br>\nWhich of the following statements will hold true in the given scenario?</p>\n\n<ol>\n\t<li>FileTable options can't be used on SQL Database because FILESTREAM isn't supported</li>\n\t<li>FileTable options can be used on SQL Database because FILESTREAM is supported</li>\n\t<li>FileTable options can't be used on SQL Database even though FILESTREAM is supported</li>\n\t<li>FileTable options can be used on SQL Database even though FILESTREAM isn't supported</li>\n</ol>","a":[{"id":1686957,"option":"1","correct":true},{"id":1686958,"option":"2","correct":false},{"id":1686959,"option":"3","correct":false},{"id":1686960,"option":"4","correct":false}]},{"q":"<p>Which of the following are NOT valid multi-model features provided by Azure SQL family of products?<br>\n1. Graph features<br>\n2. Spatial features<br>\n3. Key-value pairs<br>\n4. XQuery features</p>","a":[{"id":1686861,"option":"Only 1","correct":false},{"id":1686862,"option":"Only 2","correct":false},{"id":1686863,"option":"Only 3","correct":false},{"id":1686864,"option":"Only 4","correct":true}]},{"q":"<p>What should you do if the number of databases in a pool approaches the maximum supported databases?</p>\n\n<p><strong>Options</strong></p>\n\n<p>1. Consider Resource management in dense elastic pools</p>\n\n<p>2. Consider assessing database utilisation pattern </p>\n\n<p>3. Consider multiple databases with persistent medium-high utilization</p>\n\n<p>4. Use standard pools</p>","a":[{"id":1686857,"option":"1","correct":true},{"id":1686858,"option":"2","correct":false},{"id":1686859,"option":"3","correct":false},{"id":1686860,"option":"4","correct":false}]},{"q":"<p>You notice a downtime for a period of time when moving databases out of a pool.<br>\nWhen does this downtime occur?</p>\n\n<p><strong>Options</strong></p>\n\n<p>1. When database connections are started</p>\n\n<p>2. When database connections are dropped</p>\n\n<p>3. When databases are moved</p>","a":[{"id":1686853,"option":"1","correct":false},{"id":1686854,"option":"2","correct":true},{"id":1686855,"option":"3","correct":false},{"id":1686856,"option":"Both 1 and 2","correct":false}]},{"q":"<p>How many servers are required for the databases in a Azure SQL Database elastic pool?</p>","a":[{"id":1686849,"option":"Single server","correct":true},{"id":1686850,"option":"Multiple server","correct":false},{"id":1686851,"option":"Two servers","correct":false},{"id":1686852,"option":"Cannot be determined","correct":false}]},{"q":"<p>What determines the number of managed instances that can be deployed in the subnet of a Virtual network when deploying a Azure SQL Managed Instance?</p>","a":[{"id":1678397,"option":"The size of the subnet or subnet range.","correct":true},{"id":1678398,"option":"The tier you selected during provisioning","correct":false},{"id":1678399,"option":"The IP addresses in a subnet","correct":false},{"id":1678400,"option":"None of these","correct":false}]},{"q":"<p>You want to migrate your user databases from SQL Server to an instance of SQL Server on Azure Virtual Machines (VMs).</p>\n\n<p>In which of the following should the SQL Server run in order to achieve this?<br>\n1. Amazon Web Services (AWS) EC2<br>\n2. SQL Server on Virtual Machines<br>\n3. Amazon Relational Database Service</p>","a":[{"id":1678393,"option":"2 and 3","correct":false},{"id":1678394,"option":"1 and 3","correct":false},{"id":1678395,"option":"1 and 2","correct":false},{"id":1678396,"option":"1, 2 and 3","correct":true}]},{"q":"<p>You are migrating an Azure SQL Database from the DTU-based purchasing model to the vCore-based purchasing model. Which of the following actions is similar to the above scenario?</p>\n\n<p><strong>Actions</strong></p>\n\n<p>1. Calling between service objectives in the Basic service tier with similar duration and a minimal downtime at the end of the migration process</p>\n\n<p>2. Calling between service objectives in the Standard service tier with similar duration and a minimal downtime at the end of the migration process</p>\n\n<p> </p>","a":[{"id":1678389,"option":"1","correct":false},{"id":1678390,"option":"2","correct":false},{"id":1678391,"option":"Both 1 and 2","correct":true},{"id":1678392,"option":"None of these","correct":false}]},{"q":"<p>You are migrating a database from SQL server to Azure SQL using Database Migration Service. Which of the following resource providers should you register in your subscription when doing so?</p>","a":[{"id":1678385,"option":"Microsoft.DataMigration ","correct":true},{"id":1678386,"option":"Microsoft.MigrationSource","correct":false},{"id":1678387,"option":"Microsoft.MigrationTarget","correct":false},{"id":1678388,"option":"Both 1 and 2","correct":false}]},{"q":"<p>Which of the following connections are allowed when the <em>Deny public network access</em> is set to \"Yes\" in Azure SQL connectivity settings?</p>","a":[{"id":1678381,"option":"Connections via private endpoints","correct":true},{"id":1678382,"option":"Connections via public endpoints","correct":false},{"id":1678383,"option":"Connections with virtual-network-based firewall rules","correct":false},{"id":1678384,"option":"Connections using Azure Private Link","correct":false}]},{"q":"<p>You have created a server-level firewall rule using the Azure portal when working with Azure SQL Database. In the given scenario, which of the following firewall rules enables all Azure services to pass through the server-level firewall rule?</p>","a":[{"id":1678377,"option":"0.0.0.0 ","correct":true},{"id":1678378,"option":"1.1.1.1","correct":false},{"id":1678379,"option":"0.1.0.1","correct":false},{"id":1678380,"option":"1.0.1.0","correct":false}]},{"q":"<p>On which of the following clusters is the <em>Premium/Business Critical service tier model</em> of the Azure SQL Database based?<br>\n1. It is based on a cluster of database engine processes<br>\n2. It is based on a cluster available on the database engine nodes<br>\n3. It is based on a cluster that has a minimal performance impact on your workload</p>","a":[{"id":1678373,"option":"1","correct":false},{"id":1678374,"option":"2 and 3","correct":false},{"id":1678375,"option":"1 and 3","correct":false},{"id":1678376,"option":"1, 2 and 3","correct":true}]},{"q":"<p>Which of these Azure SQL database services tiers is <em>not</em> available for SQL Managed Instances?</p>","a":[{"id":1678369,"option":"Hyperscale","correct":true},{"id":1678370,"option":"Compute","correct":false},{"id":1678371,"option":"Buffer","correct":false},{"id":1678372,"option":"Column Store","correct":false}]},{"q":"<p>What does <em>Azure AD authentication</em> use to authenticate identities at the database level in Azure SQL Database?</p>","a":[{"id":1678357,"option":"Role based access control","correct":false},{"id":1678358,"option":"Access keys","correct":false},{"id":1678359,"option":"Shared access signature","correct":false},{"id":1678360,"option":"A contained database user","correct":true}]},{"q":"<p>You are using the <em>point-in-time restore</em> to recover from data corruptions when working with Azure SQL Database. However, the maximum retention period is not sufficient for your application. Which of the following retention policies can you use to store your backups for a long period of time?</p>","a":[{"id":1678353,"option":"Long-term retention policy","correct":true},{"id":1678354,"option":"Short-term retention policy","correct":false},{"id":1678355,"option":"Database retention policy","correct":false},{"id":1678356,"option":"Backup retention policy","correct":false}]},{"q":"<p>You decide to use Auto-failover group to enable business continuity in case of datacenter outage when working with Azure SQL Database. What will happen as a result of this?</p>","a":[{"id":1678349,"option":"Application will automatically recover","correct":true},{"id":1678350,"option":"Readable replicas will be created","correct":false},{"id":1678351,"option":"Row versions will be restored from any point in time","correct":false},{"id":1678352,"option":"Backups will be kept for 10 years","correct":false}]},{"q":"<p>You want to create readable replicas and manual failover to any replica in case of a datacenter outage. Which of the following business continuity features of Azure SQL Database can be used to achieve this?</p>","a":[{"id":1678345,"option":"Temporal tables","correct":false},{"id":1678346,"option":" Point in Time Restore","correct":false},{"id":1678347,"option":"Active geo-replication","correct":true},{"id":1678348,"option":"Auto-failover group","correct":false}]},{"q":"<p>You want to manage some historical data in temporary tables in Azure SQL database. To do so, you want to move the oldest portion of the historical data from the history table and keep the size of the retained part constant in terms of age. Which of the following approach will be suitable to achieve this?</p>","a":[{"id":1678321,"option":"Table Partitioning","correct":true},{"id":1678322,"option":"Custom Cleanup Script","correct":false},{"id":1678323,"option":"Either Table Partitioning or Custom Cleanup Script","correct":false},{"id":1678324,"option":"None of these","correct":false}]},{"q":"<p>There is a company planning to use the Azure SQL data warehouse service for its requirement where data would be uploaded to the data warehouse every week. Checks would be made every time the data is uploaded to ensure that the data is not corrupted. If the data is corrupted, the uploaded data has to be removed.<br>\nAdditionally, the upload process and data corruption check process must not impact the processes running against the warehouse. Which of the following solutions would meet the requirement of the company discussed above?</p>","a":[{"id":1678241,"option":"The company can configure transactions and then perform a rollback if data corruption is detected","correct":false},{"id":1678242,"option":"The company can create user-defined restore points before the data is uploaded and then delete the restore point after the corruption checks are complete","correct":true},{"id":1678243,"option":"The company can configure database-level auditing and set a retention period as part of implementation process","correct":false},{"id":1678244,"option":"Both 1 and 2","correct":false}]},{"q":"<p>A company wants to use the Azure SQL database service. Given that business apps will be accessing the database and the application data must be available in the event of a region-wide outage. Below are the key requirements that need to be fulfilled:<br>\n1. Data must be available in the secondary region if the primary region goes down.<br>\n2. The storage and compute layers for the SQL database must be integrated and replicated together.</p>\n\n<p>Which of the following would you use as the Service tier for the database?</p>","a":[{"id":1678233,"option":"Basic \r\n","correct":false},{"id":1678234,"option":"Standard","correct":false},{"id":1678235,"option":"Premium ","correct":true},{"id":1678236,"option":"High","correct":false}]},{"q":"<p>You have been assigned a task to deploy a set of databases using the Azure SQL database service. The databases will be organized into separate groups based on their usage during the deployment of the Azure SQL. Additionally, you need to ensure that there is a defined maximum limit on the resources that will be able for each group.<br>\nWhich of the following solutions will you recommend for meeting the requirements in the given scenario?</p>","a":[{"id":1678229,"option":"Azure SQL Database Hyperscale","correct":false},{"id":1678230,"option":"Azure SQL Database Single Instance","correct":false},{"id":1678231,"option":"Azure SQL Database Elastic Pools","correct":true},{"id":1678232,"option":"Azure SQL Database Sharding","correct":false}]},{"q":"<p>Your company is using an Azure SQL database containing tables and columns having sensitive data. You have been asked to ensure that when this sensitive data is accessed from the columns, it is encrypted in transit. Which of the following would you use in the given scenario?</p>","a":[{"id":1678225,"option":"Dynamic data masking","correct":false},{"id":1678226,"option":"Always encrypted","correct":true},{"id":1678227,"option":"Row-level security","correct":false},{"id":1678228,"option":"Transparent data encryption ","correct":false}]},{"q":"<p>You are tasked with building an Azure SQL database service for certain business apps in your company. You have already decided to use an Azure SQL database managed instance to make the data available to the business apps via this service.<br>\nAdditionally, you need to ensure that, in case of full or partial loss of the Azure SQL database service in the primary region, the database will automatically recover from the loss.<br>\nWhich of the following can be used to achieve the desired objective?</p>","a":[{"id":1678221,"option":"Azure SQL data sync","correct":false},{"id":1678222,"option":"SQL Replication","correct":false},{"id":1678223,"option":"Failover-groups","correct":true},{"id":1678224,"option":"Active geo-replication","correct":false}]},{"q":"<p>Your company is using an on-premise Microsoft SQL Server and wants to migrate the database to Azure SQL databases. Which of the following must be used as an underlying storage type for the exported data in the given scenario?</p>","a":[{"id":1678217,"option":"Disk","correct":false},{"id":1678218,"option":"Blob","correct":true},{"id":1678219,"option":"File","correct":false},{"id":1678220,"option":"Queue","correct":false}]},{"q":"<p>You are configuring the SQL database to store resource usage, workers, and sessions. Which of the following benefits would you get by connecting Azure SQL Database to Azure Monitor logs in the given scenario?<br>\n<strong>Benefits</strong><br>\na) You can archive vast amounts of telemetry for a small price.<br>\nb) You can perform integration of SQL Database telemetry with your custom monitoring solution or hot pipelines<br>\nc) You can perform identification of the potential performance issues<br>\nd) You will have a built-in monitoring solution with reporting, alerting, and mitigating capabilities</p>","a":[{"id":1678213,"option":"Only (b)","correct":false},{"id":1678214,"option":"(b), (c) and (d)","correct":false},{"id":1678215,"option":"(b) and (d)","correct":false},{"id":1678216,"option":"Only (d)","correct":true}]},{"q":"<p>You are working on an application where you would be using Azure SQL database and Azure storage accounts. The functions of the application include extracting data, converting it to text documents, and storing them in storage accounts where the text documents would be accessible from an SMB network share.<br>\nWhich of the following will you use as the underlying service type for the Azure storage account in the given scenario?</p>","a":[{"id":1678205,"option":"Blob","correct":false},{"id":1678206,"option":"Queue","correct":false},{"id":1678207,"option":"Files","correct":true},{"id":1678208,"option":"Table","correct":false}]},{"q":"<p>Which of these Azure SQL Database purchasing models can automatically do the following tasks?<br>\n<strong>Tasks</strong><br>\n1. Pause databases during inactive periods when only storage is billed<br>\n2. Resume databases when activity returns.</p>","a":[{"id":1678201,"option":"Tabular Model","correct":false},{"id":1678202,"option":"POSIX-style model","correct":false},{"id":1678203,"option":"DTU-based purchasing model","correct":false},{"id":1678204,"option":"Serverless model","correct":true}]},{"q":"<p>You want to use automatic scaling property after building your app on a single Azure SQL database. Which of the following would you use to do so?<br>\na) Scripts<br>\nb) Dynamic scalability<br>\nc) Elastic Pool</p>","a":[{"id":1678185,"option":"c","correct":false},{"id":1678186,"option":"b and c","correct":false},{"id":1678187,"option":"a and b","correct":false},{"id":1678188,"option":"a and c","correct":true}]},{"q":"<p>You have an Azure SQL single database in the <em>general-purpose service tier</em>. You want to ensure that this database can transparently respond to rapidly changing resource requirements. Which of these properties would you configure to meet your objective?</p>","a":[{"id":1678181,"option":"Dynamic scalability","correct":true},{"id":1678182,"option":"SQL Managed Instance","correct":false},{"id":1678183,"option":"Elastic Pool","correct":false},{"id":1678184,"option":"autoscale","correct":false}]},{"q":"<p>You want to choose the best size for a pool depending on the aggregate resources needed for all databases in the pool.<br>\nWhich of the following should you determine in order to achieve this?</p>","a":[{"id":1678057,"option":"Maximum compute resources utilized by all databases in the pool.","correct":false},{"id":1678058,"option":"Maximum storage bytes utilized by all databases in the pool.","correct":false},{"id":1678059,"option":"Both 1 and 2","correct":true},{"id":1678060,"option":"None of these","correct":false}]},{"q":"<p>When working with <em>Azure</em> SQL Database, you get the following error message:</p>\n\n<p><em>\"SQL transaction commits failed.\"</em><br>\n<br>\nDuring troubleshooting, you find out that the issue arises due to a transaction timeout. What could be the possible reason behind this?</p>","a":[{"id":1677929,"option":"A SQL database side issue","correct":false},{"id":1677930,"option":"The network latency between the integration runtime and the database is greater than the default threshold of 30 seconds","correct":true},{"id":1677931,"option":"The data value exceeds the logic type range","correct":false},{"id":1677932,"option":"The data value exceeds the allowed range in the sink table","correct":false}]},{"q":"<p>You want to use <em>Azure</em> SQL Analytics to its fullest extent for monitoring Azure SQL Database. Which of the following roles will not allow you to do so?</p>","a":[{"id":1677925,"option":"Owner","correct":false},{"id":1677926,"option":"Contributor","correct":false},{"id":1677927,"option":"SQL DB Contributor","correct":false},{"id":1677928,"option":"Reader","correct":true}]},{"q":"<p>You are observing an <em>Azure</em> SQL database for its usage in Azure portal. When doing so, you found a <em>1</em>-minute window with the following four data points:</p>\n\n<ul>\n\t<li> 0.1</li>\n\t<li> 0.1</li>\n\t<li> 0.9</li>\n\t<li> 0.1</li>\n</ul>\n\n<p> What could be the average of these data points in the given scenario?</p>","a":[{"id":1677921,"option":"0.3","correct":false},{"id":1677922,"option":"0.25","correct":true},{"id":1677923,"option":"0.433","correct":false},{"id":1677924,"option":"0","correct":false}]},{"q":"<p>Consider a scenario where a SQL Database UPDATE statement in <em>Azure</em> fails with a transient error. Which of the following statements is incorrect with respect to retrying the connection for the occurred transient error?</p>","a":[{"id":1677917,"option":"Establish a fresh connection before you retry the UPDATE","correct":false},{"id":1677918,"option":"Retry the UPDATE without establishing a fresh connection","correct":true},{"id":1677919,"option":"Retry logic must ensure that the entire transaction is rolled back","correct":false},{"id":1677920,"option":"Retry logic must ensure that the entire database transaction finished","correct":false}]},{"q":"<p>While establishing a connection to the \"ExampleServer\" in <em>Azure</em> SQL Database, you get the following error message:</p>\n\n<p><em>\"Error 5: Cannot connect to ExampleServer\"</em><br>\nWhat will you do to resolve this issue?</p>","a":[{"id":1677913,"option":"Make sure that port 1433 is open for outbound connections on all firewalls between the client and the internet","correct":true},{"id":1677914,"option":"Configure firewall settings on SQL Database through the Azure portal","correct":false},{"id":1677915,"option":"Contact your service administrator to provide you with a valid username and password","correct":false},{"id":1677916,"option":"None of these","correct":false}]},{"q":"<p>You want to configure the automatic high availability option for a recently migrated SQL database in <em>Azure</em> Virtual Machine. Which of the following deductions are invalid in the given context?</p>","a":[{"id":1677909,"option":"We can configure your high availability solution manually","correct":false},{"id":1677910,"option":"We can use templates in the Azure portal for automatic configuration","correct":false},{"id":1677911,"option":"SQL Server in VM can be entirely configured automatically","correct":true},{"id":1677912,"option":"Configure SQL Server Availability Groups","correct":false}]},{"q":"<p>Assume that there is a table located on a remote databases in <em>Azure</em> SQL Database with the same schema. You have a vertical partitioning scenario that requires access to this table. Given below are given steps to configure the elastic database queries for third vertical partitioning in the given scenario:</p>\n\n<ol>\n\t<li>CREATE DATABASE SCOPED CREDENTIAL</li>\n\t<li>CREATE/DROP EXTERNAL TABLE</li>\n\t<li>CREATE MASTER KEY</li>\n\t<li>CREATE/DROP EXTERNAL DATA SOURCE</li>\n</ol>\n\n<p>Which of the following options depicts the correct sequence in which these steps take place?</p>","a":[{"id":1677905,"option":"3->1->4->2","correct":true},{"id":1677906,"option":"2->4->3->1","correct":false},{"id":1677907,"option":"3->4->1->2","correct":false},{"id":1677908,"option":"3->4->2->1","correct":false}]},{"q":"<p>Your company wants to use an <em>Azure</em> SQL database warehouse instance. In this warehouse, millions of rows of data will be loaded every day and staging tables have been set up for the data load process. Which of the following will you use as the distribution option to optimize the data loading process in the given scenario?</p>","a":[{"id":1677901,"option":"Replicated","correct":false},{"id":1677902,"option":"Hash-distributed","correct":false},{"id":1677903,"option":"Round-robin","correct":true},{"id":1677904,"option":"External","correct":false}]},{"q":"<p>You have been asked to use an <em>Azure</em> SQL database for a new project. In the given scenario, which of the following is the third type of backup that will be taken by the SQL Database service?</p>","a":[{"id":1677897,"option":"A full daily backup","correct":false},{"id":1677898,"option":"A differential backup taken from the last 12 hours","correct":true},{"id":1677899,"option":"Differential backups taken since last full backup","correct":false},{"id":1677900,"option":"Log backups taken since last full backup","correct":false}]},{"q":"<p>You have been asked to use an <em>Azure</em> SQL database for a new project. In the given scenario, which of the following is the first type of backup that will be taken by the SQL database service?</p>","a":[{"id":1677893,"option":"A full daily backup","correct":false},{"id":1677894,"option":"A full weekly backup","correct":true},{"id":1677895,"option":"A differential daily backup","correct":false},{"id":1677896,"option":"A differential weeklybackup","correct":false}]},{"q":"<p>You want to have more flexibility, control, and transparency while choosing a purchasing model in <em>Azure</em> SQL. Which of the following purchasing models would you choose in the given scenario?</p>","a":[{"id":1677813,"option":"DTU-based","correct":false},{"id":1677814,"option":"vCore Based","correct":true},{"id":1677815,"option":"Either DTU-based and vCore-Based","correct":false},{"id":1677816,"option":"Neither DTU-based and vCore-Based","correct":false}]},{"q":"<p>Which of the following cannot be considered as a vCore purchasing model for an <em>Azure</em> SQL project?</p>","a":[{"id":1677809,"option":"General Purpose","correct":false},{"id":1677810,"option":"Business Critical","correct":false},{"id":1677811,"option":"Premium ","correct":true},{"id":1677812,"option":"Hyperscale","correct":false}]},{"q":"<p>Alice is working on the DTU purchasing model in Azure SQL. Which of the following cannot be considered as a DTU purchasing model for an <em>Azure</em> SQL project?</p>","a":[{"id":1677805,"option":"Basic","correct":false},{"id":1677806,"option":"Standard","correct":false},{"id":1677807,"option":"Business Critical","correct":true},{"id":1677808,"option":"Premium","correct":false}]},{"q":"<p>Which of the following set of action groups is included in the default auditing policy of the <em>Azure</em> SQL auditing server:</p>\n\n<p><strong>Options</strong></p>\n\n<ol>\n\t<li>BATCH_COMPLETED_GROUP</li>\n\t<li>SUCCESSFUL_DATABASE_AUTHENTICATION_GROUP</li>\n\t<li>FAILED_DATABASE_AUTHENTICATION_GROUP</li>\n</ol>","a":[{"id":1677801,"option":"1 and 2","correct":false},{"id":1677802,"option":"2 and 3","correct":false},{"id":1677803,"option":"1 and 3","correct":false},{"id":1677804,"option":"All of these","correct":true}]},{"q":"<p>How should auditing be enabled for <em>Azure</em> SQL databases when performing database-level auditing for secondary geo-replicated databases?</p>","a":[{"id":1677797,"option":"Auditing must be enabled on the primary database ","correct":true},{"id":1677798,"option":"Auditing must be enabled on the primary server","correct":false},{"id":1677799,"option":"Auditing must be enabled on the secondary server","correct":false},{"id":1677800,"option":"Auditing must be enabled on the secondary database","correct":false}]},{"q":"<p>What is the maximum concurrent worker value for a Gen5 compute model with 2 vCores per database in<em> Azure</em> SQL elastic pools?</p>","a":[{"id":1677793,"option":"10","correct":false},{"id":1677794,"option":"100","correct":false},{"id":1677795,"option":"200","correct":true},{"id":1677796,"option":"50","correct":false}]},{"q":"<p>You want to refer to the underlying data source when partitioning an <em>Azure</em> SQL database vertically. Which of these permissions do you need to have in order to do so?</p>","a":[{"id":1677789,"option":"ALTER ANY EXTERNAL DATA SOURCE","correct":true},{"id":1677790,"option":"ALTER DATABASE","correct":false},{"id":1677791,"option":"ALTER EXTERNAL DATABASE ","correct":false},{"id":1677792,"option":"ALTER DATA SOURCE","correct":false}]},{"q":"<p>What should you do to immediately invalidate a client agent in the <em>Azure</em> SQL Data Sync service?</p>","a":[{"id":1677785,"option":"Regenerate its key in the portal but do not submit it in the Agent UI","correct":true},{"id":1677786,"option":"Delete the agent","correct":false},{"id":1677787,"option":"Record its key with SQL Data Sync service","correct":false},{"id":1677788,"option":"An agent can only be invalidated when it is online","correct":false}]},{"q":"<p>Bob is working on Data Sync Agent in <em>Azure</em> SQL. He wants to create a new key. What should be ensured when creating a new key for an existing client agent in Azure SQL Data Sync service?</p>","a":[{"id":1677781,"option":"Make sure that the same key is recorded with the client agent","correct":false},{"id":1677782,"option":"Make sure that the same key is recorded with the SQL Data Sync service","correct":false},{"id":1677783,"option":"Make sure that the same key is recorded with the client agent and with the SQL Data Sync service","correct":true},{"id":1677784,"option":"Don't record the same key with the client agent and with the SQL Data Sync service","correct":false}]},{"q":"<p>You are using Data Sync Agent to sync data with <em>Azure</em> SQL Server databases. How many instances of the local agent UI can be run in the given scenario?</p>","a":[{"id":1677777,"option":"0","correct":false},{"id":1677778,"option":"1","correct":true},{"id":1677779,"option":"2","correct":false},{"id":1677780,"option":"3","correct":false}]},{"q":"<p>A ticket has been raised stating the the DB tables size is increasing and on-premises storage is running low. You have been asked to design a cost-effective and secure solution to store less queried DB tables on <em>Azure</em>. Which of the following can you use to achieve this objective?</p>","a":[{"id":1677637,"option":"Azure SQL database","correct":false},{"id":1677638,"option":"Azure SQL stretch database","correct":true},{"id":1677639,"option":"Azure analysis service","correct":false},{"id":1677640,"option":"Azure sql data warehouse","correct":false}]},{"q":"<p>Which of the following statements is true about the DTU-based purchasing model in Azure SQL Database?</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li> Azure SQL Managed Instance supports a DTU-based purchasing model.</li>\n\t<li> All service tiers in the DTU-based purchase model provide flexibility of changing compute sizes with minimal downtime</li>\n</ol>","a":[{"id":1677573,"option":"Only 1","correct":false},{"id":1677574,"option":"Only 2","correct":false},{"id":1677575,"option":"Both 1 and 2","correct":true},{"id":1677576,"option":"None of these","correct":false}]},{"q":"<p>Your company wants to set up an Azure SQL database that will store sensitive Personally Identifiable Information (PII) data. The objective is to be able to track and store all the queries that are executed against the PII data. Which of the given actions will you take to achieve the desired objective?</p>\n\n<p><strong>Actions</strong></p>\n\n<ol>\n\t<li> Implementation of Transparent Data Encryption</li>\n\t<li> Create a SELECT trigger on the table in the database that will write data to a new table in the database and then a stored procedure would be executed to lookup column classifications and perform joins</li>\n</ol>","a":[{"id":1677569,"option":"Only 1","correct":false},{"id":1677570,"option":"Only 2","correct":false},{"id":1677571,"option":"Both 1 and 2","correct":false},{"id":1677572,"option":"None of these","correct":true}]},{"q":"<p>Your company has decided to use the Azure SQL Database along with elastic pools for storing customer information in the tables. Each record in the table will have a value for the column CustomerlD. Which of the following will fulfill your requirement of partitioning the data based on the values in the column CustomerlD in the given scenario?</p>","a":[{"id":1677565,"option":"Separate the data into regions by using vertical partitioning","correct":false},{"id":1677566,"option":"Separate the data into shards and use horizontal partitioning","correct":true},{"id":1677567,"option":"Separate the data into regions by using horizontal partitioning","correct":false},{"id":1677568,"option":"None of these","correct":false}]},{"q":"<p>You want to enable easy migration of on-premises SQL databases to Azure SQL databases using a fully-managed database instance. Which of the following deployment models should you use to do so?</p>","a":[{"id":1677561,"option":"Single database","correct":false},{"id":1677562,"option":"Elastic Pool","correct":false},{"id":1677563,"option":"Managed Instance","correct":true},{"id":1677564,"option":"Database pool","correct":false}]},{"q":"<p>You are encrypting an entire Azure SQL database using the Transparent Data Encryption(TDE). Which of the following encryption algorithm will be used by the TDE to encrypt the database in the given scenario?</p>","a":[{"id":1677557,"option":"Advanced Encryption Standard","correct":true},{"id":1677558,"option":"Data Encryption Standard","correct":false},{"id":1677559,"option":"Triple data encryption algorithm","correct":false},{"id":1677560,"option":"RSA Asymmetric Encryption Algorithm","correct":false}]},{"q":"<p>You are using the automated backups with geo-redundant storage for recovery in case of data center outage when working with Azure SQL Database. Which of the following will you use to recover the database while having such backups?</p>","a":[{"id":1677553,"option":"Geo-restore","correct":true},{"id":1677554,"option":"Fail-over","correct":false},{"id":1677555,"option":"Geo-replication","correct":false},{"id":1677556,"option":"Database recovery objective","correct":false}]},{"q":"<p>Assume that there are a set of tables located on several remote databases in an Azure SQL Database. You have a horizontal partitioning scenario that requires access to these tables. You are following steps to configure elastic database queries for this horizontal partitioning.<br>\nIn the given scenario, after which of these steps will you create a shard map that will represent your data tier using the elastic database client library?</p>","a":[{"id":1677477,"option":"CREATE DATABASE SCOPED CREDENTIAL","correct":true},{"id":1677478,"option":"CREATE/DROP EXTERNAL TABLE ","correct":false},{"id":1677479,"option":"CREATE MASTER KEY ","correct":false},{"id":1677480,"option":"CREATE/DROP EXTERNAL DATA SOURCE","correct":false}]},{"q":"<p>You decide to use a collection of databases with a shared set of resources managed via a logical SQL server when deploying Azure SQL Database. Which of these deployment options is being implemented in the given scenario?</p>","a":[{"id":1677473,"option":"Hyperscale","correct":false},{"id":1677474,"option":"Elastic pools","correct":true},{"id":1677475,"option":"Managed Instance","correct":false},{"id":1677476,"option":"SQL Database hosted on a virtual machine","correct":false}]},{"q":"<p>Your company needs to set up an Azure SQL data warehouse where data would be loaded weekly from an Azure SQL database instance. You have to ensure the data is encrypted at rest to meet the security requirements for the data warehouse. Which of the following would you recommend for encrypting the data in the given scenario?</p>","a":[{"id":1677469,"option":"Azure disk encryption ","correct":false},{"id":1677470,"option":"Transparent data encryption","correct":true},{"id":1677471,"option":"SSL certificates","correct":false},{"id":1677472,"option":"TLS encryption","correct":false}]},{"q":"<p>Which of the following statements regarding Azure SQL Database server is incorrect?</p>\n\n<p><strong>Options</strong></p>\n\n<p><strong>1.</strong></p>\n\n<p>Azure SQL Database Server is just a logical database server</p>\n\n<p><strong>2.</strong></p>\n\n<p>You can change common settings like logins, firewall rules, and auditing rules for all databases inside the Azure SQL database server</p>\n\n<p><strong>3.</strong></p>\n\n<p>Failover groups for all databases cannot be changed inside the server</p>\n\n<p><strong>4.</strong></p>\n\n<p>The Azure SQL database server is like a central administrative point for all databases inside it</p>","a":[{"id":1677465,"option":"1","correct":false},{"id":1677466,"option":"2","correct":false},{"id":1677467,"option":"3","correct":true},{"id":1677468,"option":"4","correct":false}]},{"q":"<p>You want to maintain control over the maintenance and patch timings of your database. Which of these Azure SQL database options can be used to meet your requirement?</p>","a":[{"id":1677461,"option":"Single database","correct":false},{"id":1677462,"option":"Elastic Pool","correct":false},{"id":1677463,"option":"Managed Instance","correct":false},{"id":1677464,"option":"SQL Server in VM","correct":true}]},{"q":"<p>Which of these can be encrypted using the Transaction Data Encryption (TDE) in Azure SQL Database?</p>","a":[{"id":1677437,"option":"Database and Transaction log files","correct":false},{"id":1677438,"option":"Associated Backup","correct":false},{"id":1677439,"option":"Both 1 and 2","correct":true},{"id":1677440,"option":"Neither 1 nor 2","correct":false}]},{"q":"<p>Which of the following service tiers would you use in Azure SQL Database for budget-oriented balanced compute and storage options?</p>","a":[{"id":1677405,"option":"Hyperscale Service Tier","correct":false},{"id":1677406,"option":"Business Critical/Premium Service Tier","correct":false},{"id":1677407,"option":"General Purpose/Standard Service Tier","correct":true},{"id":1677408,"option":"Hybrid Service Tier","correct":false}]},{"q":"<p>You are trying to save costs for resources with reserved capacity in Azure SQL Database. What should the size of the reservation be based on in the given scenario?</p>","a":[{"id":1678361,"option":"On the total amount of compute used by the existing database ","correct":true},{"id":1678362,"option":"On the purchase reservations","correct":false},{"id":1678363,"option":"On the existing databases in SQL Database","correct":false},{"id":1678364,"option":"None of these","correct":false}]},{"q":"<p>Which of the following service tiers are used by Azure SQL Database and SQL Managed Instances?</p>","a":[{"id":1678365,"option":"General Purpose","correct":false},{"id":1678366,"option":"Business Critical","correct":false},{"id":1678367,"option":"Both 1 and 2","correct":true},{"id":1678368,"option":"None of these","correct":false}]},{"q":"<p>You are performing table partitioning in Azure SQL database to make large tables more manageable and scalable. Which of these queries can you execute if you want to perform recurring partition maintenance in the given scenario?</p>","a":[{"id":1678325,"option":" ALTER PARTITION FUNCTION","correct":true},{"id":1678326,"option":"ALTER TABLE FUNCTION","correct":false},{"id":1678327,"option":"SWITCH PARTITION FUNCTION","correct":false},{"id":1678328,"option":"SWITCH OUT PARTITION","correct":false}]},{"q":"<p>A company wants to use the Azure SQL database service. Given that Business apps will be accessing the database and application data must be available in the event of a region-wide outage. Below are the key requirements that need to be met:<br>\n1. Data must be available in the secondary region if the primary region goes down.<br>\n2. The storage and compute layers for the SQL database must be integrated and replicated together.</p>\n\n<p>Which of the following would you use as the redundancy type in the given scenario?</p>","a":[{"id":1678237,"option":"SQL Sync","correct":false},{"id":1678238,"option":"Zone-Redundancy","correct":false},{"id":1678239,"option":"Geo-redundant storage","correct":true},{"id":1678240,"option":"Local-redundant storage","correct":false}]},{"q":"<p>Your company is using an on-premise Microsoft SQL Server and want to migrate the database to Azure SQL databases. Which of the following must be used as file type for exporting the on-premise database in the given scenario?</p>","a":[{"id":1678209,"option":"VHD","correct":false},{"id":1678210,"option":"DAC","correct":false},{"id":1678211,"option":"BACPAC","correct":true},{"id":1678212,"option":"VHDX","correct":false}]},{"q":"<p>Which of the following will be used by vCore-based purchasing model in Azure SQL Database to gain cost savings?</p>","a":[{"id":1678193,"option":"Azure Hybrid Benefit Model for SQL Server","correct":true},{"id":1678194,"option":"Serverless model","correct":false},{"id":1678195,"option":"DTU-based purchasing model","correct":false},{"id":1678196,"option":"T-SQL Model","correct":false}]},{"q":"<p>Which model would you use in Azure SQL database if you want to be able to choose the following characterstics?<br>\n1. Number of vCores<br>\n2. The amount of memory<br>\n3. The amount and speed of storage</p>","a":[{"id":1678189,"option":"DTU-based purchasing model","correct":false},{"id":1678190,"option":"serverless model","correct":false},{"id":1678191,"option":"vCore-based purchasing model","correct":true},{"id":1678192,"option":"Coreless purchasing model","correct":false}]},{"q":"<p>You want to use a Azure SQL database for an application that requires only a single data source. Which of the following databases should you use in the given scenario?</p>","a":[{"id":1677457,"option":"Single database","correct":true},{"id":1677458,"option":"Elastic Pool","correct":false},{"id":1677459,"option":"Managed Instance","correct":false},{"id":1677460,"option":"Database pool","correct":false}]},{"q":"<p>Which type of advanced monitoring and troubleshooting feature provided by Azure SQL Database enables you to find real-time performance insights?</p>\n\n<p><strong>Options</strong></p>\n\n<p><strong>1.</strong></p>\n\n<p>PaaS monitoring capabilities provided by SQL Server database engine</p>\n\n<p><strong>2.</strong></p>\n\n<p>PaaS monitoring capabilities provided by Azure</p>\n\n<p><strong>3.</strong></p>\n\n<p>Built-in monitoring capabilities provided by the SQL Server database engine</p>\n\n<p><strong>4.</strong></p>\n\n<p>Built-in monitoring capabilities provided by Azure</p>","a":[{"id":1677417,"option":"1","correct":false},{"id":1677418,"option":"2","correct":false},{"id":1677419,"option":"3","correct":true},{"id":1677420,"option":"4","correct":false}]},{"q":"What benefit would you get by using the DTU-based purchasing model in Azure SQL database?","a":[{"id":1678197,"option":"A large amount and speed of storage","correct":false},{"id":1678198,"option":"A bundled measure of compute, memory, and I/O resources in three service tiers","correct":true},{"id":1678199,"option":"A desired amount of memory","correct":false},{"id":1678200,"option":"A desired number of vCores","correct":false}]},{"q":"Which of these techniques would you use for an app with a single Azure SQL database to perform manual scaling without downtime?","a":[{"id":1678177,"option":"Autoscale","correct":false},{"id":1678178,"option":"Dynamic scalability","correct":true},{"id":1678179,"option":"Auto Failover","correct":false},{"id":1678180,"option":"Azure VMs","correct":false}]},{"q":"Which of the following Automatic Tuning options in Azure SQL Database are invalid?","a":[{"id":1677441,"option":"FORCE PLAN","correct":false},{"id":1677442,"option":"CREATE INDEX","correct":false},{"id":1677443,"option":"DROP INDEX","correct":false},{"id":1677444,"option":"ALTER INDEX","correct":true}]},{"q":"Where are the audit logs stored when auditing Azure SQL Database?","a":[{"id":1677433,"option":"Azure storage account","correct":false},{"id":1677434,"option":"Log Analytics workspace","correct":false},{"id":1677435,"option":"Event Hubs","correct":false},{"id":1677436,"option":"All 1, 2 and 3","correct":true}]},{"q":"What can be used to analyze resource consumption over time if you run Query Store in Azure SQL Database?","a":[{"id":1677425,"option":"Query Performance Insight","correct":true},{"id":1677426,"option":"Management Studio","correct":false},{"id":1677427,"option":"Data Studio","correct":false},{"id":1677428,"option":"Query Studio","correct":false}]},{"q":"Which of these data encryptions does Azure SQL Database use for any data at rest?","a":[{"id":1677429,"option":"Transparent data encryption","correct":true},{"id":1677430,"option":" Transport layer security","correct":false},{"id":1677431,"option":"Advanced Encryption Standard","correct":false},{"id":1677432,"option":"Triple DES","correct":false}]},{"q":"Which of these built-in Azure SQL Server monitoring features allows you to record the performance of your queries in real time?","a":[{"id":1677421,"option":"\nAzure AD","correct":false},{"id":1677422,"option":"\nAzure Synapse Analytics","correct":false},{"id":1677423,"option":"\nAzure SQL VMs (IaaS)","correct":false},{"id":1677424,"option":"Query Store","correct":true}]},{"q":"What is the benefit of using hyperscale service tier when working with Azure SQL Databases?","a":[{"id":1677413,"option":"Autoscale storage and scale compute fluidly","correct":true},{"id":1677414,"option":"Common workloads usability","correct":false},{"id":1677415,"option":"High transaction rate in applications","correct":false},{"id":1677416,"option":"Storage options","correct":false}]},{"q":"Which of these service tiers in Azure SQL Database is designed for OLTP applications with high transaction rate and lowest-latency I/O?","a":[{"id":1677409,"option":"Hybrid Service Tier","correct":false},{"id":1677410,"option":"General Purpose/Standard Service Tier","correct":false},{"id":1677411,"option":"Business Critical/Premium Service Tier","correct":true},{"id":1677412,"option":"Hyperscale Service Tier","correct":false}]},{"q":"<p>In MS SQL, you are configuring the security features for your SQL Database. If you are required to rotate the key of a server by using the Transparent Data Encryption (TDE) protector from Azure Key Vault, then which of the following PowerShell parameters will you use to switch the TDE Protector from Microsoft’s Managed mode to bring your own key mode:<br>\n    1. Type<br>\n    2. KeyID<br>\n    3. ResourceGroup<br>\n    4. ServerID</p>","a":[{"id":1150471,"option":"1, 2, and 3","correct":true},{"id":1150472,"option":"2, 3, and 4","correct":false},{"id":1150473,"option":"1, 3, and 4","correct":false},{"id":1150474,"option":"All of these","correct":false}]},{"q":"<p>In MS SQL, if you are creating an Azure resource group by using the Azure command-line interface (Azure CLI), then which of the following statements about the Azure CLI commands are correct:</p>\n\n<p><strong>Statements</strong><br>\n    1. The az subscription set command is used to set a subscription to a currently-active subscription.<br>\n    2. The az group create command is used to create a resource group.<br>\n    3. The az sql db create command is used to create a database for the resource group.</p>","a":[{"id":1150451,"option":"1 and 2","correct":false},{"id":1150452,"option":"2 and 3","correct":true},{"id":1150453,"option":"1 and 3","correct":false},{"id":1150454,"option":"All of these","correct":false}]},{"q":"<p>In MS SQL, you are working on the security of the SQL database. Which of the following statements about the auditing feature are correct:</p>\n\n<p><strong>Statements</strong><br>\n    1. This feature is used to track the database events and overwrite the events to an audit log.<br>\n    2. This feature is used to maintain regulatory compliance and provide the outcome that can be categorized as discrepancies and anomalies.</p>","a":[{"id":1189591,"option":"1","correct":false},{"id":1189592,"option":"2","correct":true},{"id":1189593,"option":"Both of these.","correct":false},{"id":1189594,"option":"None of these","correct":false}]},{"q":"<p>In MS SQL, you have created Red Hat Enterprise Linux virtual machines (VMs) in an availability set of your resource group. You are testing the connection between the created VMs. Which of the following Azure CLI commands in Azure Cloud Shell is used to connect a VM to another VM in this scenario?</p>","a":[{"id":1150507,"option":"test <username>@publicipaddress","correct":false},{"id":1150508,"option":"ssh <username>@publicipaddress","correct":true},{"id":1150509,"option":"config <username>@publicipaddress","correct":false},{"id":1150510,"option":"configIP <username>@publicipaddress","correct":false}]},{"q":"<p>You are working with Azure SQL Database. A single database resource creates a database in Azure SQL Database with its own set of resources. Which of the following statements about the dynamic scalability are correct:<br>\n<br>\n<strong>Statements:</strong></p>\n\n<ol>\n\t<li>It enables your database to transparently respond to rapidly-changing resource requirements.</li>\n\t<li>It enables you to only pay for the resources that are required.</li>\n\t<li>It enables you to pay for the resources that are required and are available for the database.</li>\n</ol>","a":[{"id":1189647,"option":"1 and 2","correct":false},{"id":1189648,"option":"2 and 3","correct":false},{"id":1189649,"option":"1 and 3","correct":false},{"id":1189650,"option":"All of these","correct":true}]},{"q":"<p>Your company plans to migrate its on-premises Microsoft SQL Server databases to Azure. You are considering using SQL Server 2016 on Azure virtual machines and Azure SQL Database.<br>\nThe planned migration must support the following data security features:</p>\n\n<ol>\n\t<li>Database-level firewall rules</li>\n\t<li>Dynamic Data Masking</li>\n\t<li>Transparent data encryption (TDE)</li>\n</ol>\n\n<p>Which of the following can support the database-level firewall rules?</p>","a":[{"id":738803,"option":"SQL Server 2016","correct":false},{"id":738804,"option":"Azure SQL database","correct":true},{"id":738805,"option":"Both of these","correct":false},{"id":738806,"option":"None of these","correct":false}]},{"q":"<p>In Azure, If your source database contains one or more temporal tables, your database migration fails during the “Full data load” operation and the following message will be displayed:</p>\n\n<pre class=\"prettyprint\"><code>{\n    \"resourceId\":\"/subscriptions//resourceGroups/migrateready/providers/Microsoft.DataMigration/services/\", \"errorType\":\"Database migration error\",\n    \"errorEvents\":\"[\"Capture functionalities could not be set. RetCode: SQL_ERROR SqlState: 42000 NativeError: 13570 Message: [Microsoft][SQL Server Native Client 11.0][SQL Server]The use of replication is not supported with system-versioned temporal table '[Application. Cities]' Line: 1 Column: -1 \"]\"\n}</code></pre>\n\n<p>    <br>\n    Which of the following SQL commands is used to find the temporal tables in your source schema?</p>","a":[{"id":1152721,"option":"select name,temporal_type,* from sys.migrationtables where temporal_type <>0","correct":false},{"id":1152722,"option":"select name,temporal_type,temporal_type_desc,*from sys.tables where temporal_type<>0","correct":true},{"id":1152723,"option":"select name,temporal_type,temporal_type_desc,*from sys.tables where tempotal_type<>1","correct":false},{"id":1152724,"option":"select name,temporal_type,* from sys.migrationtables where temporal_type<>1","correct":false}]},{"q":"<p>Which of the following SQL Server features are not supported by Azure SQL Database currently?</p>","a":[{"id":640587,"option":"Database mirroring","correct":false},{"id":640588,"option":"Extended stored procedures","correct":false},{"id":640589,"option":"Windows authentication","correct":false},{"id":640590,"option":"All of these","correct":true}]},{"q":"<p>In MS SQL, you are working on the security features for your SQL Database. You must delete the Transparent Data Encryption protector in Key Vault because a user does not have authorized access to the key. If you are required to return the Virtual Log Files and the TDE protector’s corresponding thumbprints that you are currently using, then which of the following SQL queries must be used to perform this task?</p>","a":[{"id":1189603,"option":"SELECT VLF FROM sys.dm_db_log_info(database_id)","correct":false},{"id":1189604,"option":"SELECT VLF FROM sys.dm_db_log_info(database_id) WHERE database_id = TDE.thumbprint(sys)","correct":false},{"id":1189605,"option":"SELECT VLF, TDE.thumbprint(sys) FROM sys.dm_db_log_info(database_id) WHERE database_id = TDE.thumbprint(sys)","correct":false},{"id":1189606,"option":"SELECT * FROM sys.dm_db_log_info(database_id)","correct":true}]},{"q":"<p>In MS SQL, you are working on the security features for your SQL Database. You must delete the Transparent Data Encryption protector in Key Vault because a user does not have authorized access to the key. If you are required to return the Virtual Log Files and the TDE protector’s corresponding thumbprints that you are currently using, then which of the following SQL queries must be used to perform this task?</p>","a":[{"id":1150475,"option":"SELECT VLF FROM sys.dm_db_log_info(database_id)","correct":false},{"id":1150476,"option":"SELECT VLF FROM sys.dm_db_log_info(database_id) WHERE database_id = TDE.thumbprint(sys)","correct":false},{"id":1150477,"option":"SELECT VLF, TDE.thumbprint(sys) FROM sys.dm_db_log_info(database_id) WHERE database_id = TDE.thumbprint(sys)","correct":false},{"id":1150478,"option":"SELECT * FROM sys.dm_db_log_info(database_id)","correct":true}]},{"q":"<p>In Azure, if the connection is failing because of the issue with the connection string while connecting Azure Database Migration Service (DMS) to the RDS MySQL Database, then the following error occurs.</p>\n\n<pre class=\"prettyprint\"><code>Error [9002][HY000] - connection failed.\nERROR [HY000] [MySQL][ODBC x.x(w) driver] The connection string may not be right.\nVisit the portal for references.</code></pre>\n\n<p> Which of the following statements is represented as a solution for this error?</p>","a":[{"id":1152717,"option":"Verify the connection string and refer to the troubleshooting documents listed in the note below the table, and then try again.","correct":true},{"id":1152718,"option":"Change the binlog_format in parameter group to 'ROW', and then reboot the instance.","correct":false},{"id":1152719,"option":"Verify that the source computer has the correct credentials and reset the connection string in the console.","correct":false},{"id":1152720,"option":"Check the arguments passed for the connection string and reset the connection string in the console.","correct":false}]},{"q":"<p>You are creating an Azure database for the MySQL server. You have entered a unique server name in the setting panel Server name. Which of the following statements about the server name is correct:</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>It is used to identify the Azure database for the MySQL server.</li>\n\t<li>It should contain only upper-case letters with a range of 3 to 63 characters.</li>\n\t<li>It should contain only lower-case letters with a range of 3 to 63 characters.</li>\n\t<li>It should contain both the upper-case and the lower-case letters with a range of 6 to 126 characters.</li>\n</ol>","a":[{"id":1152733,"option":"1 and 2","correct":false},{"id":1152734,"option":"1 and 3","correct":true},{"id":1152735,"option":"3 and 4","correct":false},{"id":1152736,"option":"2 and 4","correct":false}]},{"q":"<p>In MS SQL, you are working on the security features of the SQL Database. Which of the following encryption techniques is used to encrypt your data at rest and does not require the changes to the applications that are accessing the encrypted database?</p>","a":[{"id":1150467,"option":"Advanced Encryption Standard","correct":false},{"id":1150468,"option":"Data Encryption Standard ","correct":false},{"id":1150469,"option":"Transparent Data Encryption","correct":true},{"id":1150470,"option":"SHA-512","correct":false}]},{"q":"<p>In MS SQL, you are creating an Azure resource group by using the Azure command-line interface (Azure CLI). Which of the following Azure CLI commands will you use to create a server-level firewall rule?</p>","a":[{"id":1189575,"option":"az server firewall-rule create","correct":false},{"id":1189576,"option":"az server create","correct":false},{"id":1189577,"option":"az server rule create","correct":false},{"id":1189578,"option":"az sql server firewall-rule create","correct":true}]},{"q":"<p>In MS SQL, if you are creating an Azure resource group by using the Azure command-line interface (Azure CLI), then which of the following statements about the Azure CLI commands are correct:</p>\n\n<p><strong>Statements</strong><br>\n    1. The az subscription set command is used to set a subscription to a currently active subscription.<br>\n    2. The az group create command is used to create a resource group.<br>\n    3. The az SQL DB create command is used to create a database for the resource group.</p>","a":[{"id":1189579,"option":"1 and 2","correct":false},{"id":1189580,"option":"2 and 3","correct":true},{"id":1189581,"option":"1 and 3","correct":false},{"id":1189582,"option":"All of these","correct":false}]},{"q":"<p>In MS SQL, you are working with SQL Database. A single database resource creates a database in Azure SQL Database with its own set of resources. Which of the following statements about dynamic scalability are correct:</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>It enables your database to transparently respond to rapidly-changing resource requirements.</li>\n\t<li>It enables you to only pay for the resources that are required.</li>\n\t<li>It enables you to pay for the resources that are required and are available for the database.</li>\n</ol>","a":[{"id":1150519,"option":"1 and 2","correct":true},{"id":1150520,"option":"2 and 3","correct":false},{"id":1150521,"option":"1 and 3","correct":false},{"id":1150522,"option":"All of these","correct":false}]},{"q":"<p>In MS SQL, you are working on the security features for your SQL Database. You have created a new key in Key Vault. If you are required to delete this key from Key Vault, then which of the following PowerShell parameters are required to restore this key to Key Vault by using the Restore-AzKeyVaultKey cmdlet command:<br>\n    1. VaultName<br>\n    2. InputFile<br>\n    3. KeyID</p>","a":[{"id":1150479,"option":"1 and 2","correct":false},{"id":1150480,"option":"2 and 3","correct":false},{"id":1150481,"option":"All of these","correct":false},{"id":1150482,"option":"Invalid cmdlet command","correct":true}]},{"q":"<p>In MS SQL, you are creating an Azure resource group by using the Azure command-line interface (Azure CLI). Which of the following Azure CLI commands will you use to create a server-level firewall rule?</p>","a":[{"id":1150447,"option":"az server firewall-rule create","correct":false},{"id":1150448,"option":"az server create","correct":false},{"id":1150449,"option":"az server rule create","correct":false},{"id":1150450,"option":"az sql server firewall-rule create","correct":true}]},{"q":"<p>In MS SQL, you are working with SQL Database. If you are required to enable security features to this database, then which of the following statements about the advanced data security features are correct:</p>\n\n<p><strong>Statements</strong><br>\n    1. Users can explore the synchronous activities that are implemented by the external resource group with this feature.<br>\n    2. Users perform this feature to determine whether the event was to access, breach, or exploit data in the database.<br>\n    3. Users are provided with a security overview that includes a vulnerability assessment.</p>","a":[{"id":1189587,"option":"1 and 2","correct":false},{"id":1189588,"option":"2 and 3","correct":true},{"id":1189589,"option":"1 and 3","correct":false},{"id":1189590,"option":"All of these","correct":false}]},{"q":"<p>In MS SQL, you are migrating SQL Server to Azure SQL Database Offline by using Data Migration Service. If you are running multiple named SQL Server instances by using dynamic ports, then which of the following ports must be granted access to the key through the firewall in this scenario?</p>","a":[{"id":1150483,"option":"TCP port 1434","correct":false},{"id":1150484,"option":"UDP port 1434","correct":true},{"id":1150485,"option":"TCP port 1432","correct":false},{"id":1150486,"option":"UDP port 1433","correct":false}]},{"q":"<p>In MS SQL, you are migrating SQL Server to Azure SQL Database Offline by using Data Migration Service. If you are assessing the source SQL Server’s database that is migrating to a pooled database in Azure SQL Database, then which of the following assessment report types is selected by default in this scenario:<br>\n    1. Check database compatibility<br>\n    2. Check feature parity</p>","a":[{"id":1150491,"option":"1","correct":false},{"id":1150492,"option":"2","correct":false},{"id":1150493,"option":"Both of these","correct":true},{"id":1150494,"option":"None of these","correct":false}]},{"q":"<p>In MS SQL, you are configuring the availability groups for SQL Server on Red Hat Enterprise Linux virtual machines in Azure. If you are required to use the East US 2 location and the name of the resource group as hackmyresource, then which of the following Azure CLI commands is used to create a resource group?</p>","a":[{"id":1150499,"option":"az group create --hackmyresource <resourceGroupName> --location eastus2","correct":true},{"id":1150500,"option":"az group create --hackmyresource -m <resourceGroupName> --location eastus2","correct":false},{"id":1150501,"option":"az group create --hackmyresource -a <resourceGroupName> --location eastus2","correct":false},{"id":1150502,"option":"az group create --hackmyresource -z <resourceGroupName> --location eastus2","correct":false}]},{"q":"<p>In MS SQL, you are migrating SQL Server to Azure SQL Database Offline by using Data Migration Service. If you have disabled your Windows firewall to allow Azure Database Migration Service to access the source SQL server, then determine the default TCP port number in this scenario?</p>","a":[{"id":1150487,"option":"1431","correct":false},{"id":1150488,"option":"1432","correct":false},{"id":1150489,"option":"1433","correct":true},{"id":1150490,"option":"1434","correct":false}]},{"q":"<p>In MS SQL, you are configuring the security features for your SQL Database. If you are required to rotate the key of a server by using the Transparent Data Encryption (TDE) protector from Azure Key Vault, then which of the following PowerShell parameters will you use to switch the TDE Protector from Microsoft’s Managed mode to the bring your own key mode:<br>\n    1. Type<br>\n    2. KeyID<br>\n    3. ResourceGroup<br>\n    4. ServerID</p>","a":[{"id":1189599,"option":"1, 2, and 3","correct":true},{"id":1189600,"option":"2, 3, and 4","correct":false},{"id":1189601,"option":"1, 3, and 4","correct":false},{"id":1189602,"option":"All of these","correct":false}]},{"q":"<p>In MS SQL, you are configuring the replication between two managed instances. If you are required to create a publisher database in your Azure storage account, then which of the following must be connected to the Transact-SQL extension to perform this task?</p>","a":[{"id":1150495,"option":"Managed instance","correct":true},{"id":1150496,"option":"SQL Session ID","correct":false},{"id":1150497,"option":"Azure storage session ID","correct":false},{"id":1150498,"option":"None of these","correct":false}]},{"q":"<p>In MS SQL, you have created a blank database in Azure SQL Database by using SQL Server Management Studio. If the database is created within the Azure resource group, then which of the following servers will you use to maintain this database?</p>","a":[{"id":1189571,"option":"Azure SQL server","correct":false},{"id":1189572,"option":"Microsoft Synapse server","correct":false},{"id":1189573,"option":"Azure Database Management tool","correct":false},{"id":1189574,"option":"Local SQL server","correct":true}]},{"q":"<p>In MS SQL, you have created a blank database in Azure SQL Database by using SQL Server Management Studio. If the database is created within the Azure resource group, then which of the following servers will you use to maintain this database?</p>","a":[{"id":1150443,"option":"Azure SQL server","correct":false},{"id":1150444,"option":"Microsoft Synapse server","correct":false},{"id":1150445,"option":"Azure Database Management tool","correct":false},{"id":1150446,"option":"Local SQL server","correct":true}]},{"q":"<p>In MS SQL, you are working on the security features of the SQL Database. Which of the following encryption techniques is used to encrypt your data at rest and does not require the changes to the applications that are accessing the encrypted database?</p>","a":[{"id":1189595,"option":"Advanced Encryption Standard","correct":false},{"id":1189596,"option":"Data Encryption Standard ","correct":false},{"id":1189597,"option":"Temporary Data Encryption","correct":true},{"id":1189598,"option":"SHA-512","correct":false}]}]