[{"q":"<p>You are working on the <strong>SAP Web Intelligence tool</strong> from the SAP <strong>BusinessObjects</strong> product suite. Which of the following statements about charts are correct:</p>\n\n<ol>\n\t<li>A bar chart is used to compare similar groups of data and display them in a rectangular form (pattern) horizontally.</li>\n\t<li>A map chart displays values that are within the nested triangles where these nested triangles represent the levels of hierarchy breakdown of specific data.</li>\n\t<li>A pie chart is created by sectors where all the sectors form the area of a circle. This chart is of three types, a pie chart, a pie chart with variable slice depth, and a donut chart.</li>\n\t<li>A radar chart displays several axes starting from the unique origin by using a common scale of measurement.</li>\n</ol>","a":[{"id":1361457,"option":"1, 2, and 3","correct":false},{"id":1361458,"option":"2, 3, and 4","correct":false},{"id":1361459,"option":"1, 2, and 4","correct":false},{"id":1361460,"option":"1, 3, and 4","correct":true}]},{"q":"<p>In SAP BusinessObjects (BOBJ), which of the following statements about creating queries in the Business Explorer component are correct:</p>\n\n<ol>\n\t<li>The queries are created using the SAP BEx query designer based on SAP InfoCubes in SAP Business Warehouse (SAP BW).</li>\n\t<li>These queries retrieve the metadata from the data source. You use Web Intelligence to connect to a BEx query by using a BI Consumer Service (BICS) connection and retrieve data through the BEx query for reporting purposes.</li>\n\t<li>These queries are used to create queries by using both text and XML files.</li>\n</ol>","a":[{"id":1361445,"option":"1 and 2","correct":true},{"id":1361446,"option":"2 and 3","correct":false},{"id":1361447,"option":"1 and 3","correct":false},{"id":1361448,"option":"All of these","correct":false}]},{"q":"<p> In SAP BusinessObjects (BOBJ), if you are required to create a query on a text file, then which of the following attributes is used to include data that are related to each result object?</p>","a":[{"id":1361441,"option":"Data separator\r\n","correct":false},{"id":1361442,"option":"Data delimiter","correct":true},{"id":1361443,"option":"Charset","correct":false},{"id":1361444,"option":"None of these","correct":false}]}]