[{"q":"<p>In Google Cloud Platform, you are working with the content delivery network (CDN) service. Which of the following statements about route matching and origin selection are correct:</p>\n\n<ol>\n\t<li>Requests for a website can be routed to a group of Compute Engine backend services while the media resource of the website can be mapped to a cloud storage bucket.</li>\n\t<li>Once the Compute Engine provides the required access, the incoming HTTP requests have to be redirected to the HTTPS extension.</li>\n\t<li>The matching operation can be performed on host, path, query parameter, and header prior to backend (origin) selection.</li>\n</ol>\n\n<p> </p>","a":[{"id":1341007,"option":"1 and 2","correct":true},{"id":1341008,"option":"2 and 3","correct":false},{"id":1341009,"option":"1 and 3","correct":false},{"id":1341010,"option":"All of these","correct":false}]},{"q":"<p>In Google Cloud Platform, you are setting the different cache modes from the content delivery network (CDN). Which of the following cache mode requires origin responses to set valid cache directives and valid caching headers?</p>","a":[{"id":1341053,"option":"USE_ORIGIN_CACHE","correct":false},{"id":1341054,"option":"USE_ORIGIN_HEADERS","correct":true},{"id":1341055,"option":"USE_ORIGIN_CACHE_HEADERS","correct":false},{"id":1341056,"option":"None of these","correct":false}]},{"q":"<p>In Google Cloud Platform, which of the following statements about the signed URL from the content delivery network (CDN) data tool are correct:</p>\n\n<ol>\n\t<li>They are URLs that provide limited permission and time to make a request.</li>\n\t<li>They contain the authentication information in their query strings and they allow users without credentials to perform specific actions on a resource. </li>\n\t<li>Not all the users that have the generated signed URL can utilize this signed URL to perform specific actions in a specific period of time.</li>\n</ol>\n\n<p> </p>","a":[{"id":1341057,"option":"1 and 2","correct":true},{"id":1341058,"option":"2 and 3","correct":false},{"id":1341059,"option":"1 and 3","correct":false},{"id":1341060,"option":"All of these","correct":false}]}]