[{"q":"<p>There are 5 persons Alice, Bob, Mike, Tara, and Lisa who are sitting on a bench. Alice and Bob are next to each other, and Mike and Tara are next to each other. Lisa is sitting on the left end of the bench and she is not sitting with Bob. Mike is sitting in the second position from the right. In which position Alice is sitting?</p>","a":[{"id":1759239,"option":"Between Bob and Tara","correct":false},{"id":1759240,"option":"Between Mike and Lisa","correct":false},{"id":1759241,"option":"Between Lisa and Tara","correct":false},{"id":1759242,"option":"Between Bob and Lisa","correct":true}]},{"q":"<p>There are 7&nbsp;people Ben, Tara, Alice, Mike, Paul, John, and Lisa in a theatre watching a movie facing North. Alice is sitting adjacent to both Mike and Paul. Tara is sitting at one end of the row. John is to the immediate right of Paul and the fourth person to the right of Ben. Alice has only two people sitting right to her.&nbsp;What is the position of Lisa with respect to Alice?</p>","a":[{"id":1759120,"option":"Alice is 1 position left of Alice","correct":false},{"id":1759121,"option":"Lisa is 4 positions right of Alice","correct":false},{"id":1759122,"option":"Alice is 2 positions left of Alice","correct":false},{"id":1759123,"option":"Lisa is 3 positions left of Alice","correct":true}]},{"q":"<p>A, B, C, D, E, and F are sitting in a row. A and F are sitting in the center. C and E are at the ends. D is sitting to the left E, then who is to the right of C?</p>","a":[{"id":1759400,"option":"A","correct":false},{"id":1759401,"option":"B","correct":true},{"id":1759402,"option":"D","correct":false},{"id":1759403,"option":"F","correct":false}]},{"q":"<p>A,B,C,D,E,F,G, and H are sitting in a round circle. A is sitting at a position second to the right of E who is the neighbor C and G. There are 2 people in between A and G and 3 people in between A and F. If A and D are not neighbors and H is between B and D then which of the following are not neighbors?</p>","a":[{"id":1759404,"option":"A and B","correct":false},{"id":1759405,"option":"G and E","correct":false},{"id":1759406,"option":"D and F","correct":false},{"id":1759407,"option":"H and F","correct":true}]},{"q":"<p>A,B,C,D,E,F,G, and H are sitting in a round circle. A is sitting at a position second to the right of E who is the neighbor C and G. There are 2 people in between A and G and 3 people in between A and F. If A and D are not neighbors and H is between B and D. Who are adjacent to A?</p>","a":[{"id":1759408,"option":"E and B","correct":false},{"id":1759409,"option":"C and F","correct":false},{"id":1759410,"option":"E and F","correct":false},{"id":1759411,"option":"B and C","correct":true}]},{"q":"<p>A,B,C,D,E,F,G, and H are sitting in a round circle. A is sitting at a position second to the right of E who is the neighbor C and G. There are 2 people in between A and G and 3 people in between A and F. If A and D are not neighbors and H is between B and D then who is to the right of F?</p>","a":[{"id":1759412,"option":"A","correct":false},{"id":1759413,"option":"G","correct":true},{"id":1759414,"option":"D","correct":false},{"id":1759415,"option":"C","correct":false}]},{"q":"<p>A,B,C,D,E,F,G, and H are sitting in a round circle. A is sitting at a position second to the right of E who is the neighbor C and G. There are 2 people in between A and G and 3 people in between A and F. If A and D are not neighbors and H is between B and D then who is to the left of B?</p>","a":[{"id":1759416,"option":"F","correct":false},{"id":1759417,"option":"C","correct":false},{"id":1759418,"option":"A","correct":true},{"id":1759419,"option":"H","correct":false}]},{"q":"<p>There are 7&nbsp;people Ben, Tara, Alice, Mike, Paul, John, and Lisa in a theatre watching a movie facing North. Alice is sitting adjacent to both Mike and Paul. Tara is sitting at one end of the row. John is to the immediate right of Paul and the fourth person to the right of Ben. Alice has only two people sitting right to her. Then who is sitting at the end of the row?</p>\n\n<p>&nbsp;</p>","a":[{"id":1759116,"option":"Tara","correct":false},{"id":1759117,"option":"Paul","correct":false},{"id":1759118,"option":"John","correct":true},{"id":1759119,"option":"Lisa","correct":false}]},{"q":"<p>There are 7 members in a family&nbsp;Alice, Mike, Ben, Lisa, Paul, Mary, and Bob, seated at a round table. Lisa and Paul are neighbors and Lisa sitting second to the right Alice. mary and Ben are not neighbors, which of the following can not be neighbors?</p>","a":[{"id":1758743,"option":"Alice and Mary","correct":false},{"id":1758744,"option":"Paul and Alice","correct":false},{"id":1758745,"option":"Lisa and Ben","correct":false},{"id":1758746,"option":"Mike and Mary","correct":true}]},{"q":"<p>There are 7 members in a family&nbsp;Alice, Mike, Ben, Lisa, Paul, Mary, and Bob, seated at a round table. Mike is third to the left of Alice who is sitting second to the left of Lisa. Ben is sitting in between Lisa and Mike. Alice and Bob are not neighbors and Alice is sitting between Mary and Paul. Then which of the following are not neighbors?</p>","a":[{"id":1758739,"option":"Mike and Bob","correct":false},{"id":1758740,"option":"Lisa and Ben","correct":false},{"id":1758741,"option":"Alice and Bob","correct":true},{"id":1758742,"option":"Mary and Bob","correct":false}]},{"q":"<p>There are 5 students Tara, Ben, Paul, Mike, and Alice sitting in a row. Mike is sitting next to Alice, who is sitting next to Paul. Ben is not sitting next to Paul. Also, Mike is sitting on the right end of the row. Who is sitting in between Tara and Alice?</p>","a":[{"id":1758735,"option":"Mike","correct":false},{"id":1758736,"option":"Ben","correct":false},{"id":1758737,"option":"Paul","correct":true},{"id":1758738,"option":"None of these","correct":false}]},{"q":"<p>There are 7 students in a classroom&nbsp;Alice, Mike, Ben, Lisa, Paul, Mary, and Bob seated in one row. Mike is between Alice and Lisa but not adjacent to both of them and Alice is on the left side of Mike. Mary is on the left of Alice and Paul on the right of Ben. Lisa is between Ben and Paul and Ben is on the left side of Lisa. Who is at the fifth and sixth position from the right end of the row?</p>","a":[{"id":1758731,"option":"Ben and Mike","correct":false},{"id":1758732,"option":"Mike and Bob","correct":false},{"id":1758733,"option":"Bob and Alice","correct":true},{"id":1758734,"option":"Alice and Mary","correct":false}]},{"q":"<p>There are 5 students Tara, Ben, Paul, Mike, and Alice sitting in a row. Mike is sitting next to Alice, who is sitting next to Paul. Ben is not sitting next to Paul. Also, Mike is sitting on the right end of the row. Who is sitting next to Tara on the left side?</p>","a":[{"id":1758727,"option":"Paul","correct":false},{"id":1758728,"option":"Ben","correct":true},{"id":1758729,"option":"Alice","correct":false},{"id":1758730,"option":"Mike","correct":false}]},{"q":"<p>There are 7 students in a classroom&nbsp;Alice, Mike, Ben, Lisa, Paul, Mary, and Bob seated in one row. Mike is between Alice and Lisa but not adjacent to both of them and Alice is on the left side of Mike. Mary is on the left of Alice and Paul on the right of Ben. Lisa is between Ben and Paul and Ben is on the left side of Lisa, then who is to the immediate left of Mike?</p>\n\n<p>&nbsp;</p>","a":[{"id":1758597,"option":"Bob","correct":true},{"id":1758598,"option":"Paul","correct":false},{"id":1758599,"option":"Ben","correct":false},{"id":1758600,"option":"Alice","correct":false}]},{"q":"5 friends A, B,C, D, E are standing in a queue. D is in the middle of queue while C is the last.E is not adjacent to B and is 2nd in the queue from front. Who is in the middle of D and C ?","a":[{"id":1859697,"option":"Either A or E","correct":false},{"id":1859698,"option":"A","correct":false},{"id":1859699,"option":"B","correct":true},{"id":1859700,"option":"Data insufficient","correct":false}]}]