[{"q":"<p>To increase the responsiveness of your application, you are using Redis&nbsp;as a cache. Redis connection commands are basically used to manage client connections with Redis server. Client connections tend to consume memory leading to data eviction or out-of-memory errors.&nbsp;Redis allows us a&nbsp;robust configuration to limit the aggregate memory used by all clients&nbsp;connections. This mechanism is called&nbsp;<em>client eviction</em><strong>.&nbsp;</strong>Which of the following connections&nbsp;aren't affected by the client eviction mechanism and are never evicted?</p>","a":[{"id":1723253,"option":"Replica and Client","correct":false},{"id":1723254,"option":"Client and Server","correct":false},{"id":1723255,"option":"Replica and Master","correct":true},{"id":1723256,"option":"Master and Slave","correct":false}]},{"q":"<p>To increase the responsiveness of your application, you are using Redis&nbsp;as a cache. Redis connection commands are basically used to manage client connections with Redis server. Client connections tend to consume memory leading to data eviction or out-of-memory errors.&nbsp;Redis allows us a&nbsp;robust configuration to limit the aggregate memory used by all client's&nbsp;connections. This mechanism is called&nbsp;<em>client eviction.</em><strong>&nbsp;</strong>Which of the following statements are true for client eviction?</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>It's&nbsp;a safety mechanism that will disconnect clients once the aggregate memory usage of all clients is above a threshold.</li>\n\t<li>The mechanism first attempts to disconnect clients that use the least&nbsp;memory.</li>\n\t<li>It disconnects the minimal&nbsp;number of clients needed to return below the&nbsp;<code>maxmemory-clients</code>&nbsp;threshold.</li>\n\t<li>Replica and master connections aren't affected by the client eviction mechanism.</li>\n\t<li>Replica and master&nbsp;connections are&nbsp;evicted first.</li>\n</ol>","a":[{"id":1723245,"option":"2,3 and 4","correct":false},{"id":1723246,"option":"1,2 and 4","correct":false},{"id":1723247,"option":"1, 3 and 5","correct":true},{"id":1723248,"option":"3, 4, and 5","correct":false}]},{"q":"<p>To increase the responsiveness of your application, you are using Redis&nbsp;as a cache to store frequently accessed data in memory. Redis connection commands are basically used to manage client connections with Redis server. Different kind of clients have different default limit. What is the default hard limit and soft limit for Pub/Sub clients?</p>","a":[{"id":1722696,"option":"Hard limit of 256 megabytes and Soft limit of 8 megabytes per 60 seconds","correct":false},{"id":1722697,"option":"Hard limit of 32 megabytes and Soft limit of 64 megabytes per 60 seconds","correct":false},{"id":1722698,"option":"Hard limit of 32 megabytes and Soft limit of 8 megabytes per 60 seconds","correct":true},{"id":1722699,"option":"Hard limit of 256 megabytes and Soft limit of 64 megabytes per 60 seconds","correct":false}]},{"q":"<p>To increase the responsiveness of your application, you are using Redis&nbsp;as a cache to store frequently accessed data in memory. Redis connection commands are basically used to manage client connections with the Redis server.&nbsp;When a new client connection is accepted which of the following operations are performed?</p>\n\n<p><strong>Operations</strong></p>\n\n<ol>\n\t<li>The client socket is put in a blocking state since Redis uses multiplexing and non-blocking I/O.</li>\n\t<li>The&nbsp;<code>TCP_NODELAY</code>&nbsp;option is set in order to ensure that we don't have delays in our connection.</li>\n\t<li>A&nbsp;<em>readable</em>&nbsp;file event is created so that Redis is able to collect the client queries as soon as new data is available to be read on the socket.</li>\n\t<li>After the client is initialized, Redis checks if we are already at the limit of the number of clients that it is possible to handle simultaneously</li>\n</ol>","a":[{"id":1722684,"option":"1, 2, 3","correct":false},{"id":1722685,"option":"1, 2, 4","correct":false},{"id":1722686,"option":"2, 3, 4","correct":true},{"id":1722687,"option":"1, 2, 3, 4","correct":false}]},{"q":"<p>To increase the responsiveness of your application, you are using Redis&nbsp;as a cache to store frequently accessed data in memory. Redis connection commands are basically used to manage client connections with Redis server. How client connections are accepted?</p>","a":[{"id":1722680,"option":"On the Unix socket","correct":false},{"id":1722681,"option":"On the configured listening IP port","correct":false},{"id":1722682,"option":"On the Unix socket if enabled","correct":false},{"id":1722683,"option":"On the configured listening TCP port and on the Unix socket if enabled","correct":true}]}]