[{"q":"<p>Alice's home from wonderland is 10 km in south direction. Now Bunny met her outside wonderland and dishonestly took her 7.5 km in west direction then turned right and traveled 2kms towards dangerous land. Alice is lost and on finding her way back home she traveled 7.5kms in east and turned right and traveled 5.5kms. How far is she from her house?</p>","a":[{"id":1758311,"option":"6.7 kms","correct":false},{"id":1758312,"option":"5 kms","correct":false},{"id":1758313,"option":"4.5 kms","correct":false},{"id":1758314,"option":"2.5 kms","correct":true}]},{"q":"<p>The size of a rectangular playground is 8*6 units. A child runs&nbsp;along all four sides of the ground and finally along a diagonal order to catch a ball. How much total distance is covered by the child?</p>","a":[{"id":1758303,"option":"36","correct":false},{"id":1758304,"option":"64","correct":false},{"id":1758305,"option":"38","correct":true},{"id":1758306,"option":"48","correct":false}]},{"q":"<p>Mike started walking 50km towards north and then turned left. After walking 160km in that direction he turns right and walked 10km. And then he turned back right and moved 80km straight. How far is he from starting point and in which direction?</p>","a":[{"id":1758295,"option":"10 km towards North","correct":false},{"id":1758296,"option":"100 km towards North-West","correct":true},{"id":1758297,"option":"80 km towards South-East","correct":false},{"id":1758298,"option":"110 km towards South","correct":false}]},{"q":"<p>Alice, Mike, Bob, and Ben decided to play a game of Ludo, but Alice, Ben, and Mike, Bob teamed up as partners. Ben is to the left of Mike who is facing east. Then in which direction is Alice facing?</p>\n\n<p>&nbsp;</p>","a":[{"id":1758291,"option":"North","correct":false},{"id":1758292,"option":"East","correct":false},{"id":1758293,"option":"West","correct":false},{"id":1758294,"option":"South","correct":true}]},{"q":"<p>A board showing directions at a crossing in four-way road got rotated due to heavy storm and wind. Now it is directing in the wrong direction. East is pointer is pointing North. Bob went wanted to go west but walked in the wrong direction due to the rotated board. In which direction was he actually walking?</p>","a":[{"id":1758287,"option":"North","correct":false},{"id":1758288,"option":"East","correct":false},{"id":1758289,"option":"West","correct":false},{"id":1758290,"option":"South","correct":true}]},{"q":"<p>One fine evening, Alice and Bob decided to play in a park and were standing leaning on each other with their back towards each other. If Alice's shadow fell towards her left-hand side, then in which direction was bob facing?</p>\n\n<p>&nbsp;</p>","a":[{"id":1758283,"option":"East","correct":false},{"id":1758284,"option":"West","correct":false},{"id":1758285,"option":"North","correct":true},{"id":1758286,"option":"South","correct":false}]},{"q":"<p>You started walking 3km towards east and then turned right. After walking a distance of 4km in the same direction. Then you moved 5km in northwest direction and finally stop. In which direction are you from the starting point?</p>","a":[{"id":1758267,"option":"North","correct":false},{"id":1758268,"option":"North-west","correct":false},{"id":1758269,"option":"West","correct":false},{"id":1758270,"option":"No Change","correct":true}]},{"q":"<p>Your direction showing compass has lost its magnetism and is now showing wrong directions. If it is showing north-east instead of south and south-east instead of east and so on. Then what will be the direction of west in the wrong compass?</p>","a":[{"id":1757978,"option":"North-east","correct":false},{"id":1757979,"option":"East","correct":false},{"id":1757980,"option":"North-west","correct":true},{"id":1757981,"option":"South","correct":false}]},{"q":"<p>Block A is to the northeast of block B, block C is to the west of block A and northeast of block B and block D is to the south of block C which is in line with block A and block B. In which direction of block B is block D located?</p>","a":[{"id":1757703,"option":"North","correct":false},{"id":1757704,"option":"North-east","correct":true},{"id":1757705,"option":"South-east","correct":false},{"id":1757706,"option":"South-west","correct":false}]},{"q":"<p>Students are sitting in three rows all facing towards projector (north). If Q is in the middle row and W is just right of Q but in the same row. E is behind Q while R is in front of W. In which direction of R is E?</p>","a":[{"id":1757699,"option":"East","correct":false},{"id":1757700,"option":"North-West","correct":false},{"id":1757701,"option":"South-East","correct":false},{"id":1757702,"option":"South-West","correct":true}]},{"q":"<p>Once in a pleasant morning, a girl started her morning walk towards the sun. Then after covering some distance she decided to turn left and then&nbsp;again after covering some distance she turned left. In which direction is she now moving?</p>","a":[{"id":1757695,"option":"West","correct":true},{"id":1757696,"option":"North-west","correct":false},{"id":1757697,"option":"East","correct":false},{"id":1757698,"option":"South-west","correct":false}]},{"q":"<p>Mike walks 4 km towards south. Then he turns towards west and walks 10 km. After this he turns towards north and walks 1 km. Again he turns towards east and walks 6 km. How far is he from the starting point?&nbsp;</p>","a":[{"id":1757691,"option":"10km","correct":false},{"id":1757692,"option":"13km","correct":false},{"id":1757693,"option":"5km","correct":true},{"id":1757694,"option":"15km","correct":false}]},{"q":"<p>Alice, Ben, and Bob are standing at a certain distance from each other. Alice is 160 meters southwest of Ben. If Bob is 160 meters southeast of Ben, then Alice is in which direction of Bob?&nbsp;</p>","a":[{"id":1757575,"option":"West","correct":true},{"id":1757576,"option":"East","correct":false},{"id":1757577,"option":"South","correct":false},{"id":1757578,"option":"North-east","correct":false}]},{"q":"<p>If Alice is standing west of Ben who is in the south of Bob. If Mike is in the north of Bob, then what is the direction of Alice with respect to Mike?</p>","a":[{"id":1757563,"option":"North","correct":false},{"id":1757564,"option":"South","correct":false},{"id":1757565,"option":"South-west","correct":true},{"id":1757566,"option":"North-east","correct":false}]},{"q":"<p>John walks 10 KMS towards east and stops. Then he continues towards south for 5 KMS and takes another 5 KMS west. Now, John takes another 5 KMS towards north and stops. Then to which direction is the starting point in perspective with John's current position?</p>\n\n<p>&nbsp;</p>","a":[{"id":1767966,"option":"West","correct":true},{"id":1767967,"option":"North-West","correct":false},{"id":1767968,"option":"South","correct":false},{"id":1767969,"option":"East","correct":false}]},{"q":"<p>Mark's Office is 25KMS from his home. If he travels 5 KMS towards west and then travels 10KMS South. Then he takes 10 KMS to the east and stops at the junction. From the junction, if he takes 3 KMS south and 2 KMS east, he arrives at his office. Then which direction is Mark's home with respect to his office?&nbsp;</p>","a":[{"id":1767970,"option":"North-West","correct":true},{"id":1767971,"option":"North","correct":false},{"id":1767972,"option":"West","correct":false},{"id":1767973,"option":"East","correct":false}]},{"q":"<p>Lisa traveled 30KMS. She started from home and traveled 5KMS in the east direction. Then she traveled 8 KMS south to visit Ben. From there she traveled again in east for 4KMS and went in the south direction for 1KMS for a bookstore. Then she took the next turn and traveled east for 3KMS and traveled again north for 9 KMS to reach her office. Then in which direction is her home from her office's perspective?</p>","a":[{"id":1769644,"option":"West","correct":true},{"id":1769645,"option":"East","correct":false},{"id":1769646,"option":"North- East","correct":false},{"id":1769647,"option":"South- East","correct":false}]},{"q":"<p>Bob on his way to school takes the first street and travels 9KMS east, then travels south for another 5KMS and takes the last exit and travels again 5KMS north. Then in which direction is Bob's school from his house's perspective?</p>","a":[{"id":1769648,"option":"East","correct":true},{"id":1769649,"option":"West","correct":false},{"id":1769650,"option":"North-East","correct":false},{"id":1769651,"option":"North-West","correct":false}]},{"q":"<p>John on his way to the office has to drop a parcel off at the post office. So first he went towards the post office by traveling 5KMS south and 4 KMS east to reach the post office. Then he traveled 5KMS north and took 7KMS east. Then to reach the entrance he took the next exit in south 1KMS and traveled 2KMS east and finally traveled 1KMS north to reach his destination. Then from the post office, his destination is in which direction?</p>","a":[{"id":1769652,"option":"North-East","correct":true},{"id":1769653,"option":"East","correct":false},{"id":1769654,"option":"South-East","correct":false},{"id":1769655,"option":"South-West","correct":false}]},{"q":"A stands opposite to a friend during the day. If the shadow of the friend falls to the left of A, then which direction is A facing?","a":[{"id":1859537,"option":"East","correct":false},{"id":1859538,"option":"South","correct":false},{"id":1859539,"option":"North","correct":true},{"id":1859540,"option":"West","correct":false}]}]