[{"q":"<p style=\"text-align: justify;\">You are building a web application using the Spring framework. You are required to implement Spring Cloud GCP to utilize Google Cloud Platform from your Spring application. Spring Cloud GCP provides various starter dependencies through Maven to depend on different modules of the library where each starter contains all the dependencies and transitive dependencies needed to begin using their corresponding Spring Cloud GCP module. Now, which of the following statements about these starters in this scenario are correct:</p>\n\n<p style=\"text-align: justify;\"> </p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>The <strong>Security - IAP</strong> starter extracts IAP (Identity-Aware Proxy) identity information from applications deployed to Google Cloud.<br>\n\t </li>\n\t<li> The <strong>Trace</strong> starter enables instrumentation with Google Stackdriver Tracing<br>\n\t </li>\n\t<li> The <strong>Cloud Datastore</strong> starter provides integrations with Google Cloud Storage and Spring Resource.</li>\n</ol>","a":[{"id":1499531,"option":" 1 and 2","correct":false},{"id":1499532,"option":"2 and 3","correct":false},{"id":1499533,"option":"1 and 3","correct":false},{"id":1499534,"option":"All of these","correct":true}]},{"q":"<p>In Google Cloud Platform, you are working on the data backups of the Cloud SQL data tool instance. If the user needs a backup and the user does not want to wait for the backup window, then which of the following types of backups can be used to perform this action?</p>","a":[{"id":1341069,"option":"Automated ","correct":false},{"id":1341070,"option":"On-demand ","correct":true},{"id":1341071,"option":"Waited ","correct":false},{"id":1341072,"option":"None of these","correct":false}]},{"q":"<p>In Google Cloud Platform, you are working with the virtual private cloud (VPC) network. Which of the following statements about firewall rules for this network are correct:</p>\n\n<ol>\n\t<li>These rules control traffic only when traffic is outside the network, including communication among VM instances.</li>\n\t<li>Every VPC network has three implied firewall rules. They are implied allow egress rule, implied deny ingress rule, and implied view ingress rule.</li>\n\t<li>The user can delete these implied rules but cannot override them on their own.</li>\n</ol>","a":[{"id":1341019,"option":"1 and 2","correct":false},{"id":1341020,"option":"2 and 3","correct":false},{"id":1341021,"option":"1 and 3","correct":false},{"id":1341022,"option":"None of these","correct":true}]},{"q":"<p>In Google Cloud Platform, you are working with the subnets in the virtual private cloud (VPC)<strong> </strong>network. Which of the following statements about the constraints for the subnet ranges are correct:</p>\n\n<ol>\n\t<li>Subnet ranges must always be broader than the restricted ranges.</li>\n\t<li>Subnet ranges cannot span an RFC range and a privately used public IP address range.</li>\n\t<li>Subnet ranges cannot match with the restricted ranges.</li>\n</ol>","a":[{"id":1341015,"option":"1 and 2","correct":false},{"id":1341016,"option":"2 and 3","correct":true},{"id":1341017,"option":"1 and 3","correct":false},{"id":1341018,"option":"All of these","correct":false}]},{"q":"<p>In Google Cloud Platform, you are working on the virtual private cloud (VPC) network service. Which of the following statements about the features that are provided by this service are correct:</p>\n\n<ol>\n\t<li>It provides native external TCP/UDP Load Balancing and proxy systems for Internal HTTP(S) Load Balancing.</li>\n\t<li>It connects to on-premises networks using the Cloud VPN tunnels and Cloud Interconnect attachments.</li>\n\t<li>It distributes traffic from Google Cloud external load balancers to the backend.</li>\n</ol>\n\n<p> </p>","a":[{"id":1341011,"option":"1 and 2","correct":false},{"id":1341012,"option":"2 and 3","correct":true},{"id":1341013,"option":"1 and 3","correct":false},{"id":1341014,"option":"All of these","correct":false}]},{"q":"<p>In Google Cloud Platform, you are working on the security tools for the data logging. Which of the following audit logs are maintained by the cloud audit log for each project of your organization:</p>\n\n<ol>\n\t<li>Admin activity </li>\n\t<li>Policy denied</li>\n\t<li>Data access </li>\n\t<li>Server management </li>\n</ol>","a":[{"id":1341037,"option":"1, 2, and 3","correct":true},{"id":1341038,"option":"2, 3, and 4","correct":false},{"id":1341039,"option":"1, 2, and 4","correct":false},{"id":1341040,"option":"1, 3, and 4","correct":false}]},{"q":"<p> In Google Cloud Platform, you are required to create and manage package monitoring policies in your virtual private cloud (VPC) network. Which of the following statements about the <strong>compute.packetMirroringAdmin</strong> role are correct:</p>\n\n<ol>\n\t<li>This role grants the user the permissions to mirror specific resources. </li>\n\t<li>This role is utilized when a user is trying to create virtual mirroring policies in their projects.</li>\n\t<li>Even if users have permission to create a packet mirroring policy, they still require permission to mirror related sources. </li>\n\t<li>This role is utilized where the owner of a policy might not have any other permissions.</li>\n</ol>","a":[{"id":1341023,"option":"1, 2, and 3","correct":false},{"id":1341024,"option":"2, 3, and 4","correct":false},{"id":1341025,"option":"1, 2, and 4","correct":false},{"id":1341026,"option":"1, 3, and 4","correct":true}]},{"q":"<p>In Google Cloud Platform, if you have installed the Cloud SDK data tool, then which of the following components are installed by default:</p>\n\n<ol>\n\t<li>Default gcloud CLI Commands</li>\n\t<li>BigQuery Command-Line tool</li>\n\t<li>Cloud Storage Command-Line tool</li>\n\t<li>Cloud SDK core libraries</li>\n</ol>","a":[{"id":1341061,"option":"1, 2, and 3","correct":false},{"id":1341062,"option":"2, 3, and 4","correct":false},{"id":1341063,"option":"1, 3, and 4","correct":false},{"id":1341064,"option":"All of these","correct":true}]},{"q":"<p>In Google Cloud Platform, you are working with the content delivery network (CDN) service. Which of the following statements about route matching and origin selection are correct:</p>\n\n<ol>\n\t<li>Requests for a website can be routed to a group of Compute Engine backend services while the media resource of the website can be mapped to a cloud storage bucket.</li>\n\t<li>Once the Compute Engine provides the required access, the incoming HTTP requests have to be redirected to the HTTPS extension.</li>\n\t<li>The matching operation can be performed on host, path, query parameter, and header prior to backend (origin) selection.</li>\n</ol>\n\n<p> </p>","a":[{"id":1341007,"option":"1 and 2","correct":true},{"id":1341008,"option":"2 and 3","correct":false},{"id":1341009,"option":"1 and 3","correct":false},{"id":1341010,"option":"All of these","correct":false}]},{"q":"<p>In Google Cloud Platform, you are working on the security tools for the data logging. Which of the following statements represent the use of the <strong>Access Transparency </strong>tool in this scenario:</p>\n\n<ol>\n\t<li>For verifying that the Google Personnel are accessing your content only for business and data migration reasons.</li>\n\t<li>For verifying and tracking compliance with legal or regulatory obligations.</li>\n\t<li>For collecting and analyzing the tracked access events through an automated security information and event management (SIEM) tool.</li>\n</ol>","a":[{"id":1341033,"option":"1 and 2","correct":false},{"id":1341034,"option":"2 and 3","correct":true},{"id":1341035,"option":"1 and 3","correct":false},{"id":1341036,"option":"All of these","correct":false}]},{"q":"<p>In Google Cloud Platform, you are setting the different cache modes from the content delivery network (CDN). Which of the following cache mode requires origin responses to set valid cache directives and valid caching headers?</p>","a":[{"id":1341053,"option":"USE_ORIGIN_CACHE","correct":false},{"id":1341054,"option":"USE_ORIGIN_HEADERS","correct":true},{"id":1341055,"option":"USE_ORIGIN_CACHE_HEADERS","correct":false},{"id":1341056,"option":"None of these","correct":false}]},{"q":"<p>In Google Cloud Platform, you are working on the cloud audit logs in the security logging. If you are required to export your audit logs, then which of the following actions must be performed in this scenario:</p>\n\n<ol>\n\t<li>If you are required to export your audit log entries outside of your logging region, then you are required to create a log sink.</li>\n\t<li>If you are required to export your audit log entries of a project of your Google cloud organization, then you are required to review your aggregated sinks.</li>\n\t<li>At the exporting destination, you can utilize 512 KiB as the maximum size of a data access audit log.</li>\n</ol>","a":[{"id":1341045,"option":"1 and 2","correct":false},{"id":1341046,"option":"2 and 3","correct":false},{"id":1341047,"option":"1 and 3","correct":false},{"id":1341048,"option":"All of these","correct":true}]},{"q":"<p>In Google Cloud Platform, you are working on the cloud audit logs in the security logging. Which of the following audit logs contains the log entries for Google Cloud administrative actions that modify the configuration of resources?</p>","a":[{"id":1341041,"option":"Policy denied ","correct":false},{"id":1341042,"option":"System event ","correct":true},{"id":1341043,"option":"Admin activity ","correct":false},{"id":1341044,"option":"None of these","correct":false}]},{"q":"<p>In Google Cloud Platform, you are scripting the gcloud CLI commands with the Cloud SDK<strong> </strong>data tool. Which of the following statements about implementing the Service Account Authorization technique are correct in this scenario:</p>\n\n<ol>\n\t<li>This technique is recommended if the user is deploying a script or automation methods across multiple machines in a production environment.</li>\n\t<li>This technique is recommended if the user is deploying a script or automation methods on a single machine.</li>\n\t<li>This technique is recommended if the user is running the gcloud CLI commands on a Google Compute Engine virtual machine instance where all the users have access to the root.</li>\n</ol>","a":[{"id":1341065,"option":"1 and 2","correct":false},{"id":1341066,"option":"2 and 3","correct":false},{"id":1341067,"option":"1 and 3","correct":true},{"id":1341068,"option":"All of these","correct":false}]},{"q":"<p>In Google Cloud Platform, which of the following statements about the signed URL from the content delivery network (CDN) data tool are correct:</p>\n\n<ol>\n\t<li>They are URLs that provide limited permission and time to make a request.</li>\n\t<li>They contain the authentication information in their query strings and they allow users without credentials to perform specific actions on a resource. </li>\n\t<li>Not all the users that have the generated signed URL can utilize this signed URL to perform specific actions in a specific period of time.</li>\n</ol>\n\n<p> </p>","a":[{"id":1341057,"option":"1 and 2","correct":true},{"id":1341058,"option":"2 and 3","correct":false},{"id":1341059,"option":"1 and 3","correct":false},{"id":1341060,"option":"All of these","correct":false}]},{"q":"<p>In Google Cloud Platform, you are working on the Binary Authorization security tool. If you are required to secure your data by using the VPC Service Controls, then which of the following statements about these controls are correct:</p>\n\n<ol>\n\t<li>These controls improve the ability to reduce the risk of unauthorized copying or the transfer of data from your Google-managed services and resources.</li>\n\t<li>These controls can protect your data resources and services by adding this tool to the security perimeter.</li>\n\t<li>If you are using this tool for separation of duties by using individual Google cloud projects for deployments and attestations, then each such project can not be included in your VPC Service controls perimeter.</li>\n</ol>","a":[{"id":1341049,"option":"1 and 2","correct":true},{"id":1341050,"option":"2 and 3","correct":false},{"id":1341051,"option":"1 and 3","correct":false},{"id":1341052,"option":"All of these","correct":false}]}]