[{"q":"You have fired a request for an auth token while working with oAuth2 in Android. The bundle in AccountManagerCallback received by you contains an intent in the KEY_INTENT key.  Which of these can be considered a valid reason for the failure of the auth token request?","a":[{"id":1212645,"option":"An error in the device or network caused AccountManager to fail.","correct":false},{"id":1212646,"option":"The user decided not to grant your app access to the account.","correct":false},{"id":1212647,"option":"The stored account credentials aren't sufficient to gain access to the account.","correct":true},{"id":1212648,"option":"The cached auth token has expired.","correct":false}]},{"q":"You want your IDAM system to have the capability of exchanging identity information between two identity domains. <br><br>Which of the following protocols will you use to enable this feature?","a":[{"id":1212621,"option":"OAuth","correct":false},{"id":1212622,"option":"SAML","correct":true},{"id":1212623,"option":"OIDC","correct":false},{"id":1212624,"option":"WS-Federation","correct":false}]},{"q":"An employee has more access to data than is warranted. <br><br>In which of the following cases is poor Identity Access Management not a disadvantage or a security threat in the given context:<br><br>1. The nature of the employee's job is such that he has to frequently shift from one project to another within the company without advance notice.<br>2. The employee has received a better job opportunity in a competitor's firm and is moving to that company quickly.<br>3. There has been constant intrusion by attackers on the company's data where they target specific employees through spear phishing and social engineering.","a":[{"id":1212617,"option":"1","correct":true},{"id":1212618,"option":"2","correct":false},{"id":1212619,"option":"3","correct":false},{"id":1212620,"option":"None of these","correct":false}]},{"q":"During an authorization grant using an authorization code the user is redirected to the client application. <br>What else does the authorization server send during the redirection?","a":[{"id":1212629,"option":"An authorization code representing the authorization.","correct":true},{"id":1212630,"option":"The client ID and client secret code.","correct":false},{"id":1212631,"option":"An access token","correct":false},{"id":1212632,"option":"An authorization code representing the authorization and an access token.","correct":false}]},{"q":"You want to build a Privileged Access Management tool using a Two Factor Authentication (TFA) system. How many of the following authentication systems will you use as a component in the TFA system?<br><br>1. Biometric authentication<br>2. OTP<br>3. RSA<br>4. SecurID","a":[{"id":1212605,"option":"1","correct":false},{"id":1212606,"option":"2","correct":false},{"id":1212607,"option":"3","correct":false},{"id":1212608,"option":"4","correct":true}]},{"q":"Which feature of the IdAM system is depicted when you log into Quora through your Facebook account?<br>","a":[{"id":1212589,"option":"Pure identity function","correct":false},{"id":1212590,"option":"User access function","correct":false},{"id":1212591,"option":"Service function","correct":false},{"id":1212592,"option":"Identity federation","correct":true}]},{"q":"<p>You are connected to a server that uses the OAuth2 protocol to validate requests. If renewing a token is a cheap operation for your server, what do you do before calling AccountManager.getAuthToken()?</p>","a":[{"id":1212633,"option":"Call AccountManager.invalidateAuthToken()","correct":true},{"id":1212634,"option":"Call AccountManager.validateAuthToken()","correct":false},{"id":1212635,"option":"Call either AccountManager.invalidateAuthToken() or AccountManager.validateAuthToken()","correct":false},{"id":1212636,"option":"None of these","correct":false}]},{"q":"A scenario arises in which either the IDP application or SP application can consume another SP's service or a cloud service. Also, the user can have an active session in the IDP or SP. <br><br>Which of the following is a possible case in which such a scenario can occur?","a":[{"id":1212637,"option":"SP-initiated federated SSO","correct":false},{"id":1212638,"option":"IDP-initiated federated SSO","correct":false},{"id":1212639,"option":"Web Services Security Management","correct":true},{"id":1212640,"option":"None of these","correct":false}]},{"q":"You use app X to order food online and you pay using a smart card avaliable on app X. The smart card has some monetary value attached to it. <br><br>Which of the following functionalities of an IDAM system does this represent?","a":[{"id":1212625,"option":"Pure identity function","correct":false},{"id":1212626,"option":"User access function","correct":true},{"id":1212627,"option":"Service function","correct":false},{"id":1212628,"option":"Identity federation","correct":false}]},{"q":"In Identity Access Management, an SSO needs to be implemented for multiple sites in your network that uses IP and cookies. <br><br>Which of these constraints will you need to meet to achieve this?","a":[{"id":1212597,"option":"All traffic must be encrypted","correct":false},{"id":1212598,"option":"Port 80 must be open","correct":false},{"id":1212599,"option":"All sites must share a common DNS parent domain","correct":true},{"id":1212600,"option":"All of these","correct":false}]},{"q":"You want to add a non-existent feature in your company's Identity Access Management System (IAMS). You want the IAMS to set workflows to manage access requests with the option of having mutiple stages of reviews. Each request must also have approval requirements. <br><br>Why will you add the feature to your company's IAMS?","a":[{"id":1212613,"option":"This methodology provides an appropriate review process at multiple levels if higher-level access is required.","correct":false},{"id":1212614,"option":"It is helpful while reviewing the existing rights in order to prevent privilege violation.","correct":false},{"id":1212615,"option":"Both 1 and 2","correct":true},{"id":1212616,"option":"Neither 1 nor 2","correct":false}]},{"q":"The clock on the parsing machine is not in sync with the clock on the machine that created the JWT. This causes the nbf claim assertions to throw exceptions.<br><br>Which of the following can be used to setAllowedClockSkewSeconds to account for such differences in the JWT?","a":[{"id":1212641,"option":"JwtParserBuilder","correct":true},{"id":1212642,"option":"JwtTokenBuilder","correct":false},{"id":1212643,"option":"JwtChainParser","correct":false},{"id":1212644,"option":"JwtClockFactory","correct":false}]},{"q":"Which of the following components directly interact with the Identity Access Management component of an IdAM system?<br><br>1. Policy, privilege, and account management<br>2. Identity and policy repository<br>3. Authentication and authorization services","a":[{"id":1212601,"option":"2020-02-01 00:00:00","correct":true},{"id":1212602,"option":"2020-03-01 00:00:00","correct":false},{"id":1212603,"option":"2020-03-02 00:00:00","correct":false},{"id":1212604,"option":"All of these","correct":false}]},{"q":"Which of the following features are key for the development of a strong Identity Access Management (IAM) system and must be included in your design:<br><br>1. The IAM admins should have the privilege to view and change the access rights of users instantly.<br>2. There should be an automatic process of user provisioning and account setup.<br>3. A privilege system within the central directory should automatically match employee job title, location, and business unit ID to manage access requests automatically.<br>4. All of these","a":[{"id":1212609,"option":"1","correct":false},{"id":1212610,"option":"2","correct":false},{"id":1212611,"option":"3","correct":false},{"id":1212612,"option":"4","correct":true}]},{"q":"In Identity Access Management, if system X is the authoritative source for names, system Y is the authoritative source for contact information, and system Z is the authoritative source for usernames and e-mail IDs, which of the following authoritative systems is best suited for this scenario?<br><br>","a":[{"id":1212593,"option":"Single authoritative source","correct":false},{"id":1212594,"option":"Multiple authoritative source","correct":false},{"id":1212595,"option":"Multiple target/source","correct":true},{"id":1212596,"option":"None of these","correct":false}]}]