[{"q":"<p>Informatica Data Quality (IDQ) is a suite of applications and components that you can integrate with Informatica PowerCenter to deliver enterprise-strength data quality capability. If you are required to enable plan and file sharing and to run programs in a networked environment, then which of the following core components of IDQ will you use to perform this action in this scenario?</p>","a":[{"id":1754583,"option":"Data Quality Workbench","correct":false},{"id":1754584,"option":"Data Quality Server","correct":true},{"id":1754585,"option":"Both of these","correct":false},{"id":1754586,"option":"None of these","correct":false}]},{"q":"<p>In Informatica, you are working on the transformations. Which of the following statements about Identity Resolution Transformation are correct:</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>The Identity Resolution transformation is a passive transformation that you can use to search and match data in Informatica Identity Resolution (IIR).</li>\n\t<li>The PowerCenter Integration Service uses the search definition that you specify in the Identity Resolution transformation to search and match data residing in the IIR tables. </li>\n\t<li>The input and output views in the system determine the input and output ports of the transformation.</li>\n</ol>","a":[{"id":1755171,"option":"1 and 2","correct":false},{"id":1755172,"option":"2 and 3","correct":true},{"id":1755173,"option":"1 and 3","correct":false},{"id":1755174,"option":"All of these","correct":false}]},{"q":"<p>In Informatica, you are working on the transformations. You have an Employee details table which contains all the information about the employees that work in your organization. Now, if you are required to adjust employee salaries, concatenate first and last names, or convert strings to numbers, then which of the following transformations must be implemented to perform this action in this scenario?</p>","a":[{"id":1755167,"option":"Aggregate Transformation","correct":false},{"id":1755168,"option":"SQL Transformation","correct":false},{"id":1755169,"option":"Data Masking Transformation","correct":false},{"id":1755170,"option":"Expression Transformation","correct":true}]},{"q":"<p>In Informatica, you are working on the transformations. If you are required to change sensitive production data to realistic test data for non-production environments, then which of the following transformations must be implemented to perform this action in this scenario?</p>","a":[{"id":1755163,"option":"Aggregate Transformation","correct":false},{"id":1755164,"option":"Custom Transformation","correct":false},{"id":1755165,"option":"Expression Transformation","correct":false},{"id":1755166,"option":"Data Masking Transformation","correct":true}]},{"q":"<p>In Informatica, you are working on the transformations. You wanted to receive a row that contains multiple-occurring columns and returns a row for each instance of the multiple-occurring data. For this, you have implemented a Normalizer transformation. If you are required to process multiple-occurring data from relational tables or flat files, then which of the following types of Normalizer transformation must be implemented to perform this action in this scenario?</p>","a":[{"id":1755159,"option":"VSAM Normalizer transformation","correct":false},{"id":1755160,"option":"Pipeline Normalizer transformation","correct":true},{"id":1755161,"option":"Trobleshooting Normalizer transformation","correct":false},{"id":1755162,"option":"Both 1 and 3","correct":false}]},{"q":"<p>In Informatica, you are working on the transformations. Which of the following statements about Sorter transformation are correct:</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>You can also configure the Sorter transformation for case-sensitive sorting, and specify whether the output rows should be distinct.</li>\n\t<li>The Sorter transformation is a passive transformation. It must be connected to the data flow.</li>\n\t<li>When you create a Sorter transformation in a mapping, you specify one or more ports as a sort key and configure each sort key port to sort in ascending or descending order. </li>\n\t<li>You can use the Sorter transformation to sort data passing through an Aggregator transformation configured to use sorted input.</li>\n</ol>","a":[{"id":1755155,"option":"1, 2, and 3","correct":false},{"id":1755156,"option":"2, 3, and 4","correct":false},{"id":1755157,"option":"1, 2, and 4","correct":false},{"id":1755158,"option":"1, 3, and 4","correct":true}]},{"q":"<p>In Informatica, you are working on the transformations. You are required to process your SQL queries midstream in a pipeline. For this, you are required to create an SQL transformation. While creating an SQL transformation, you are required to configure options. You wanted to execute your SQL scripts from text files. For this, you are running your SQL transformation in Script mode. Now, which of the following statements about the default ports when an SQL transformation is configured for Script modes are correct:</p>\n\n<ol>\n\t<li>The port <em>ScriptName</em> with <em>output</em> type receives the name of the script to execute for the current row.</li>\n\t<li>The port <em>ScriptResult</em> with <em>output</em> type returns PASSED if the script execution succeeds for the row. Otherwise contains FAILED.</li>\n\t<li>The port <em>ScriptError</em> with <em>output</em> type returns errors that occur when a script fails for a row.</li>\n\t<li>The port <em>ScriptName</em> with <em>input</em> type receives the name of the script to execute for the current row.</li>\n</ol>","a":[{"id":1755151,"option":"1, 2, and 3","correct":false},{"id":1755152,"option":"2, 3, and 4","correct":true},{"id":1755153,"option":"1, 2, and 4","correct":false},{"id":1755154,"option":"1, 3, and 4","correct":false}]},{"q":"<p>In Informatica, you are working on the transformations. You are using Transaction Control Transformations in the mappings. You are given the mappings containing two pipelines. The pipeline branch at <em>TransactionControl1</em>, which occurs after a source and source qualifier. The first branch contains <em>Expression1</em> and <em>Target1</em>. The second branch contains an <em>Aggregator transformation(Aggregator2), Expression2, TransactionControl2</em>, and <em>Target2</em>. Now, which of the following statements in this scenario are correct:</p>\n\n<p><strong>Figure</strong></p>\n\n<p><strong><img alt=\"\" height=\"228\" src=\"https://he-s3.s3.ap-southeast-1.amazonaws.com/media/uploads/7e1b01cc-6e8b-4230-9eec-10f8560e0dd5.png\" width=\"866\"></strong></p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>The mapping does not include any transformation that drops transaction boundaries between <em>TransactionControl2</em> and <em>Target2</em>, making <em>TransactionControl1</em> effective for <em>Target1</em>.</li>\n\t<li>The Integration Service uses the transaction boundaries defined by <em>TransactionControl1</em> for <em>Target1</em>.</li>\n\t<li>The mapping includes a transformation that drops transaction boundaries between <em>TransactionControl1</em> and <em>Target2</em>, making <em>TransactionControl1</em> ineffective for <em>Target2</em>. </li>\n\t<li>When the Integration Service processes <em>Aggregator2</em>, with Transformation Scope set to All Input, it drops the transaction boundaries defined by <em>TransactionControl1</em> and outputs all rows in an open transaction. </li>\n</ol>","a":[{"id":1755147,"option":"1, 2, and 3","correct":false},{"id":1755148,"option":"2, 3, and 4","correct":true},{"id":1755149,"option":"1, 2, and 4","correct":false},{"id":1755150,"option":"1, 3, and 4","correct":false}]},{"q":"<p>In Informatica, you are working on the transformations. If you are required to create a Sequence Generator Transformation, then which of the following sequences of steps should be performed in this scenario:</p>\n\n<p><strong>Steps</strong></p>\n\n<ol>\n\t<li>In the Mapping Designer, click Transformation &gt; Create. Select the Sequence Generator transformation.</li>\n\t<li>Double-click the title bar of the transformation.</li>\n\t<li>Enter a description for the transformation.</li>\n\t<li>Select the Properties tab. Enter settings.</li>\n\t<li>To generate new sequences during a session, connect the NEXTVAL port to at least one transformation in the mapping.</li>\n\t<li>Enter a name for the Sequence Generator, and click Create. Click Done.</li>\n</ol>","a":[{"id":1754851,"option":"1 -> 2 -> 3 -> 4 -> 5 -> 6","correct":false},{"id":1754852,"option":"1 -> 6 -> 2 -> 3 -> 4 -> 5","correct":true},{"id":1754853,"option":"1 -> 2 -> 6 -> 3 -> 4 -> 5","correct":false},{"id":1754854,"option":"1 -> 6 -> 5 -> 4 -> 3 -> 2","correct":false}]},{"q":"<p>In Informatica, you are working on transformations. You are working on the output groups from the Router transformation. You have created a user-defined group to test a condition based on incoming data that consists of both output ports and a group filter condition. Now, which of the following statements about the actions that are performed by the Integration Service in this scenario are correct:</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>The Integration Service tests the conditions of each user-defined group after processing the default group.</li>\n\t<li>The Integration Service determines the order of evaluation for each condition based on the order of the connected output groups. </li>\n\t<li>The Integration Service processes user-defined groups that are connected to a transformation or a target in mapping. </li>\n\t<li>The Integration Service only processes user-defined groups that are not connected in a mapping if the default group is connected to a transformation or a target.</li>\n</ol>","a":[{"id":1754611,"option":"1, 2, and 3","correct":false},{"id":1754612,"option":"2, 3, and 4","correct":true},{"id":1754613,"option":"1, 2, and 4","correct":false},{"id":1754614,"option":"1, 3, and 4","correct":false}]},{"q":"<p>In Informatica, you are working on the transformations. A connected Lookup transformation is a Lookup transformation that is connected to a source or target in mapping. You have run a mapping that contains a connected Lookup transformation. Now, Integration Service passes values from another transformation to input ports in the Lookup transformation. For each input row, the Integration Service queries the lookup source or cache based on the lookup ports and the lookup condition in the transformation. Now, if the transformation is uncached or uses a static cache, then which of the following actions will be performed by the Integration Service in this scenario?</p>\n\n<ol>\n</ol>","a":[{"id":1754591,"option":"The Integration Service inserts the row into the cache","correct":false},{"id":1754592,"option":"The Integration Service inserts the row into the cache and returns values from the lookup query.","correct":false},{"id":1754593,"option":"The Integration Service inserts the row into the cache when it does not find the row in the cache.","correct":false},{"id":1754594,"option":"The Integration Service returns values from the lookup query.","correct":true}]},{"q":"<p>In Informatica, you are required to direct stage or cleanse data using IDQ mappings to MDM's Stage tables bypassing Landing tables. For this, you have integrated your Informatica Data Quality (IDQ) suite and Master Data Management (MDM) technique by using Informatica Platform stating method. Now, which of the following statements represents the advantages of implementing this feature:</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>Hub Stage options like Delta detection, hard delete detection, and audit trails will be available.</li>\n\t<li>Stage tables are immediately available to use in the Developer tool after synchronization, eliminating the need to manually create physical data objects.</li>\n\t<li>Changes to the synchronized structures are reflected in the Developer tool automatically.</li>\n\t<li>Enables loading data into Informatica MDM's staging tables, bypassing the landing tables.</li>\n</ol>","a":[{"id":1754587,"option":"1, 2, and 3","correct":false},{"id":1754588,"option":"2, 3, and 4","correct":true},{"id":1754589,"option":"1, 2, and 4","correct":false},{"id":1754590,"option":"1, 3, and 4","correct":false}]},{"q":"<p>In Informatica, the PowerCenter Integration Services creates a default partition type at each partition point. In your data, you need to sort items by item ID, but we do not know how many items have a particular ID number. For this, you are implementing Hash partitioning to perform this action. Now, if the PowerCenter Integration Service uses all grouped or sorted ports as a compound partition key, then which of the following types of hash partitioning techniques you must implement in this scenario?</p>","a":[{"id":1754579,"option":"Hash user keys partitioning","correct":false},{"id":1754580,"option":"Hash auto keys partitioning","correct":true},{"id":1754581,"option":"Hash domain keys partitioning","correct":false},{"id":1754582,"option":"Hash data keys partitioning","correct":false}]},{"q":"<p>In Informatica, the PowerCenter Integration Service distributes blocks of data to one or more partitions. If you require each partition process to be rows based on the number and size of the blocks, then which of the following types of partitions should be implemented to perform this action in this scenario?</p>","a":[{"id":1754575,"option":"Key range partitioning","correct":false},{"id":1754576,"option":"Pass-through partitioning","correct":false},{"id":1754577,"option":"Round robin partitioning","correct":true},{"id":1754578,"option":"Database partitioning","correct":false}]},{"q":"<p>In Informatica, the PowerCenter Integration Services creates a default partition type at each partition point. Which of the following statements about Informatical Partitions are correct:</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>We cannot create a partition key for round-robin, hash auto-keys, and pass-through partition.</li>\n\t<li>When we use a pass-through partition, then Informatica tries to make multiple connection requests to the database server. </li>\n\t<li>We cannot use the native database options as partition alternatives to increase the degree of parallelism of query processing.</li>\n\t<li>If we have a bitmap index upon the target and by using the pass-through partition, then we need to update the target table. </li>\n</ol>","a":[{"id":1754571,"option":"1, 2, and 3","correct":false},{"id":1754572,"option":"2, 3, and 4","correct":false},{"id":1754573,"option":"1, 2, and 4","correct":true},{"id":1754574,"option":"1, 3, and 4","correct":false}]},{"q":"<p>In Informatica, you are trying the Optimize the PowerCenter Components. You are currently caching PowerCenter Metadata for the Repository Service. You run a workflow with 1,000 sessions. The first time you run a workflow with caching enabled, the Integration Service fetches the session metadata from the repository. During subsequent runs of the workflow, the Repository Service fetches the session metadata from the cache. What will this result in?</p>","a":[{"id":1754567,"option":"It will decrease Data Transformation Manager (DTM) process performance","correct":false},{"id":1754568,"option":"It will increase Data Transformation Manager (DTM) process performance","correct":true},{"id":1754569,"option":"No impact will be observed","correct":false},{"id":1754570,"option":"None of these","correct":false}]},{"q":"<p>In Informatica, you are working on the Performance tuning. You can optimize the performance of a Repository Service that you configured without the high availability option. If you are required to optimize your performance, then which of the following actions should be implemented in this scenario?</p>","a":[{"id":1754563,"option":"To ensure that the Repository Service process runs on the same machine where the repository database resides.","correct":true},{"id":1754564,"option":"By entering parameters in the order you want them to run.","correct":false},{"id":1754565,"option":"By enabling the Optimize Database Schema option for the Repository Service in the Administration Console.","correct":false},{"id":1754566,"option":"None of these","correct":false}]},{"q":"<p>In Informatica, which of the following statements about the features of implementing Master Data Management (MDM):</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>It supports a 180-degree view between the customers, products, suppliers, and other entities ' relationships.</li>\n\t<li>It supports intelligent matches and merges property.</li>\n\t<li>It provides a modular design.</li>\n</ol>","a":[{"id":1754555,"option":"1 and 2","correct":false},{"id":1754556,"option":"2 and 3","correct":true},{"id":1754557,"option":"1 and 3","correct":false},{"id":1754558,"option":"All of these","correct":false}]},{"q":"<p>In Informatica, Master data management (MDM) is required to remove poor data quality from the enterprise. Which of the following represent the challenges for implementing this MDM technique in different organizations:</p>\n\n<ol>\n\t<li>Erroneous information</li>\n\t<li>Data consistency</li>\n\t<li>Mislabeled data</li>\n\t<li>Incomplete information</li>\n</ol>","a":[{"id":1754559,"option":"1, 2, and 3","correct":false},{"id":1754560,"option":"2, 3, and 4","correct":false},{"id":1754561,"option":"1, 2, and 4","correct":false},{"id":1754562,"option":"1, 3, and 4","correct":true}]},{"q":"<p>You are working on Project and Asset management from Informatica Cloud Data Integration. If you are required to copy an object and use it as a template, then in which of the following instances  Informatica Intelligent Cloud Services retains child elements in this scenario:</p>\n\n<p><strong>Instances</strong></p>\n\n<ol>\n\t<li>When you copy a project, the new project contains all of the folders and assets that were in the original project. </li>\n\t<li>When you copy a folder, the new folder contains all of the assets that were in the original folder.</li>\n\t<li>When you copy assets or a folder containing assets to another location, the assets retain their references to dependent objects.</li>\n</ol>","a":[{"id":1754551,"option":"1 and 2","correct":false},{"id":1754552,"option":"2 and 3","correct":false},{"id":1754553,"option":"1 and 3","correct":false},{"id":1754554,"option":"All of these","correct":true}]},{"q":"<p>John is working on Informatica Cloud Data Integration. He is discovering and selecting the catalog object for the Customers table while working on the data mappings. For this, he has opened the Data Catalog page and clicked on Use Object in the row that contains the object. If he is required to add the object to an open mapping, then which of the following options should he select in this scenario?</p>","a":[{"id":1754547,"option":"Add to open asset","correct":true},{"id":1754548,"option":"Add to open synchronization","correct":false},{"id":1754549,"option":"Add to open ingestion","correct":false},{"id":1754550,"option":"None of these","correct":false}]},{"q":"<p>In Informatica PowerCenter, Alice is working on the folder permissions while creating a folder in the PowerCenter repository. Assume that she is the owner of that folder. If you tried to access those folders, then which of the following statements are correct with respect to the different permissions:</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>If you have the read permission, you can view the folder and objects in the folder.</li>\n\t<li>If you have the write permission, you can create, edit, and remove objects in the folder.</li>\n\t<li>If you have the execute permission, you can run or schedule workflows in the folder.</li>\n</ol>","a":[{"id":1754041,"option":"1 and 2","correct":false},{"id":1754042,"option":"2 and 3","correct":false},{"id":1754043,"option":"1 and 3","correct":true},{"id":1754044,"option":"None of these","correct":false}]},{"q":"<p>Mike is working on Informatica PowerCenter. He configures the Database connections in the Workflow Manager while creating a session. Before creating this session, he has provided the Integration Service with the information it needs to connect to the source and target databases. Now, he has launched the Workflow Manager and selected the repository in the Navigator. He has entered his username and password to connect to the repository and has entered the Relational Connection Browser dialog box. After selecting the appropriate database type, he has named the database connection as <em>INFMTCA_WITH_HACKRTH </em>in the Name field. But he is stuck at this stage and requested your help to complete this action. So, which of the following sequences of steps he needs to follow to complete this action in this scenario:</p>\n\n<p><strong>Steps</strong></p>\n\n<ol>\n\t<li>In the attributes section, enter the database name</li>\n\t<li>Select a source code page that must be a subset of the target code page for the database connection.</li>\n\t<li>Enter the user name and password to connect to the database.</li>\n</ol>\n\n<p> </p>","a":[{"id":1753957,"option":"1 -> 2 -> 3","correct":false},{"id":1753958,"option":"2 -> 1 -> 3","correct":false},{"id":1753959,"option":"3 -> 2 -> 1","correct":true},{"id":1753960,"option":"2 -> 3 -> 1","correct":false}]},{"q":"<p>In Informatica PowerCenter, you are working on PowerCenter Designer. If you are required to analyze sources, design target schemas, and build source-to-target mappings that are container in this Designer, then which of the statements correctly represents the functionalities of the corresponding tools in this scenario:</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>The tool Mapping Designer is used to create sets of transformations to use in mappings.</li>\n\t<li>The tool Mapplet Designer is used to create mappings that the Integration Service uses to extract, transform, and load data.</li>\n\t<li>The tool Transformation Developer is used to develop transformations to use in mappings. You can also develop user-defined functions to use in expressions.</li>\n\t<li>The tool Target Designer is used to import or create target definitions.</li>\n</ol>","a":[{"id":1753953,"option":"1 and 2","correct":false},{"id":1753954,"option":"2 and 3","correct":false},{"id":1753955,"option":"3 and 4","correct":true},{"id":1753956,"option":"1 and 4","correct":false}]},{"q":"<p>In Informatica PowerCenter, which of the following applications of Informatica represents a center of Informatica tools where all data is stored, which is related to the mapping, sources, or targets?</p>","a":[{"id":1753949,"option":"Informatica PowerCenter Client Tools","correct":false},{"id":1753950,"option":"Informatica PowerCenter Repository","correct":true},{"id":1753951,"option":"Informatica PowerCenter Server","correct":false},{"id":1753952,"option":"Both 2 and 3","correct":false}]},{"q":"<p>In Informatica PowerCenter, you are working on the Informatica Domain. If you are required to observe the functions that are performed by a Service Manager, then which of the statements about the functionalities of this Service Manager are correct:</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>It provides notifications about domain and service events.</li>\n\t<li>It registers license information and verifies license information when you run application services.</li>\n\t<li>It authenticates user requests from the Administrator tool, PowerCenter Client, and Metadata Manager.</li>\n\t<li>It manages domain configuration metadata.</li>\n</ol>","a":[{"id":1753945,"option":"1, 2, and 3","correct":false},{"id":1753946,"option":"2, 3, and 4","correct":false},{"id":1753947,"option":"1, 3, and 4","correct":false},{"id":1753948,"option":"All of these","correct":true}]},{"q":"<p>In Informatica PowerCenter, you are working on the application services from Informatica Domain. If you are required to store metadata for Informatica Developer, Informatica Analyst, the Data Integration Service, and the Informatica Administrator, then which of the following application service is used to perform this action in this scenario?</p>","a":[{"id":1753941,"option":"PowerCenter Repository Service","correct":false},{"id":1753942,"option":"SAP BW Service","correct":false},{"id":1753943,"option":"Metadata Manager Service","correct":false},{"id":1753944,"option":"None of these","correct":true}]},{"q":"<p>Bob is working on Informatica Architecture. If he is required to manage the domain operations such as logging, authentication, and authorization, then which of the following services provided by the Informatica Domain must be implemented to perform this action in this scenario?</p>","a":[{"id":1753597,"option":"Application Manager","correct":false},{"id":1753598,"option":"Resource Manager","correct":false},{"id":1753599,"option":"Service Manager","correct":true},{"id":1753600,"option":"None of these","correct":false}]},{"q":"<p>You are working with Informatica Architecture. Which of the following statements about Informatica Domain are correct:</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>The Informatica domain consists of nodes and services where these nodes and services are categorized into folders or sub-folders based on administration requirements and design architecture.</li>\n\t<li>The Console web page of the Informatica administrator creates a domain that looks like a folder. Inside this folder, we can create a node with the services.</li>\n\t<li>In the Informatica domain, all the services and processes run outside the domain in the Informatica.</li>\n</ol>","a":[{"id":1753593,"option":"1 and 2","correct":true},{"id":1753594,"option":"2 and 3","correct":false},{"id":1753595,"option":"1 and 3","correct":false},{"id":1753596,"option":"All of these","correct":false}]},{"q":"<p>Alice is working on the Informatica Architecture. If she is required to maintain Informatica metadata and provides access to the same metadata to other services, then which of the following services from the Informatica ETL tool must be implemented by her to perform this action in this scenario?</p>","a":[{"id":1753589,"option":"Integration Service","correct":false},{"id":1753590,"option":"Reporting Service","correct":false},{"id":1753591,"option":"Repository Service","correct":true},{"id":1753592,"option":"Nodes","correct":false}]}]