[{"q":"<p>In Informatica PowerCenter, Alice is working on the folder permissions while creating a folder in the PowerCenter repository. Assume that she is the owner of that folder. If you tried to access those folders, then which of the following statements are correct with respect to the different permissions:</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>If you have the read permission, you can view the folder and objects in the folder.</li>\n\t<li>If you have the write permission, you can create, edit, and remove objects in the folder.</li>\n\t<li>If you have the execute permission, you can run or schedule workflows in the folder.</li>\n</ol>","a":[{"id":1754041,"option":"1 and 2","correct":false},{"id":1754042,"option":"2 and 3","correct":false},{"id":1754043,"option":"1 and 3","correct":true},{"id":1754044,"option":"None of these","correct":false}]},{"q":"<p>Mike is working on Informatica PowerCenter. He configures the Database connections in the Workflow Manager while creating a session. Before creating this session, he has provided the Integration Service with the information it needs to connect to the source and target databases. Now, he has launched the Workflow Manager and selected the repository in the Navigator. He has entered his username and password to connect to the repository and has entered the Relational Connection Browser dialog box. After selecting the appropriate database type, he has named the database connection as <em>INFMTCA_WITH_HACKRTH </em>in the Name field. But he is stuck at this stage and requested your help to complete this action. So, which of the following sequences of steps he needs to follow to complete this action in this scenario:</p>\n\n<p><strong>Steps</strong></p>\n\n<ol>\n\t<li>In the attributes section, enter the database name</li>\n\t<li>Select a source code page that must be a subset of the target code page for the database connection.</li>\n\t<li>Enter the user name and password to connect to the database.</li>\n</ol>\n\n<p> </p>","a":[{"id":1753957,"option":"1 -> 2 -> 3","correct":false},{"id":1753958,"option":"2 -> 1 -> 3","correct":false},{"id":1753959,"option":"3 -> 2 -> 1","correct":true},{"id":1753960,"option":"2 -> 3 -> 1","correct":false}]},{"q":"<p>In Informatica PowerCenter, you are working on PowerCenter Designer. If you are required to analyze sources, design target schemas, and build source-to-target mappings that are container in this Designer, then which of the statements correctly represents the functionalities of the corresponding tools in this scenario:</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>The tool Mapping Designer is used to create sets of transformations to use in mappings.</li>\n\t<li>The tool Mapplet Designer is used to create mappings that the Integration Service uses to extract, transform, and load data.</li>\n\t<li>The tool Transformation Developer is used to develop transformations to use in mappings. You can also develop user-defined functions to use in expressions.</li>\n\t<li>The tool Target Designer is used to import or create target definitions.</li>\n</ol>","a":[{"id":1753953,"option":"1 and 2","correct":false},{"id":1753954,"option":"2 and 3","correct":false},{"id":1753955,"option":"3 and 4","correct":true},{"id":1753956,"option":"1 and 4","correct":false}]},{"q":"<p>In Informatica PowerCenter, which of the following applications of Informatica represents a center of Informatica tools where all data is stored, which is related to the mapping, sources, or targets?</p>","a":[{"id":1753949,"option":"Informatica PowerCenter Client Tools","correct":false},{"id":1753950,"option":"Informatica PowerCenter Repository","correct":true},{"id":1753951,"option":"Informatica PowerCenter Server","correct":false},{"id":1753952,"option":"Both 2 and 3","correct":false}]},{"q":"<p>In Informatica PowerCenter, you are working on the Informatica Domain. If you are required to observe the functions that are performed by a Service Manager, then which of the statements about the functionalities of this Service Manager are correct:</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>It provides notifications about domain and service events.</li>\n\t<li>It registers license information and verifies license information when you run application services.</li>\n\t<li>It authenticates user requests from the Administrator tool, PowerCenter Client, and Metadata Manager.</li>\n\t<li>It manages domain configuration metadata.</li>\n</ol>","a":[{"id":1753945,"option":"1, 2, and 3","correct":false},{"id":1753946,"option":"2, 3, and 4","correct":false},{"id":1753947,"option":"1, 3, and 4","correct":false},{"id":1753948,"option":"All of these","correct":true}]},{"q":"<p>In Informatica PowerCenter, you are working on the application services from Informatica Domain. If you are required to store metadata for Informatica Developer, Informatica Analyst, the Data Integration Service, and the Informatica Administrator, then which of the following application service is used to perform this action in this scenario?</p>","a":[{"id":1753941,"option":"PowerCenter Repository Service","correct":false},{"id":1753942,"option":"SAP BW Service","correct":false},{"id":1753943,"option":"Metadata Manager Service","correct":false},{"id":1753944,"option":"None of these","correct":true}]}]