[{"q":"<p>Suppose you want to deploy your application on <em>Kubernetes</em> using minikube. Some of the initial steps to create a Kubernetes&nbsp;cluster are mentioned below. Which steps should you run and in what order to set up a cluster in minikube?</p>\n\n<ol>\n\t<li>kubernetes version</li>\n\t<li>minikube version</li>\n\t<li>minikube start</li>\n\t<li>kubectl version</li>\n\t<li>kubectl start</li>\n\t<li>kubectl cluster-info</li>\n\t<li>kubectl get nodes</li>\n</ol>","a":[{"id":1691734,"option":"1, 3, 5, 6, 7","correct":false},{"id":1691735,"option":"1, 4, 5, 6, 7","correct":false},{"id":1691736,"option":"2. 3, 4, 6, 7","correct":true},{"id":1691737,"option":"2. 4, 5, 6, 7","correct":false}]},{"q":"<p>Suppose you want to deploy your application on <em>Kubernetes</em> using minikube. The pod can be&nbsp;accessed by its internal IP address within the Kubernetes Cluster. How can you make the&nbsp;<em>\"my-node\"</em>&nbsp;container accessible from outside the Kubernetes virtual network?</p>","a":[{"id":1691730,"option":"kubectl get deploy my-node --type=LoadBalancer --port=8080","correct":false},{"id":1691731,"option":"kubectl get deployment my-node --type=LoadBalancer --port=8080","correct":false},{"id":1691732,"option":"kubectl expose deploy my-node --type=LoadBalancer --port=8080","correct":false},{"id":1691733,"option":"kubectl expose deployment my-node --type=LoadBalancer --port=8080","correct":true}]},{"q":"<p>You are working on Kubernetes using <em>minikube</em>. Which of the following code snippet is the correct way to interact with your Kubernetes cluster&nbsp;and deploy an application to minikube?</p>\n\n<p><strong>Code</strong></p>\n\n<p>1.</p>\n\n<pre class=\"prettyprint\"><code>kubectl create deploy -minikube1 -image=k8s.gcr.io/echoserver:1.4\nkubectl expose deploy -minikube1 -type=LoadBalancer -port=8080</code></pre>\n\n<p>2.</p>\n\n<pre class=\"prettyprint\"><code>kubectl create deployment -minikube1 -image=k8s.gcr.io/echoserver:1.4\nkubectl expose deployment -minikube1 -type=LoadBalancer -port=8080</code></pre>\n\n<p>3.</p>\n\n<pre class=\"prettyprint\"><code>kubectl create deploy hello-minikube1 -image=k8s.gcr.io/echoserver:1.4\nkubectl expose deploy hello-minikube1 -type=LoadBalancer --port=8080</code></pre>\n\n<p>4.</p>\n\n<pre class=\"prettyprint\"><code>kubectl create deployment hello-minikube1 --image=k8s.gcr.io/echoserver:1.4\nkubectl expose deployment hello-minikube1 --type=LoadBalancer --port=8080</code></pre>\n\n<p>&nbsp;</p>","a":[{"id":1691551,"option":"1","correct":false},{"id":1691552,"option":"2","correct":false},{"id":1691553,"option":"3","correct":false},{"id":1691554,"option":"4","correct":true}]},{"q":"<p>You want to use <em>Kubernetes</em> on your personal computer. Which of the following tools can you use to run Kubernetes locally?</p>","a":[{"id":1691176,"option":"kind","correct":false},{"id":1691177,"option":"kube","correct":false},{"id":1691178,"option":"minikube","correct":true},{"id":1691179,"option":"kubeadm","correct":false}]},{"q":"<p>Your organization is&nbsp;using <em>Kubernetes </em>to manage and scale cloud-based work. Here, Statefulsets manages the deployment and scaling of a set of Pods. StatefulSet is the workload API object used to manage stateful applications.</p>\n\n<p>Which of the following statements are true with respect to StatefulSets in Kubernetes?</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>StatefulSets provides a guarantee&nbsp;on the termination of pods when a StatefulSet is deleted</li>\n\t<li>Deleting or scaling a StatefulSet down will&nbsp;delete the volumes associated with the StatefulSet</li>\n\t<li>StatefulSet manages Pods that are based on an identical container spec</li>\n\t<li>StatefulSet maintains a sticky identity for each of their Pods</li>\n</ol>","a":[{"id":1690370,"option":"1 and 2","correct":false},{"id":1690371,"option":"3 and 4","correct":true},{"id":1690372,"option":"2, 3 and 4","correct":false},{"id":1690373,"option":"1 , 2 and 4","correct":false}]},{"q":"<p>Your organization is using <em>Kubernetes</em> to manage its cloud activities. If you&nbsp;update a Deployment while an existing rollout is in progress then which of the following events&nbsp;will occur?</p>\n\n<p><strong>Events</strong></p>\n\n<ol>\n\t<li>The Deployment will create a new ReplicaSet as per the update</li>\n\t<li>The Deployment will scale down&nbsp;the new ReplicaSet</li>\n\t<li>The Deployment will scale up the new ReplicaSet</li>\n\t<li>The Deployment will roll&nbsp;over the&nbsp;previously scaling&nbsp;ReplicaSet</li>\n\t<li>The Deployment will scale up the old ReplicaSet</li>\n</ol>","a":[{"id":1690266,"option":"1 , 2 and 4","correct":false},{"id":1690267,"option":"3, 4 and 5","correct":false},{"id":1690268,"option":"2, 4 and 5","correct":false},{"id":1690269,"option":"1, 3 and 5","correct":true}]},{"q":"<p>Suppose your organization is using <em>Kubernetes</em> to manage cloud-based activities. You are having nodes in <em>2</em> different zones. In which order does the scheduler evaluate the feasibility of the nodes,&nbsp;if you have the&nbsp;nodes in the following&nbsp;zones?</p>\n\n<p><em><strong>Note:</strong> Kubernetes version - v1.14</em></p>\n\n<pre class=\"prettyprint\"><code>Zone 1: Node 1, Node 3, Node 4, Node 5\nZone 2: Node 2, Node 6</code></pre>","a":[{"id":1689691,"option":"Node 1, Node 3, Node 4, Node 5, Node 2, Node 6","correct":false},{"id":1689692,"option":"Node 1, Node 3, Node 2, Node 6, Node 4, Node 5","correct":false},{"id":1689693,"option":"Node 1, Node 2, Node 3, Node 6, Node 4, Node 5","correct":true},{"id":1689694,"option":"Node 2, Node 1, Node 6, Node 3, Node 4, Node 5","correct":false}]},{"q":"<p>You are working in an organization that is using <em>Kubernetes</em> to manage its cloud-based activities. Which of the following commands can you use to create a new service object to load balance traffic across Pods?</p>","a":[{"id":1689490,"option":"create","correct":false},{"id":1689491,"option":"run","correct":false},{"id":1689492,"option":"autoscale","correct":false},{"id":1689493,"option":"expose","correct":true}]},{"q":"<p>Alice is working in an organization that is using <em>Kubernetes</em> to manage its cloud activities. Which&nbsp;of the following situation applies&nbsp;if you do not specify a memory limit for a container?</p>","a":[{"id":1674446,"option":"The Container could use all of the memory available on the Node","correct":false},{"id":1674447,"option":"Cluster administrators can use a LimitRange to specify a default value for the memory limit","correct":false},{"id":1674448,"option":"A Container with no resource limits will have a lesser chance of being killed","correct":false},{"id":1674449,"option":"Both A and B","correct":true}]},{"q":"<p>Your organization is using Kubernetes to handle cloud activities. There are many&nbsp;teams working on different projects and they need to share a Kubernetes cluster. So using <em>namespaces</em>&nbsp;clusters can be organized into virtual sub-clusters which can be used by different teams for their respective projects. What are some of the functionalities of namespaces apart from this which make it useful for us?</p>\n\n<p><strong>Options</strong></p>\n\n<ol>\n\t<li>Namespaces help pod-to-pod communication using the same namespace</li>\n\t<li>Names of resources need to be unique within a namespace and also&nbsp;across namespaces</li>\n\t<li>Namespaces provide logical separation between the teams and their environments</li>\n\t<li>Namespaces are virtual clusters that can sit on top of the same physical cluster</li>\n</ol>","a":[{"id":1674442,"option":"1, 2, and 3","correct":false},{"id":1674443,"option":"2, 3, and 4","correct":false},{"id":1674444,"option":"1, 2, and 4","correct":false},{"id":1674445,"option":"1, 3, and 4","correct":true}]},{"q":"<p>Your organization wants to enhance its storage capacity and is using&nbsp;<em>Kubernetes</em> to manage its cloud infrastructure. Kubernetes keeps track of storage capacity and the scheduler uses that information to schedule Pods. In which of the following cases, storage capacity information is used by the Kubernetes scheduler?</p>\n\n<p><strong>Options</strong></p>\n\n<p>1. If the&nbsp;<code>CSIStorageCapacity</code>&nbsp;feature gate is false</p>\n\n<p>2. If a Pod uses a volume that has not been created yet</p>\n\n<p>3. If&nbsp;the&nbsp;<code>CSIDriver</code>&nbsp;object for the driver has&nbsp;<code>StorageCapacity</code>&nbsp;set to true</p>","a":[{"id":1670501,"option":"1 and 2","correct":false},{"id":1670502,"option":"1 and 3","correct":false},{"id":1670503,"option":"2 and 3","correct":true},{"id":1670504,"option":"1, 2 and 3","correct":false}]},{"q":"<p>Your organization wants to enhance its storage capacity and backup policies. This company uses Kubernetes to manage consistency and has&nbsp;Storage Classes. Which of the following does not come under&nbsp;StorageClass?</p>\n\n<p>&nbsp;</p>","a":[{"id":1670497,"option":"provisioner","correct":false},{"id":1670498,"option":"reclaimPolicy","correct":false},{"id":1670499,"option":"arguments","correct":true},{"id":1670500,"option":"parameters","correct":false}]},{"q":"<p>You are using <em>Kubernetes</em> for managing files in the&nbsp;Kubernetes container.&nbsp;The Kubernetes \"Volume&nbsp;abstraction\" handles the files when a container crashes and sharing files between containers.</p>\n\n<p>Which of the following commands should you write to use a volume, specify the volumes to provide for the Pod and declare where to mount those volumes into containers?</p>\n\n<p><strong>Options</strong></p>\n\n<p>&nbsp;1.&nbsp;</p>\n\n<pre class=\"prettyprint\"><code>.spec.volumes\n.spec.containers[\"all\"].volumeMounts</code></pre>\n\n<p>2.&nbsp;</p>\n\n<pre class=\"prettyprint\"><code>.spec.volume\n.spec.containers[\"*\"].volumeMount</code></pre>\n\n<p>3.&nbsp;</p>\n\n<pre class=\"prettyprint\"><code>.spec.volume\n.spec.containers[].volumeMount</code></pre>\n\n<p>4.&nbsp;</p>\n\n<pre class=\"prettyprint\"><code>.spec.volumes\n.spec.containers[*].volumeMounts</code></pre>","a":[{"id":1669915,"option":"1","correct":false},{"id":1669916,"option":"2","correct":false},{"id":1669917,"option":"3","correct":false},{"id":1669918,"option":"4","correct":true}]},{"q":"<p>You are using <em>Kubernetes</em> for managing files in the&nbsp;Kubernetes container.&nbsp;The Kubernetes \"Volume&nbsp;abstraction\" handles the files when a container crashes.&nbsp;</p>\n\n<p>Kubernetes supports many types of volumes. A Pod can use any number of volume types simultaneously.&nbsp;Which of the following is&nbsp;true when a pod ceases to exist?</p>\n\n<ol>\n\t<li>Kubernetes does not destroy persistent volumes</li>\n\t<li>Kubernetes&nbsp;destroys ephemeral volumes</li>\n\t<li>Kubernetes does not destroy ephemeral volumes</li>\n\t<li>For any kind of volume in a given pod, data is preserved across container restarts.</li>\n</ol>","a":[{"id":1669911,"option":"2 and 4","correct":false},{"id":1669912,"option":"3 and 4","correct":false},{"id":1669913,"option":"1, 2 and 4","correct":true},{"id":1669914,"option":"1, 3 and 4","correct":false}]},{"q":"<p>There is a company that has a highly distributed system with a huge variety of data clouds and multiple virtual machines. The company has started using Kubernetes to manage consistency in the work.&nbsp;</p>\n\n<p>Which&nbsp;are some of the problems faced by on-disk&nbsp;for&nbsp;applications when running in containers?</p>\n\n<ol>\n\t<li>Files are lost when the container crash.</li>\n\t<li>A \"Pod\" uses any number of volume types simultaneously</li>\n\t<li>Sharing files between containers running together in a \"Pod\"</li>\n</ol>\n\n<p>&nbsp;</p>","a":[{"id":1668827,"option":"1 and 2","correct":false},{"id":1668828,"option":"2 and 3","correct":false},{"id":1668829,"option":"1 and 3","correct":true},{"id":1668830,"option":"1 , 2 and 3","correct":false}]},{"q":"<p>An&nbsp;organization is working on cloud infrastructure using <em>Kubernetes</em><strong> </strong>to reduce cost and increase&nbsp;competency.&nbsp;Every node in a Kubernetes cluster runs a<strong> </strong><em>kube-proxy</em> for implementing a form of virtual IP for Services. Which of the following data structure is used by the \"IPVS proxy mode\" as the underlying data structure which&nbsp;works in the kernel space?</p>","a":[{"id":1668263,"option":"Dynamic Arrays","correct":false},{"id":1668264,"option":"Linked List","correct":false},{"id":1668265,"option":"Hash Table","correct":true},{"id":1668266,"option":"Stack","correct":false}]},{"q":"<p>Alice is working in an&nbsp;organization, which is working with cloud infrastructure using <em>Kubernetes</em><strong> </strong>to reduce cost and work. She is taking care of networking in Kubernetes. Which of the following concern is not handled by Kubernetes Networking?</p>\n\n<p>&nbsp;</p>","a":[{"id":1668259,"option":"Containers within a Pod use networking to communicate via loopback","correct":false},{"id":1668260,"option":"The Service resource lets you expose an application running in Pods to be reachable from inside your cluster","correct":true},{"id":1668261,"option":"Cluster networking provides communication between different Pods","correct":false},{"id":1668262,"option":"You can also use Services to publish services only for consumption inside your cluster","correct":false}]},{"q":"<p>An organization is managing its cloud activities using<strong> </strong><em>Kubernetes</em>. Many of the resources like failed or completed pods, objects without owner references and unused containers need cleaning. Kubernetes has various mechanisms for<em><strong> Garbage Collection</strong></em> to clean up cluster resources.</p>\n\n<p>If&nbsp;in&nbsp;v1.20+&nbsp;the garbage collector detects an invalid cross-namespace \"ownerReference\"&nbsp; then which of the following&nbsp;warning event with a reason and an&nbsp;invalid dependent is reported?</p>","a":[{"id":1665610,"option":"OwnerInvalidNamespace and involvedObj","correct":false},{"id":1665611,"option":"InvalidNamespace and involvedObj","correct":false},{"id":1665612,"option":"OwnerReferenceInvalidNamespace and involvedObj","correct":false},{"id":1665613,"option":"OwnerRefInvalidNamespace and involvedObject","correct":true}]},{"q":"<p>There is an&nbsp;MNC that wants to adopt cloud infrastructure to manage their workload in a cost-effective and consistent way. The cloud infrastructure technologies let you run <em>Kubernetes</em> on public, private, and hybrid clouds. The Kubernetes <em>cloud controller manager</em> lets you link your cluster into your cloud provider's API.</p>\n\n<p>Which of the following&nbsp;access&nbsp;the service controller inside the cloud controller managers require on various API objects?</p>\n\n<ol>\n\t<li>Get</li>\n\t<li>Create</li>\n\t<li>Update</li>\n\t<li>Patch</li>\n\t<li>Delete</li>\n</ol>","a":[{"id":1665606,"option":"1, 2 and 3","correct":false},{"id":1665607,"option":"1, 3 and 4","correct":true},{"id":1665608,"option":"1, 2, 3 and 4","correct":false},{"id":1665609,"option":"1, 2, 3, 4 and 5","correct":false}]},{"q":"<p>A company is planning to increase its&nbsp;competence and efficiency by performing work with minimum cost by making use of methodology like Devops, so they decided to work with <em>Kubernetes </em>to get their jobs done at a low cost and&nbsp;save much time of deployment. But&nbsp;there are some things which Kubernetes is not. Which of the following are those?</p>\n\n<p><strong>Options</strong></p>\n\n<ol>\n\t<li>Kubernetes aims to support stateless and stateful workloads.</li>\n\t<li>Kubernetes provide application-level services, such as middleware, data-processing frameworks, databases, caches, and cluster storage systems as built-in services.</li>\n\t<li>Kubernetes allows you to automatically mount a storage system of your choice.</li>\n\t<li>Kubernetes restarts containers that fail, replaces containers, kills containers that don't respond to your user-defined health check, and doesn't advertise them to clients until they are ready to serve.</li>\n</ol>","a":[{"id":1664134,"option":"1","correct":false},{"id":1664135,"option":"2","correct":true},{"id":1664136,"option":"3","correct":false},{"id":1664137,"option":"4","correct":false}]},{"q":"<p>There is a company that has a highly distributed system with a huge variety of data clouds and multiple virtual machines. The company has started using Kubernetes to manage consistency in the work. You have several nodes in the Kubernetes Cluster. How can you have nodes added to API Server?</p>\n\n<ol>\n\t<li>The kubelet on a node self-registers to the control plane</li>\n\t<li>The user manually add a Node object</li>\n</ol>","a":[{"id":1664032,"option":"1","correct":false},{"id":1664033,"option":"2","correct":false},{"id":1664034,"option":"Either 1 or 2","correct":true},{"id":1664035,"option":"None of these","correct":false}]},{"q":"<p>A company is using <em>Kubernetes</em> to provide&nbsp;improved scalability and availability to its applications. Which of the following Kubernetes <em>Node Components</em>&nbsp;maintains network rules on nodes which&nbsp;allows network communication to&nbsp;Pods from network sessions inside or outside of the cluster?</p>","a":[{"id":1662645,"option":"kubelet","correct":false},{"id":1662646,"option":"etcd","correct":false},{"id":1662647,"option":"kube-proxy","correct":true},{"id":1662648,"option":"Container runtime","correct":false}]},{"q":"<p>A company wants&nbsp;IT teams to more efficiently manage large applications across many containers by handling many of the nitty-gritty details of maintaining container-based apps. As a solution, they came up with <em>Kubernetes control plane components</em>.</p>\n\n<p>Which of the following Control Plane Component allows you to combines several logically independent control loops into a single binary that you run as a single process?</p>","a":[{"id":1662641,"option":"kube-apiserver","correct":false},{"id":1662642,"option":"kube-scheduler","correct":false},{"id":1662643,"option":"kubelet","correct":false},{"id":1662644,"option":"cloud-controller-manager","correct":true}]},{"q":"<p>An organization is using the Kubernetes&nbsp;system for deploying applications and more efficiently utilizing the containerized infrastructure that powers the apps. It makes apps more resilient and performant.</p>\n\n<p>Which of the following is/are not true about Kubernetes?</p>\n\n<ol>\n\t<li>Kubernetes is&nbsp;monolithic</li>\n\t<li>Kubernetes is an all-inclusive PaaS (Platform as a Service) system</li>\n\t<li>Kubernetes does not deploy source code and does not build your application</li>\n</ol>","a":[{"id":1662010,"option":"1 and 3","correct":false},{"id":1662011,"option":"2 and 3","correct":false},{"id":1662012,"option":"1 and 2","correct":true},{"id":1662013,"option":"All of the above","correct":false}]},{"q":"<p>Earlier organizations used to run applications on physical servers.&nbsp;There was no way to define resource boundaries for applications in a physical server, and this caused resource allocation issues. As a solution to these, Virtual machines (VMs) and Containers were introduced for&nbsp;better utilization of resources in a physical server.&nbsp;</p>\n\n<p>Which of the following are correct&nbsp;differences between Virtual machines and Containers?</p>\n\n<p><strong>Differences</strong></p>\n\n<ol>\n\t<li>Virtual machines have their own Operating system whereas containers&nbsp;share the Operating system&nbsp;among the applications</li>\n\t<li>Virtual machines have their own filesystem&nbsp;whereas a Container has a shared filesystem</li>\n\t<li>Virtual machines have their own share of CPU and memory&nbsp;whereas a container has a shared memory</li>\n\t<li>Virtual machines&nbsp;size is very large whereas containers are considered lightweight</li>\n\t<li>Virtual machines use a lot of system memory whereas containers require very less memory</li>\n</ol>","a":[{"id":1661431,"option":"2, 3 and 4","correct":false},{"id":1661432,"option":"2, 3 and 5","correct":false},{"id":1661433,"option":"1 , 4 and 5","correct":true},{"id":1661434,"option":"1, 2, 3 and 5","correct":false}]},{"q":"<p>You are working on Kubernetes and have processed to run a stateless application. You have created a deployment based on the YAML file. Now, you want to look at the display information about the deployment. Which of the following can be used to display the information?</p>","a":[{"id":1662857,"option":"kubectl get deployment nginx-deployment","correct":false},{"id":1662858,"option":"kubectl describe deployment nginx-deployment","correct":true},{"id":1662859,"option":"kubectl describe deployment yaml-deployment","correct":false},{"id":1662860,"option":"kubectl get deployment yaml-deployment","correct":false}]},{"q":"<p>X is developing a football score app in docker. He/she wants to see the layers that make up the image for a particular file. Which of the following docker command can be used to see the layers of the required image?</p>","a":[{"id":1662853,"option":"docker image history football","correct":true},{"id":1662854,"option":"docker image module football","correct":false},{"id":1662855,"option":"docker image layer football","correct":false},{"id":1662856,"option":"docker image notrunc football","correct":false}]},{"q":"<p>You are forwarding inbound traffic to backends in an application developed with Kubernetes using proxying. You decide to switch to other methods. You then configured DNS records to have multiple A values and applied round-robin name resolution. What is the issue associated with this particular approach?</p>","a":[{"id":1662741,"option":"DNS implementations give high priority to record TTLs and hence, round robin cannot be used.","correct":false},{"id":1662742,"option":"Some apps cache the data multiple times and could interrupt round robin name resolution.","correct":false},{"id":1662743,"option":"DNS records could impose a high load on DNS.","correct":true},{"id":1662744,"option":"There is no issue. Both round robin and proxying can be used.","correct":false}]},{"q":"<p>You are looking forward to assign memory resources to containers and pods. You have created a namespace as example_pod and also a pod as example_pod. You have also verified if the container is running or not. Which of the following ways can be used to view detailed information about example_pod?</p>\n\n<p><strong>Options</strong></p>\n\n<p><strong>1.</strong></p>\n\n<p>Passing the namespace and output to kubectl get pod, along with the pod</p>\n\n<p><strong>2.</strong></p>\n\n<p>Passing the namespace and output to kubectl describe, along with the pod</p>\n\n<p><strong>3.</strong></p>\n\n<p>Creating a container using the given resources and using the info command</p>\n\n<p><strong>4.</strong></p>\n\n<p>Using info-pod command to view detailed information</p>","a":[{"id":1662725,"option":"1","correct":true},{"id":1662726,"option":"2","correct":false},{"id":1662727,"option":"3","correct":false},{"id":1662728,"option":"4","correct":false}]},{"q":"<p>You are creating a cluster in Kubernetes. You use 1000 nodes under the cluster and each cluster has 150 nodes. But for some reasons, you could not create the cluster, successfully. What could be the potential reason for an unsuccessful result in such a case?</p>","a":[{"id":1662721,"option":"One cannot have more than 500 nodes in a cluster.","correct":false},{"id":1662722,"option":"Pods contains nodes and not vice versa.","correct":false},{"id":1662723,"option":"There should be no more than 1000 containers in total.","correct":false},{"id":1662724,"option":"One cannot have more than 110 pods in a node.","correct":true}]},{"q":"<p>You are working on Kubernetes and are trying to use kubectl exec command. You are required to replace some long options with short ones to have a concise code. Which of the following options will help in writing concise codes?</p>","a":[{"id":1662713,"option":"Using --si in the place of --stdin","correct":false},{"id":1662714,"option":"Using --i instead of the longer option --stdin","correct":true},{"id":1662715,"option":"Using --y instead of --tty","correct":false},{"id":1662716,"option":"Using --so instead of the longer option -stdout","correct":false}]},{"q":"<p>You are working on deploying an app in Kubernetes. You are required to provide service inside a cluster without any external access. Which of the following services is useful in the mentioned scenario?</p>","a":[{"id":1662709,"option":"Using Cluster IP service inside the clusters","correct":true},{"id":1662710,"option":"Making use of NodePort service within clusters","correct":false},{"id":1662711,"option":"Using LoadBalancer service between the clusters","correct":false},{"id":1662712,"option":"Using Internal service inside the clusters","correct":false}]},{"q":"<p>You are working on an app in Kubernetes. You are defining a service and posting it to the API server to create a new instance. By mistake, you have created the service without any selectors. Which of the following steps should be done to rectify any erroneous situation that would arise because of this?</p>\n\n<p><strong>Options</strong></p>\n\n<p><strong>1.</strong></p>\n\n<pre class=\"prettyprint\"><code>Create multi ports:\nkind: Serviceports\nmetadata:\nname: my-service\nspec:\nports:\n- name: http\nprotocol: TCP\nport: 80\ntargetPort: 9376\n- name: https\nprotocol: TCP\nport: 443\ntargetPort: 9377</code></pre>\n\n<p><strong>2.</strong></p>\n\n<pre class=\"prettyprint\"><code>Add endpoints manually:\napiVersion: v1\nkind: Endpoints\nmetadata:\nname: my-service\nsubsets:\n- addresses:\n- ip: 192.0.2.42\nports:\n- port: 9376</code></pre>\n\n<p><strong>3.</strong></p>\n\n<pre class=\"prettyprint\"><code>Add environment variables with the help of redis master: \nREDIS_MASTER_SERVICE_HOST=10.0.0.11\nREDIS_MASTER_SERVICE_PORT=6379\nREDIS_MASTER_PORT=tcp://10.0.0.11:6379\nREDIS_MASTER_PORT_6379_TCP=tcp://10.0.0.11:6379\nREDIS_MASTER_PORT_6379_TCP_PROTO=tcp\nREDIS_MASTER_PORT_6379_TCP_PORT=6379\nREDIS_MASTER_PORT_6379_TCP_ADDR=10.0.0.11</code></pre>\n\n<p><strong>4.</strong></p>\n\n<p>There would be no error as the missing error would be defaulted by the system.</p>","a":[{"id":1662865,"option":"1","correct":false},{"id":1662866,"option":"2","correct":true},{"id":1662867,"option":"3","correct":false},{"id":1662868,"option":"4","correct":false}]},{"q":"<p>You are working on an app in Kubernetes. You are working with Kubectl. You have created many services. You wish to see the name of the replication controller. Which of the following commands is used to view the replication controller name?</p>","a":[{"id":1662861,"option":"Kubectl get rc","correct":false},{"id":1662862,"option":"Kubectl get rcname","correct":false},{"id":1662863,"option":"Kubectl describe rcname","correct":false},{"id":1662864,"option":"Kubectl describe rc","correct":true}]},{"q":"<p>You are looking to configuring a pod to use a PersistentVolume for storage. You have created a persistent volume for the nodes in the cluster. You, then proceed to create a pod for storing. The output showed an error. Identify the potential reason.</p>","a":[{"id":1662737,"option":"Persistent volume requires the presence of a pre existing pod.","correct":false},{"id":1662738,"option":"Persistent Volume storage can be used in a cluster with only one node.","correct":true},{"id":1662739,"option":"The storage has to be initiated for each and every node.","correct":false},{"id":1662740,"option":"hostPath has to be initiated before creating pod.","correct":false}]},{"q":"<p>X is working on Kubernetes. X is required to specify a CPU request for a container. X is looking to configure the file by establishing a CPU limit. Which of the following should you use to specify the same?</p>\n\n<p><strong>Options</strong></p>\n\n<p><strong>1.</strong></p>\n\n<p>Using args command to provide the limit as an argument to the container</p>\n\n<p><strong>2.</strong></p>\n\n<p>Specifying memory: limits in the container's resource manifest</p>\n\n<p><strong>3.</strong></p>\n\n<p>Requesting memory limit by using resources:requests</p>\n\n<p><strong>4.</strong></p>\n\n<p>Including resources:limits in the container's resource manifest</p>","a":[{"id":1662733,"option":"1","correct":false},{"id":1662734,"option":"2","correct":false},{"id":1662735,"option":"3","correct":false},{"id":1662736,"option":"4","correct":true}]},{"q":"<p>You are creating an object in Kubernetes for the application you are developing. You want to modify the objects before creating them. Which of the following ways can you use to modify?</p>","a":[{"id":1662729,"option":"Using a combination of set and create command","correct":true},{"id":1662730,"option":"Using patch command for directly modifying contents","correct":false},{"id":1662731,"option":"Creating new labels to modify the content","correct":false},{"id":1662732,"option":"Creating and using logs to modify the content, accordingly","correct":false}]},{"q":"<p>You are working with Kubernetes on an application. You need to create a task that runs repeatedly as per a specific schedule. Which of the following resources can be used to recur a task?</p>","a":[{"id":1662717,"option":"Using Job for recurring tasks","correct":false},{"id":1662718,"option":"Making use of DaemonSet to schedule runs","correct":false},{"id":1662719,"option":"Setting up Cronjobs to recur a task","correct":true},{"id":1662720,"option":"Setting up Deployment for recurring tasks","correct":false}]},{"q":"<p>In Azure DevOps, if you are required to implement a continuous orchestration process by using the Kubernetes container-orchestration system, then which of the following orchestration services is used to upgrade your Kubernetes cluster?</p>","a":[{"id":1161875,"option":"Azure Container Registry (ACR)","correct":false},{"id":1161876,"option":"Azure Kubernetes Services (AKS)","correct":true},{"id":1161877,"option":"Azure Kubernetes Orchestrator (AKO)","correct":false},{"id":1161878,"option":"None of these","correct":false}]},{"q":"<p>Which of the following statements about installing the Kubernetes system on an Ubuntu machine is correct:</p>\n\n<ol>\n\t<li>It is important to set up the virtual data center before setting up the Kubernetes system.</li>\n\t<li>In the absence of a physical or cloud infrastructure, it is important to set up the virtual data center on ProfitBricks.</li>\n\t<li>It is important to configure the master and node machines after the IaaS is successfully setup on a cloud.</li>\n</ol>","a":[{"id":570674,"option":"1 and 2","correct":false},{"id":570675,"option":"1 and 3","correct":false},{"id":570676,"option":"All of these","correct":false},{"id":570677,"option":"None of these","correct":true}]},{"q":"<p>Which of the following applications are managed by the Kubernetes system?</p>","a":[{"id":570526,"option":"Virtual machines ","correct":false},{"id":570527,"option":"Application dependencies","correct":false},{"id":570528,"option":"Containers","correct":true},{"id":570529,"option":"All of these","correct":false}]},{"q":"<p>Which of the following statements about the Kubernetes system is correct:</p>\n\n<ol>\n\t<li>It is a loosely-coupled infrastructure where each component acts as a separate unit.</li>\n\t<li>It has a higher density of resource utilization.</li>\n\t<li>It is used for the development of products but does not support the integration and deployment of the same.</li>\n</ol>","a":[{"id":570530,"option":"1 and 2","correct":true},{"id":570531,"option":"1 and 3","correct":false},{"id":570532,"option":"All of these","correct":false},{"id":570533,"option":"None of these","correct":false}]},{"q":"<p>In Kubernetes, which of the following statements correctly explains the client-server architecture:</p>\n\n<ol>\n\t<li>The master and node are installed on the same machine.</li>\n\t<li>The master is installed on one machine and the node is installed on a different Linux machine.</li>\n\t<li>The master and node are installed on different Linux machines.</li>\n</ol>","a":[{"id":570538,"option":"2","correct":true},{"id":570539,"option":"1,3","correct":false},{"id":570540,"option":"1,2,3","correct":false},{"id":570541,"option":"None of these","correct":false}]},{"q":"<p>In Kubernetes, which of the following is a component of the master machine?</p>","a":[{"id":570542,"option":"etcd","correct":false},{"id":570543,"option":"API server","correct":false},{"id":570544,"option":"Scheduler","correct":false},{"id":570545,"option":"All of these","correct":true}]},{"q":"<p>In Kubernetes, which of the following Command Line Tools is used to create, update, and delete an API object?</p>","a":[{"id":570686,"option":"Kubectl","correct":true},{"id":570687,"option":"Kubeadm","correct":false},{"id":570688,"option":"Kubefed","correct":false},{"id":570689,"option":"None of these","correct":false}]}]