[{"q":"In HTML5, you are working on multimedia attributes. Which of the following statements about the format of the Ogg file are correct:<br>&nbsp;&nbsp;&nbsp;&nbsp;1. Every page of data begins with characters ‘OggC’ to identify the file as the Ogg format.<br>&nbsp;&nbsp;&nbsp;&nbsp;2. The page number in the page header identifies each page as a part of a series of pages that are creating a bitstream sequence. The sequence number is used to identify the sequence of the video or the audio format that is embedded in the source file.<br>&nbsp;&nbsp;&nbsp;&nbsp;3. Multiple bitstream sequences are combined as a single bitstream sequence in the file where pages from each bitstream are arranged by the seek time of the contained data.<br>&nbsp;&nbsp;&nbsp;&nbsp;4. Bitstreams are appended to existing files so that the bitstreams can be decoded sequentially.","a":[{"id":1149885,"option":" 1 and 2","correct":false},{"id":1149886,"option":" 2 and 3","correct":false},{"id":1149887,"option":" 3 and 4","correct":true},{"id":1149888,"option":" 1 and 4","correct":false}]},{"q":"In HTML5, you are working on multimedia attributes. You have requested a media response to your web server. The web server sends an HTTP response that indicates an error that can occur while configuring this request. If you are required to configure the server for the media type so that you can add the Ogg video format files, then which of the following configuration syntax must be used to perform this task?","a":[{"id":1149889,"option":"configure video/ogg .ogv ","correct":false},{"id":1149890,"option":"configure video/ogg .ogv .ogg","correct":false},{"id":1149891,"option":"AddType video/ogg .ogv","correct":false},{"id":1149892,"option":"AddType video/ogg .ogv .ogg","correct":true}]},{"q":"In HTML5, you are working on multimedia attributes. If you are playing a video ‘hackhtml5.mp4” of a path “/hackerearth/html5/multimedia/hackhtml5.mp4’, then which of the following JavaScript events is generated when the playback speed of the video is increased by three times the original playback speed?","a":[{"id":1149881,"option":" rateplayback","correct":false},{"id":1149882,"option":" rateplay","correct":false},{"id":1149883,"option":" ratechange","correct":true},{"id":1149884,"option":" rateraise","correct":false}]},{"q":"In HTML5, you are working on multimedia attributes. If you are required to identify the media source file in your HTML5 script, then which of the following attributes must be used to perform this task?","a":[{"id":1149929,"option":"href","correct":false},{"id":1149930,"option":"file","correct":false},{"id":1149931,"option":"src","correct":true},{"id":1149932,"option":"controls","correct":false}]}]