[{"q":"<p>In a test organized by NTA, questions were asked in various sections. Out of the total students, 5% of students cleared the cut-off in all the sections and 5% cleared none. Of the rest, 25% cleared only one section and 20% cleared four sections. If 24.5% of the entire candidates cleared two sections and 300 candidates cleared three sections, determine how many candidates appeared for the test?</p>","a":[{"id":1766894,"option":"1000","correct":false},{"id":1766895,"option":"1200","correct":true},{"id":1766896,"option":"1500","correct":false},{"id":1766897,"option":"2000","correct":false}]},{"q":"<p>Alice is a hackster. She is assigned three tasks for which time allotted is in the ratio of 5:4:2 (jobs are needed to be done individually). But due to some technical snag, 10% of the time allotted for each job gets wasted. Thereafter, owing to the lack of interest, invests only 40%, 30%, and 20% of the hours of what was actually allotted to do the three jobs individually. Determine how much percentage of the total time allotted is the time invested by Alice?</p>","a":[{"id":1766590,"option":"38.33%","correct":false},{"id":1766591,"option":"39.4545%","correct":false},{"id":1766592,"option":"32.72%","correct":true},{"id":1766593,"option":"36.66%","correct":false}]},{"q":"<p>The cost of automobiles has risen up by 15%, labor cost has also increased from 25% of the cost of automobiles to 30% of the cost of automobiles. By how much percentage should there be a reduction in the usage of automobiles so as to keep the cost same?</p>","a":[{"id":1766586,"option":"17%","correct":true},{"id":1766587,"option":"24%","correct":false},{"id":1766588,"option":"25%","correct":false},{"id":1766589,"option":"28%","correct":false}]},{"q":"<p>A candy store sells chocolates. If the store sells 60% of chocholates and still has 760 chocolates. Then calculate the number of chocolates the store had in the beginning?</p>","a":[{"id":1754303,"option":"1900","correct":true},{"id":1754304,"option":"1600","correct":false},{"id":1754305,"option":"2000","correct":false},{"id":1754306,"option":"2100","correct":false}]},{"q":"<p>Alice score 60 marks and Mark scored 75 marks. Calculate how much percent of Alice's mark is Mark's mark?</p>","a":[{"id":1754299,"option":"125","correct":true},{"id":1754300,"option":"75","correct":false},{"id":1754301,"option":"95","correct":false},{"id":1754302,"option":"60","correct":false}]},{"q":"<p>If Alice's and Bob’s monthly salaries together amount to 18,000 dollars and if Alice spends 65% of her salary and Bob spends 30% of his. After expenditure, if their savings are the same, then calculate Alice’s salary?</p>","a":[{"id":1754291,"option":"13600","correct":false},{"id":1754292,"option":"14400","correct":true},{"id":1754293,"option":"15000","correct":false},{"id":1754294,"option":"15400","correct":false}]},{"q":"<p>If 65% of a number is more than 35% of 1850 by 660, then determine the number?</p>","a":[{"id":1754287,"option":"2011.5","correct":true},{"id":1754288,"option":"2012","correct":false},{"id":1754289,"option":"2001.5","correct":false},{"id":1754290,"option":"2002","correct":false}]},{"q":"<p>John took a random number and subtracted 33 from 75% of that number. If the result was 87 then find the number chosen by John?</p>","a":[{"id":1754139,"option":"150","correct":false},{"id":1754140,"option":"160","correct":true},{"id":1754141,"option":"180","correct":false},{"id":1754142,"option":"200","correct":false}]},{"q":"<p>To clear a class test, John must score 40% marks. If John gets 90 marks and fails by 55 marks, then what is the total marks of the class test?</p>","a":[{"id":1754045,"option":"360","correct":false},{"id":1754046,"option":"362","correct":true},{"id":1754047,"option":"350","correct":false},{"id":1754048,"option":"400","correct":false}]},{"q":"<p>A school has two alarms <em>A</em> and <em>B</em>. Alarm A rings once every two hours and alarm B rings once every four hours.<br>\n<br>\nDetermine the percentage by which the number of times A would ring in 24 hours is greater than the number of times alarm B would ring in that same period?</p>","a":[{"id":1401202,"option":"100%","correct":true},{"id":1401203,"option":"120%","correct":false},{"id":1401204,"option":"150%","correct":false},{"id":1401205,"option":"110%","correct":false}]},{"q":"<p>Julian went to the market and bought fish worth Rs. <em>30</em> out of which <em>50</em> paise were spent as sales tax. What is the cost of tax-free items if the tax rate is <em>5%</em>?<br>\n<em>Note</em>: Choose the option that coincides with the nearest integer.</p>","a":[{"id":1401306,"option":"Rs. 20","correct":true},{"id":1401307,"option":"Rs. 50","correct":false},{"id":1401308,"option":"Rs. 30","correct":false},{"id":1401309,"option":"Rs. 25","correct":false}]},{"q":"<p>Bob has allocated a budget <em>x</em> for painting his shop. However, the price of paint increases by <em>45%</em>. If Bob decides to spend an additional <em>30%</em> of <em>x</em> for buying paint then by what percentage will the quantity of paint purchased be reduced?</p>","a":[{"id":1401310,"option":"15.66 %","correct":false},{"id":1401311,"option":"10.34 %","correct":true},{"id":1401312,"option":"0.1233","correct":false},{"id":1401313,"option":"14.34 %","correct":false}]},{"q":"<p>A library has a collection of books out of which 55% of books are more than 50 years old and 60% of books are less than or equal to 70 years old. Also, 40% of the total collection of books in the library is mostly fictional novels.<br>\nIf 40% of the books that are more than 70 years old are fictional novels then, what percentage of fictional novels are less than or equal to 70 years?</p>","a":[{"id":1401002,"option":"58 %","correct":false},{"id":1401003,"option":"56 %","correct":false},{"id":1401004,"option":"60 %","correct":true},{"id":1401005,"option":"54 %","correct":false}]},{"q":"<p>In a factory packing red and green apples, 6% of the apples were found to be defective. Also, 90% of the non-defective apples were red apples. If 4700 non-defective apples were all green, then how many apples in total were packed in the factory?</p>","a":[{"id":1400997,"option":"1,06,300","correct":false},{"id":1400998,"option":"1,00,000","correct":true},{"id":1400999,"option":"60300","correct":false},{"id":1401000,"option":"1,60,300","correct":false}]},{"q":"<p>You are baking a cake using rare ingredients <em>A, B,</em> and <em>C</em>. Assume that you put <em>45%</em> of<em> A</em> in the cake. Additionally, you put B as <em>1/3</em> of the amount of ingredient <em>C</em> while baking the cake. If the amount of <em>C</em> used to bake the cake is <em>8</em> Tablespoons (Tbsp), then how many Tbsp of ingredients were put in the cake?<br>\n<em>Note</em>: Assume that no other ingredients apart from <em>A, B</em> and <em>C</em> were used in baking the cake and choose the option that coincides with the nearest integer.</p>","a":[{"id":1401302,"option":"16 Tbsp","correct":false},{"id":1401303,"option":"17 Tbsp","correct":false},{"id":1401304,"option":"19 Tbsp","correct":true},{"id":1401305,"option":"15 Tbsp","correct":false}]},{"q":"<p>A newspaper hawker selling newspapers and magazines gets <em>7% </em>commission on all sales up to Rs. <em>8,000</em>. Additionally, for all sales above Rs. <em>8000</em>, he gets<em> 5% </em>commission.<br>\nIf the total sales amount after deducting his commission is Rs. <em>30,000</em>, then what is the total sales made by him?</p>","a":[{"id":1400992,"option":"Rs. 40,748","correct":false},{"id":1400993,"option":"Rs. 32,748","correct":false},{"id":1400994,"option":"Rs. 30,748","correct":false},{"id":1400995,"option":"Rs. 31,748","correct":true}]}]