[{"q":"<p>You are asked to use two pipes A and B to fill a tank that has another pipe C at the bottom of it. Given that pipes A and B can fill the tank in <em>15</em> and <em>20</em> minutes, respectively and pipe C can empty <em>5</em> gallons per minute from the tank.<br>\nIn the given context, what is the capacity of the tank if all three pipes working together can fill the tank in <em>10</em> minutes?</p>","a":[{"id":1401062,"option":"300 gallons","correct":true},{"id":1401063,"option":"400 gallons ","correct":false},{"id":1401064,"option":"450 gallons","correct":false},{"id":1401065,"option":"350 gallons ","correct":false}]},{"q":"<p>You have two pipes <em>P1</em> and <em>P2</em> that can fill a large bucket in <em>4</em> hours and <em>2</em> hours, respectively. Also, assume that you open the pipes at alternate hours.<br>\nIn the given context, how many hours will it take to fill the bucket if you open <em>P1</em> first?<br>\n<em>Note</em>: Select the accurate time in hours and minutes.</p>","a":[{"id":1401072,"option":"3 hours 00 minutes","correct":true},{"id":1401073,"option":"3 hours 30 minutes ","correct":false},{"id":1401074,"option":"4 hours 00 minutes","correct":false},{"id":1401075,"option":"3 hours 15 minutes","correct":false}]},{"q":"<p>You have three pipes P1, P2, and P3 that fill a tank completely in 5 hours, 10 hours, and 15 hours, respectively. You open P1, P2, and P3 for 2 hours each in sequence.</p>\n\n<p>Approximately, how many hours will P1 take to fill the tank completely?</p>","a":[{"id":1401077,"option":"6 hours 10 minutes","correct":false},{"id":1401078,"option":"6 hours 20 minutes","correct":false},{"id":1401079,"option":"7 hours 20 minutes","correct":true},{"id":1401080,"option":"6 hours 30 minutes","correct":false}]},{"q":"<p>A large concrete bed is filled using five small pipes and two large pipes. Each of the five small pipes works at <em>2/5</em> the rate of the large pipe. If all the <em>7</em> pipes are opened at the same time, they should fill the entire bed in what fraction of time that it would have taken the large pipe alone?</p>","a":[{"id":1401298,"option":"1/4","correct":true},{"id":1401299,"option":"1/3","correct":false},{"id":1401300,"option":"2/3","correct":false},{"id":1401301,"option":"3/4","correct":false}]},{"q":"<p>Bob is using two taps <em>A</em> and <em>B</em> to fill a tank in <em>12</em> hours and <em>15</em> hours, respectively. He opens both the taps and observes that it took him <em>20</em> minutes more to fill the tank due to some leakage.<br>\nHow long will the leakage take to empty a full tank in the given scenario?<br>\n<em>Note</em>: Select the accurate time in hours and minutes.</p>","a":[{"id":1401067,"option":"53 hours 12 minutes ","correct":true},{"id":1401068,"option":"54 hours 00 minutes","correct":false},{"id":1401069,"option":"55 hours 00 minutes","correct":false},{"id":1401070,"option":"52 hours 12 minutes","correct":false}]},{"q":"<p>There are <em>16</em> pipes that are connected to a tank. Some of them are used to fill the tank and the others are used to drain the tank. Each of the fill pipes can fill the tank in 12 hours and each of the drain pipes can drain the tank completely in 8 hours.<br>\nIf all the pipes and drain pipes are kept open, an empty tank gets filled in 12 hours. Determine the count of fill pipes out of all the 16 pipes?</p>","a":[{"id":1401242,"option":"11","correct":false},{"id":1401243,"option":"12","correct":false},{"id":1401244,"option":"13","correct":false},{"id":1401245,"option":"10","correct":true}]}]