[{"q":"<p>Bob buys 30 beds for Rs. 4725. Of these, 8 are double-beds and the rest are single-beds. At what price must he sell the double beds so that if he sells the single beds at 3/4th of this price, he makes a profit of 40% on his outlay?</p>","a":[{"id":1757723,"option":"Rs. 180","correct":false},{"id":1757724,"option":"Rs. 270","correct":true},{"id":1757725,"option":"Rs. 360","correct":false},{"id":1757726,"option":"Rs. 450","correct":false}]},{"q":"<p>Alice loves to make different types of mocktails. She decided to make a new mocktail by mixing two types of drinks in the ratio 2:3. She started selling the mocktail at the rate of Rs 22 per liter. She made a profit of 10% by selling 2 quantities. If the cost of the smaller quantity is Rs 14 per liter, then what will be the cost per liter of the larger quantity?</p>","a":[{"id":1765048,"option":"Rs. 23","correct":false},{"id":1765049,"option":"Rs. 24","correct":true},{"id":1765050,"option":"Rs. 25","correct":false},{"id":1765051,"option":"Rs. 26","correct":false}]},{"q":"<p>Alice is very fond of vintage vehicles. She bought four vintage vehicles for a total of Rs.1 lakh. She spent a total 2 lakh in the overhead maintenance of these four vehicles. What is the sale price of the rest three vehicles to get 50% total gain if she has already sold one of the four vehicles at Rs.1.2 lakh?</p>","a":[{"id":1765056,"option":"Rs. 1.1 lakh","correct":true},{"id":1765057,"option":"Rs. 1.2 lakh","correct":false},{"id":1765058,"option":"Rs. 1.5 lakh","correct":false},{"id":1765059,"option":"Rs. 1.65 lakh","correct":false}]},{"q":"<p>Alice sells to Bob goods at five-thirds the rate of profit at which Bob has decided to sell it to Mike. Mike, on other hand, sells it to Ben at one-third the rate of profit at which Bob sold it to Mike. If Ben gives Rs.2145 to Mike at 10% profit, how much did Alice buy it for?</p>","a":[{"id":1765389,"option":"Rs.1000","correct":true},{"id":1765390,"option":"Rs. 2000","correct":false},{"id":1765391,"option":"Rs. 1500","correct":false},{"id":1765392,"option":"Rs. 1800","correct":false}]},{"q":"<p>Bob buys pencils from the stationery at wholesale prices and sells them at his shop at retail prices. He operates his shop 30 days a month, as a rule. He buys in multiples of 100 pencils and sells them in multiples of a dozen pencils. He purchases apsara for Rs. 425 per hundred and sells at Rs. 65per dozen, he buys Natraj at Rs. 150 per hundred and sells at Rs. 30 per dozen, he buys Camlin&nbsp;at Rs. 1800 per hundred and sells at Rs. 360 per dozen. Which of the three pencil brands yield him the maximum percentage profit?</p>","a":[{"id":1757739,"option":"Apsara","correct":false},{"id":1757740,"option":"Natraj","correct":false},{"id":1757741,"option":"Camlin","correct":false},{"id":1757742,"option":"Both b and c","correct":true}]},{"q":"<p>If Alice's taxi is 14 years old and has a fuel efficiency of 12 km/liter of fuel, find her profit in a run from Street 72 to Street 77 (a distance of 7km), if the stoppage time is 8 minutes.</p>","a":[{"id":1757735,"option":"Rs. 32.35","correct":false},{"id":1757736,"option":"Rs. 40.85","correct":false},{"id":1757737,"option":"Rs. 34.25","correct":false},{"id":1757738,"option":"Rs. 42.85","correct":true}]},{"q":"<p>Mike makes a profit of 20% by selling an article. What would be the percentage change in the profit percent had he paid 10% less for it and the customer paid 10% more for it?</p>","a":[{"id":1757727,"option":"120%","correct":false},{"id":1757728,"option":"125%","correct":false},{"id":1757729,"option":"133.33%","correct":true},{"id":1757730,"option":"150%","correct":false}]},{"q":"<p>Bob sells his motorcycle to John at a loss of 20% who subsequently sells it to Mike at a profit of 25%. Mike, after finding some defect in the motorcycle, returns it to John but could recover only Rs. 4.50 for every Rs. 5 he had paid. Determine the amount of Mike's loss if Bob had paid Rs. 1.75 lakh for the motorcycle.</p>","a":[{"id":1757719,"option":"Rs. 3500","correct":false},{"id":1757720,"option":"Rs. 2500","correct":false},{"id":1757721,"option":"Rs. 17,500","correct":true},{"id":1757722,"option":"None of these","correct":false}]},{"q":"<p>Alice makes a profit of X% by selling the pencil box for Rs. 24. Had the cost price and selling price been interchanged, it would have led to a loss of 62.5X%. With the latter cost price, what should be the new selling price to get a profit of X%?</p>","a":[{"id":1755195,"option":"34.40","correct":false},{"id":1755196,"option":"32.50","correct":false},{"id":1755197,"option":"25.60","correct":false},{"id":1755198,"option":"38.4","correct":true}]},{"q":"<p>A shopkeeper sells utensils at Rs.600 per utensil. However, he is forced to give two successive discounts of 10% and 5% respectively. However, he recovers the sales tax on the net sale price from the customer at 5% of the net price. What price does a customer have to pay him to buy the utensil?</p>","a":[{"id":1755191,"option":"539.75","correct":false},{"id":1755192,"option":"539.65","correct":false},{"id":1755193,"option":"538.75","correct":false},{"id":1755194,"option":"538.65","correct":true}]},{"q":"<p>A shopkeeper bought some bananas at 4 per rupee and an equal number at 5 per rupee. He then sold the entire quantity at 9 for 2 rupees. What is his percentage profit or loss?</p>","a":[{"id":1755187,"option":"1.23% loss","correct":true},{"id":1755188,"option":"6.66%","correct":false},{"id":1755189,"option":"8.888%","correct":false},{"id":1755190,"option":"No profit no loss","correct":false}]},{"q":"<p>How much percent more than the cost price should Bob mark his goods, so that after allowing a discount of 10% he should have a gain of 5% on his outlay?</p>","a":[{"id":1749993,"option":"60%","correct":false},{"id":1749994,"option":"61%","correct":false},{"id":1749995,"option":"62.5%","correct":true},{"id":1749996,"option":"64%","correct":false}]},{"q":"<p>Bob bought a washing machine at a cost price of 10000 dollars and his traveling cost was 560 dollars. After a while, Bob was bored of it and decided to sell the machine. He sold the machine at 2000 dollars loss. What was his selling price?</p>","a":[{"id":1749741,"option":"8560","correct":true},{"id":1749742,"option":"8000","correct":false},{"id":1749743,"option":"8600","correct":false},{"id":1749744,"option":"8400","correct":false}]},{"q":"<p>The cost price of a dress and a pair of sandals is 371 dollars. If the dress costs 12% more than the sandals, find the cost price of the sandals.</p>","a":[{"id":1749733,"option":"Rs.125","correct":false},{"id":1749734,"option":"Rs.150","correct":false},{"id":1749735,"option":"Rs.175","correct":true},{"id":1749736,"option":"Rs.200","correct":false}]},{"q":"<p>Bob bought 350 chocolates at 10 dollars per dozen. If he sold all of them at 1 dollar each, what was his profit percent?</p>","a":[{"id":1749700,"option":"33.33%","correct":true},{"id":1749701,"option":"30%","correct":false},{"id":1749702,"option":"50%","correct":false},{"id":1749703,"option":"25%","correct":false}]},{"q":"<p>Alice sold her bag for 1000 dollars at a profit of 25%. What would have been the actual profit or loss on it, if it had been sold for 900 dollars?</p>","a":[{"id":1749692,"option":"loss, 50","correct":false},{"id":1749693,"option":"profit, 100","correct":true},{"id":1749694,"option":"loss, 150","correct":false},{"id":1749695,"option":"profit, 200","correct":false}]},{"q":"<p>Bob buys a machine for 400 dollars. If that machine is sold at a loss of 20%, what will be its cost price as a percentage of its selling price?</p>","a":[{"id":1749684,"option":"100%","correct":false},{"id":1749685,"option":"120%","correct":false},{"id":1749686,"option":"125%","correct":true},{"id":1749687,"option":"130%","correct":false}]},{"q":"<p>By selling a watch for 500 dollars, a shopkeeper incurs a loss of 10%. Find the cost price of the watch for the shopkeeper.</p>","a":[{"id":1749676,"option":"450","correct":false},{"id":1749677,"option":"450.5","correct":false},{"id":1749678,"option":"453","correct":false},{"id":1749679,"option":"454.5","correct":true}]},{"q":"<p>Bob decides to buy a motorcycle for 4000 dollars and spent 1500 dollars on its repairs. If he sells the motorcycle for 6000 dollars, what will be his gain percent?</p>","a":[{"id":1748214,"option":"100/11%","correct":true},{"id":1748215,"option":"25/2%","correct":false},{"id":1748216,"option":"11/2%","correct":false},{"id":1748217,"option":"110/11%","correct":false}]},{"q":"<p>A shoemaker incurs an expense of Rs. 200 for producing a shoe. She also incurs an additional expenditure of Rs. 50,000, independent of the number of shoes produced. If she can sell a shoe during the season, she sells it for Rs. 300 else, she sells each shoe for Rs. 150. If she produces 2000 shoes, Determine the number of shoes that she must sell during the season to breakeven?<br>\n[<em>Note</em>: Assume that she can sell all the shoes produced]</p>","a":[{"id":1401210,"option":"1200","correct":false},{"id":1401211,"option":"1500","correct":true},{"id":1401212,"option":"1000","correct":false},{"id":1401213,"option":"900","correct":false}]},{"q":"<p>A painter paints n number of paintings each month from March to June. He has sold <em>n/2</em> number of paintings at the beginning of each month from July to February. He hasn't paid extra charges for storage from March through June, but he paid <em>$ 0.10</em> per painting each month from July to February for the unsold paintings.<br>\nWhat was the total additional cost (in terms of <em>n</em>) for storage that the painter had to pay for the <em>12</em> months from March to February?</p>","a":[{"id":1404103,"option":"1.4n","correct":true},{"id":1404104,"option":"1.6n","correct":false},{"id":1404105,"option":"1.2n","correct":false},{"id":1404106,"option":"1.1n","correct":false}]},{"q":"<p>Rob sold an oven at a profit of 35%. If one-fifth of the selling price is Rs. 2,700, then what is 20% of the total amount that he paid to purchase the oven?</p>","a":[{"id":1401007,"option":"Rs. 10,000","correct":false},{"id":1401008,"option":"Rs. 1,200","correct":false},{"id":1401009,"option":"Rs. 12,000","correct":false},{"id":1401010,"option":"Rs. 2,000","correct":true}]},{"q":"<p>Alice is a flower seller who buys 85 roses at Rs. 350. Unfortunately, 5 of the roses were damaged and he could not sell them.<br>\nAt what price should he sell each of the roses to make a profit of 17%?</p>","a":[{"id":1401012,"option":"Rs. 4.12","correct":false},{"id":1401013,"option":"Rs. 4.19","correct":false},{"id":1401014,"option":"Rs. 5.12","correct":true},{"id":1401015,"option":"Rs. 5.43","correct":false}]},{"q":"<p>Bob bought a bicycle for Rs. 15,000 last year and sold it to Ben a loss of 10%. Ben then sold the bicycle to Lisa at a profit of 20% and Lisa sold it to Tara at a profit of 10%.<br>\n<br>\nDetermine how much Tara paid for the bicycle?</p>","a":[{"id":1401206,"option":"Rs.17,820","correct":true},{"id":1401207,"option":"Rs. 17,500","correct":false},{"id":1401208,"option":"Rs. 18,620","correct":false},{"id":1401209,"option":"Rs. 17,680","correct":false}]}]