[{"q":"<p>Bob, John and Mary are best friends and they applied for a job in HackerEarth in the same department but HackerEarth has only one vacancy. Given that the probability of Bob's selection is 1/3, John's selection is&nbsp;1/4 and that of Mary is 1/8. What is the probability that only one of them will be selected?</p>","a":[{"id":1955388,"option":"0.42","correct":true},{"id":1955389,"option":"0.44","correct":false},{"id":1955390,"option":"0.46","correct":false},{"id":1955391,"option":"0.48","correct":false}]},{"q":"<p>Bob buys 40 beds for Rs. 14,725. Among them, 18 are double-beds and&nbsp; rest are single-beds. At what price he must&nbsp; sell the double beds so that if he sells the single beds at 1/2 of this price, he makes a profit of 60% on his outlay?</p>","a":[{"id":1955448,"option":"Rs.812.41","correct":true},{"id":1955449,"option":"Rs.712.41","correct":false},{"id":1955450,"option":"Rs.912.41","correct":false},{"id":1955451,"option":"Rs.612.41","correct":false}]},{"q":"<p>Bob buys 30 beds for Rs. 4725. Of these, 8 are double-beds and the rest are single-beds. At what price must he sell the double beds so that if he sells the single beds at 3/4th of this price, he makes a profit of 40% on his outlay?</p>","a":[{"id":1757723,"option":"Rs. 180","correct":false},{"id":1757724,"option":"Rs. 270","correct":true},{"id":1757725,"option":"Rs. 360","correct":false},{"id":1757726,"option":"Rs. 450","correct":false}]},{"q":"<p>HackerEarth employs some hacksters on their staff. Their respective probability of remaining in employment for 10 years are 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9. Determine the probability that after 10 years at least 6 of them still work in HackerEarth?</p>","a":[{"id":1765889,"option":"0.19","correct":true},{"id":1765890,"option":"1.22","correct":false},{"id":1765891,"option":"0.1","correct":false},{"id":1765892,"option":"0.2","correct":false}]},{"q":"<p>John calculated simple interest on a total amount invested at 5% per annum for 2 years duration is $100. If he had the same amount invested at the same rate and for the same time period then, what will the total compound interest, if calculated annually?</p>","a":[{"id":1748163,"option":"$102.50","correct":true},{"id":1748164,"option":"$110","correct":false},{"id":1748165,"option":"$105.50","correct":false},{"id":1748166,"option":"$120","correct":false}]},{"q":"<p>Alice loves to make different types of mocktails. She decided to make a new mocktail by mixing two types of drinks in the ratio 2:3. She started selling the mocktail at the rate of Rs 22 per liter. She made a profit of 10% by selling 2 quantities. If the cost of the smaller quantity is Rs 14 per liter, then what will be the cost per liter of the larger quantity?</p>","a":[{"id":1765048,"option":"Rs. 23","correct":false},{"id":1765049,"option":"Rs. 24","correct":true},{"id":1765050,"option":"Rs. 25","correct":false},{"id":1765051,"option":"Rs. 26","correct":false}]},{"q":"<p>Alice borrows Rs. 100,000 from Bob for a period of 2 years. If the rate of interest be 12% per annum compounded half-yearly, what amount will she get after 2 years?</p>","a":[{"id":1757787,"option":"Rs. 122,247.89","correct":false},{"id":1757788,"option":"Rs. 125,436.79","correct":false},{"id":1757789,"option":"Rs. 126,247.70","correct":true},{"id":1757790,"option":"Rs. 122,436.89","correct":false}]},{"q":"<p>The present ages of Mike and Bob are in the ratio 5:7. Five years before, the ratio of their ages was 2:3. What will be the present ages of Mike and Bob?</p>","a":[{"id":1748077,"option":"Mike is 5 years old and Bob is 35 years old.","correct":false},{"id":1748078,"option":"Mike is 25 years old and Bob is 35 years old.","correct":true},{"id":1748079,"option":"Mike is 35 years old and Bob is 25 years old.","correct":false},{"id":1748080,"option":"Mike is 25 years old and Bob is 5 years old.","correct":false}]},{"q":"<p>Mike, the biggest wholesaler in the US, uses a quality-check scheme on produced items before they are sent into the market. Out of 20 articles, he chooses a set of 4 articles at random, completes a quality check, and then sends the entire 20 articles to the market. If even one article is found to be defective then the whole set undergoes a quality check again. If no defects are found, then the whole set is sent to the market for sale. What is the probability that a set&nbsp;containing 4 defective articles will be sent into the market?</p>","a":[{"id":1765885,"option":"364/963","correct":false},{"id":1765886,"option":"364/969","correct":true},{"id":1765887,"option":"96/969","correct":false},{"id":1765888,"option":"343/969","correct":false}]},{"q":"<p>A box contains 6 red marbles, 5 blue, 2 green marbles, and 5 pink marbles. If 3 marbles are picked at random, what is the probability that the marbles are all red?</p>","a":[{"id":1749704,"option":"5/204","correct":true},{"id":1749705,"option":"1/204","correct":false},{"id":1749706,"option":"10/816","correct":false},{"id":1749707,"option":"5/816","correct":false}]},{"q":"<p>What day will be 61 days after today, if today is Monday?</p>","a":[{"id":1770408,"option":"Tuesday","correct":false},{"id":1770409,"option":"Thursday","correct":false},{"id":1770410,"option":"Saturday","correct":true},{"id":1770411,"option":"Friday","correct":false}]},{"q":"<p>In a year, Christmas was enjoyed on 25<sup>th</sup> December 9 AM and New year was celebrated on 1<sup>st</sup> January 12 AM. Determine the total time interval between the two?</p>","a":[{"id":1770340,"option":"144","correct":false},{"id":1770341,"option":"158","correct":true},{"id":1770342,"option":"170","correct":false},{"id":1770343,"option":"180","correct":false}]},{"q":"<p>The ages of Anita, Mary, and Lisa together are 57 years. Tara is thrice as old as Anita and Lisa is 12 years older than Anita. Then, the respective age of Anita, Mary, and Lisa is?</p>","a":[{"id":1770336,"option":"27,9,21","correct":false},{"id":1770337,"option":"9,21,27","correct":false},{"id":1770338,"option":"21,27,9","correct":false},{"id":1770339,"option":"9,27,21","correct":true}]},{"q":"<p>The average of ages of Alice, Mike, and Bob is 43 years, and the average of the ages of Alice, Mike, and Bob is 49 years. If Ben is 54 years old, what is Mike's age?</p>","a":[{"id":1770332,"option":"30 years","correct":false},{"id":1770333,"option":"36 years","correct":true},{"id":1770334,"option":"42 years","correct":false},{"id":1770335,"option":"48 years","correct":false}]},{"q":"<p>Alice's present age is three times his daughter's and nine-thirteenth of his mother's present age. The sum of the present ages of all three of them is 125 years. What is the difference between the present ages of Alice's daughter and Alice's mother?</p>","a":[{"id":1770328,"option":"30 years","correct":false},{"id":1770329,"option":"40 years","correct":false},{"id":1770330,"option":"50 years","correct":true},{"id":1770331,"option":"60 years","correct":false}]},{"q":"<p><strong>Situation:</strong>&nbsp;The questions given below consist of a question followed by three statements. You have to study the question and the statements and decide which of the statement(s) is/are necessary to answer the question.</p>\n\n<p><strong>Problem</strong><br>\nWhat is Bob's present age?</p>\n\n<p>1. Bob's present age is five times Ben's present age.<br>\n2. Five years ago his age was twenty-five times Ben's age at that time.</p>","a":[{"id":1767134,"option":"1 alone sufficient while 2 alone not sufficient to answer","correct":false},{"id":1767135,"option":"2 alone sufficient while 1 alone not sufficient to answer","correct":false},{"id":1767136,"option":"Both 1 and 2 are not sufficient to answer","correct":false},{"id":1767137,"option":"Both 1 and 2 are necessary to answer","correct":true}]},{"q":"<p>The questions given below consist of a question followed by three statements. You have to study the question and the statements and decide which of the statement(s) is/are necessary to answer the question.</p>\n\n<p><strong>Problem</strong><br>\nWhat is Mike's present age?</p>\n\n<p>1. Five years ago, Mike's age was double that of his son's age at that time.<br>\n2. Present ages of Mike and his son are in the ratio of 11:6 respectively.<br>\n3. Five years hence, the respective ratio of Mike's age and his son's age will become 12:7.</p>","a":[{"id":1767030,"option":"Only 1 and 2","correct":false},{"id":1767031,"option":"Only 2 and 3","correct":false},{"id":1767032,"option":"Only 1 and 3","correct":false},{"id":1767033,"option":"Any two of the three","correct":true}]},{"q":"<p>The questions given below consist of a question followed by three statements. You have to study the question and the statements and decide which of the statement(s) is/are necessary to answer the question:</p>\n\n<p><strong>Problem</strong></p>\n\n<p>What will be the ratio between the ages of Alice and Bob after 5 years?<br>\n1. Alice's present age is more than Bob's present age by 4 years.<br>\n2. Bob's present age is 20 years.<br>\n3. The ratio of Bob's present age to Alice's present age is 5: 6.</p>","a":[{"id":1767026,"option":"Any two of 1, 2 and 3","correct":true},{"id":1767027,"option":"2 only","correct":false},{"id":1767028,"option":"3 only","correct":false},{"id":1767029,"option":"1 or 3 only","correct":false}]},{"q":"<p>In a test organized by NTA, questions were asked in various sections. Out of the total students, 5% of students cleared the cut-off in all the sections and 5% cleared none. Of the rest, 25% cleared only one section and 20% cleared four sections. If 24.5% of the entire candidates cleared two sections and 300 candidates cleared three sections, determine how many candidates appeared for the test?</p>","a":[{"id":1766894,"option":"1000","correct":false},{"id":1766895,"option":"1200","correct":true},{"id":1766896,"option":"1500","correct":false},{"id":1766897,"option":"2000","correct":false}]},{"q":"<p>Alice is a hackster. She is assigned three tasks for which time allotted is in the ratio of 5:4:2 (jobs are needed to be done individually). But due to some technical snag, 10% of the time allotted for each job gets wasted. Thereafter, owing to the lack of interest, invests only 40%, 30%, and 20% of the hours of what was actually allotted to do the three jobs individually. Determine how much percentage of the total time allotted is the time invested by Alice?</p>","a":[{"id":1766590,"option":"38.33%","correct":false},{"id":1766591,"option":"39.4545%","correct":false},{"id":1766592,"option":"32.72%","correct":true},{"id":1766593,"option":"36.66%","correct":false}]},{"q":"<p>The cost of automobiles has risen up by 15%, labor cost has also increased from 25% of the cost of automobiles to 30% of the cost of automobiles. By how much percentage should there be a reduction in the usage of automobiles so as to keep the cost same?</p>","a":[{"id":1766586,"option":"17%","correct":true},{"id":1766587,"option":"24%","correct":false},{"id":1766588,"option":"25%","correct":false},{"id":1766589,"option":"28%","correct":false}]},{"q":"<p>Alice and Bob play a series of 5 chess games. The probability that Alice wins a game is 2/5 and the probability of Bob winning a game is 3/5. There is no probability of a draw. The series will be won by the person who wins 3 matches. The series ends at the moment when any of the two wins 3 matches. Determine the probability that Alice wins the series?</p>","a":[{"id":1765881,"option":"992/3125","correct":true},{"id":1765882,"option":"273/625","correct":false},{"id":1765883,"option":"1021/3125","correct":false},{"id":1765884,"option":"1081/3125","correct":false}]},{"q":"<p>An alloy of magnesium, copper, and zinc contains 90% zinc, 7% magnesium, and 3% silver. A second alloy of zinc and copper only is melted with the first and the mixture contains 85% of zinc, 5% of magnesium, and 10% of copper. Determine the percentage of zinc in the second alloy?</p>","a":[{"id":1765385,"option":"75%","correct":false},{"id":1765386,"option":"72.5%","correct":true},{"id":1765387,"option":"70%","correct":false},{"id":1765388,"option":"67.5%","correct":false}]},{"q":"<p>Water can be prepared by Hydrogen and Oxygen. The price of hydrogen is thrice the price of Oxygen. Some people sell the water&nbsp;at Rs.2160 per 10L, thereby making a profit of 20%. If the ratio of Hydrogen and Oxygen in the mixture be 2:3. Determine the cost price of Hydrogen?</p>","a":[{"id":1765381,"option":"Rs. 210/litre","correct":false},{"id":1765382,"option":"Rs. 300/litre","correct":true},{"id":1765383,"option":"Rs. 120/litre","correct":false},{"id":1765384,"option":"Rs. 400/litre","correct":false}]},{"q":"<p>An alloy of copper and zinc is taken in the ratio of 1:2, and another alloy of the same metals is taken in the ratio of 2:3. How many parts of the two alloys must be taken to obtain a new alloy consisting of copper and zinc that are in the ratio 3:5?</p>","a":[{"id":1765377,"option":"3 and 5","correct":true},{"id":1765378,"option":"2 and 9","correct":false},{"id":1765379,"option":"2 and 5","correct":false},{"id":1765380,"option":"1 and 5","correct":false}]},{"q":"<p>Alice is very fond of vintage vehicles. She bought four vintage vehicles for a total of Rs.1 lakh. She spent a total 2 lakh in the overhead maintenance of these four vehicles. What is the sale price of the rest three vehicles to get 50% total gain if she has already sold one of the four vehicles at Rs.1.2 lakh?</p>","a":[{"id":1765056,"option":"Rs. 1.1 lakh","correct":true},{"id":1765057,"option":"Rs. 1.2 lakh","correct":false},{"id":1765058,"option":"Rs. 1.5 lakh","correct":false},{"id":1765059,"option":"Rs. 1.65 lakh","correct":false}]},{"q":"<p>Alice sells to Bob goods at five-thirds the rate of profit at which Bob has decided to sell it to Mike. Mike, on other hand, sells it to Ben at one-third the rate of profit at which Bob sold it to Mike. If Ben gives Rs.2145 to Mike at 10% profit, how much did Alice buy it for?</p>","a":[{"id":1765389,"option":"Rs.1000","correct":true},{"id":1765390,"option":"Rs. 2000","correct":false},{"id":1765391,"option":"Rs. 1500","correct":false},{"id":1765392,"option":"Rs. 1800","correct":false}]},{"q":"<p>There was a survey done in 2011. The population of Madhya Pradesh was 1283575 on 1st January 2011 and the growth rate of population was 10% in the last year and 5% in the years prior to it, the only exception being 2009 when because of a huge exodus there was a decline of 20% in the population. What was the population on January 1, 2005?</p>","a":[{"id":1763203,"option":"Rs. 1000000","correct":false},{"id":1763204,"option":"Rs. 1200000","correct":true},{"id":1763205,"option":"Rs. 1250000","correct":false},{"id":1763206,"option":"Rs. 1500000","correct":false}]},{"q":"<p>A sum is divided between Alice and Bob in the ratio of 1:2. Alice purchased a car from her part, which depreciates 147% per annum and Bob deposited his amount in a bank, which pays him 20% interest per annum compounded annually. By what percentage will the total sum of money increase after two years due to this investment pattern (approximately)?</p>","a":[{"id":1763195,"option":"20%","correct":true},{"id":1763196,"option":"26.66%","correct":false},{"id":1763197,"option":"30%","correct":false},{"id":1763198,"option":"25%","correct":false}]},{"q":"<p>Three friends Lisa, Tara, and Mary invested different amounts in a fixed deposit scheme for one year at the rate of 12% per annum and earned a total interest of Rs.3,240 at the end of the year. If the amount invested by Tara is Rs.5000 more than the amount invested by Lisa and the amount invested by Mary is Rs.2000 more than the amount invested by Tara, what is the amount invested by Tara?</p>","a":[{"id":1763187,"option":"Rs. 12000","correct":false},{"id":1763188,"option":"Rs. 10000","correct":true},{"id":1763189,"option":"Rs. 7000","correct":false},{"id":1763190,"option":"Rs. 5000","correct":false}]},{"q":"<p>Bob lent a certain sum at 6% per annum simple interest. After a year, Rs. 6800 is paid back and the rest of the amount is paid at 5% per annum. If the second years' interest is 11/20 of the first years' interest, determine the amount of money that was lent out?</p>","a":[{"id":1757783,"option":"17000","correct":true},{"id":1757784,"option":"16800","correct":false},{"id":1757785,"option":"16500","correct":false},{"id":1757786,"option":"17500","correct":false}]},{"q":"<p>Alice bought a car on the down payment of Rs.15,000 and the rest amount at 8% per annum for 2 years. In this way, she paid Rs. 28,920 in total. Determine the original price of the car?</p>","a":[{"id":1757743,"option":"Rs. 26,000","correct":false},{"id":1757744,"option":"Rs. 27,000","correct":true},{"id":1757745,"option":"Rs. 27,200","correct":false},{"id":1757746,"option":"Rs. 26,500","correct":false}]},{"q":"<p>Bob buys pencils from the stationery at wholesale prices and sells them at his shop at retail prices. He operates his shop 30 days a month, as a rule. He buys in multiples of 100 pencils and sells them in multiples of a dozen pencils. He purchases apsara for Rs. 425 per hundred and sells at Rs. 65per dozen, he buys Natraj at Rs. 150 per hundred and sells at Rs. 30 per dozen, he buys Camlin&nbsp;at Rs. 1800 per hundred and sells at Rs. 360 per dozen. Which of the three pencil brands yield him the maximum percentage profit?</p>","a":[{"id":1757739,"option":"Apsara","correct":false},{"id":1757740,"option":"Natraj","correct":false},{"id":1757741,"option":"Camlin","correct":false},{"id":1757742,"option":"Both b and c","correct":true}]},{"q":"<p>If Alice's taxi is 14 years old and has a fuel efficiency of 12 km/liter of fuel, find her profit in a run from Street 72 to Street 77 (a distance of 7km), if the stoppage time is 8 minutes.</p>","a":[{"id":1757735,"option":"Rs. 32.35","correct":false},{"id":1757736,"option":"Rs. 40.85","correct":false},{"id":1757737,"option":"Rs. 34.25","correct":false},{"id":1757738,"option":"Rs. 42.85","correct":true}]},{"q":"<p>Mike makes a profit of 20% by selling an article. What would be the percentage change in the profit percent had he paid 10% less for it and the customer paid 10% more for it?</p>","a":[{"id":1757727,"option":"120%","correct":false},{"id":1757728,"option":"125%","correct":false},{"id":1757729,"option":"133.33%","correct":true},{"id":1757730,"option":"150%","correct":false}]},{"q":"<p>Bob sells his motorcycle to John at a loss of 20% who subsequently sells it to Mike at a profit of 25%. Mike, after finding some defect in the motorcycle, returns it to John but could recover only Rs. 4.50 for every Rs. 5 he had paid. Determine the amount of Mike's loss if Bob had paid Rs. 1.75 lakh for the motorcycle.</p>","a":[{"id":1757719,"option":"Rs. 3500","correct":false},{"id":1757720,"option":"Rs. 2500","correct":false},{"id":1757721,"option":"Rs. 17,500","correct":true},{"id":1757722,"option":"None of these","correct":false}]},{"q":"<p>Alice makes a profit of X% by selling the pencil box for Rs. 24. Had the cost price and selling price been interchanged, it would have led to a loss of 62.5X%. With the latter cost price, what should be the new selling price to get a profit of X%?</p>","a":[{"id":1755195,"option":"34.40","correct":false},{"id":1755196,"option":"32.50","correct":false},{"id":1755197,"option":"25.60","correct":false},{"id":1755198,"option":"38.4","correct":true}]},{"q":"<p>A shopkeeper sells utensils at Rs.600 per utensil. However, he is forced to give two successive discounts of 10% and 5% respectively. However, he recovers the sales tax on the net sale price from the customer at 5% of the net price. What price does a customer have to pay him to buy the utensil?</p>","a":[{"id":1755191,"option":"539.75","correct":false},{"id":1755192,"option":"539.65","correct":false},{"id":1755193,"option":"538.75","correct":false},{"id":1755194,"option":"538.65","correct":true}]},{"q":"<p>A shopkeeper bought some bananas at 4 per rupee and an equal number at 5 per rupee. He then sold the entire quantity at 9 for 2 rupees. What is his percentage profit or loss?</p>","a":[{"id":1755187,"option":"1.23% loss","correct":true},{"id":1755188,"option":"6.66%","correct":false},{"id":1755189,"option":"8.888%","correct":false},{"id":1755190,"option":"No profit no loss","correct":false}]},{"q":"<p>Mike borrows a certain sum of money from Bob at 10% per annum at compound interest. The entire amount is discharged in full by Mike on payment of two equal amounts of Rs. 1000 each, one at the end of the first year and the other at the end of the second year. What is the approximate value of the amount borrowed by him?</p>","a":[{"id":1755183,"option":"Rs.1852","correct":false},{"id":1755184,"option":"Rs.1736","correct":true},{"id":1755185,"option":"Rs.1694","correct":false},{"id":1755186,"option":"Rs.1792","correct":false}]},{"q":"<p>Alice lends a certain amount to Bob on simple interest for two years at 20%. Bob gives this entire amount to Mike on compound interest for two years at the same rate annually. Find the percentage earning of Bob at the end of two years on the entire amount.</p>","a":[{"id":1755179,"option":"4%","correct":true},{"id":1755180,"option":"3(1/7)%","correct":false},{"id":1755181,"option":"3(2/7)%","correct":false},{"id":1755182,"option":"3(6/7)%","correct":false}]},{"q":"<p>If 2200 dollars is obtained after lending out A dollars at 5% per annum for 2 years and 1800 dollars is obtained after lending out B dollars at 10% per annum for 2 years, determine&nbsp; A+B.</p>","a":[{"id":1755175,"option":"3500","correct":true},{"id":1755176,"option":"2500","correct":false},{"id":1755177,"option":"2800","correct":false},{"id":1755178,"option":"4000","correct":false}]},{"q":"<p>A certain sum of money was invested by Bob at simple interest doubles itself in 4 years at simple interest. Find in how many years will it become 6 times itself at the same rate?</p>","a":[{"id":1750481,"option":"20 years","correct":true},{"id":1750482,"option":"21 years","correct":false},{"id":1750483,"option":"22 years","correct":false},{"id":1750484,"option":"23 years","correct":false}]},{"q":"<p>How much percent more than the cost price should Bob mark his goods, so that after allowing a discount of 10% he should have a gain of 5% on his outlay?</p>","a":[{"id":1749993,"option":"60%","correct":false},{"id":1749994,"option":"61%","correct":false},{"id":1749995,"option":"62.5%","correct":true},{"id":1749996,"option":"64%","correct":false}]},{"q":"<p>Bob bought a washing machine at a cost price of 10000 dollars and his traveling cost was 560 dollars. After a while, Bob was bored of it and decided to sell the machine. He sold the machine at 2000 dollars loss. What was his selling price?</p>","a":[{"id":1749741,"option":"8560","correct":true},{"id":1749742,"option":"8000","correct":false},{"id":1749743,"option":"8600","correct":false},{"id":1749744,"option":"8400","correct":false}]},{"q":"<p>The cost price of a dress and a pair of sandals is 371 dollars. If the dress costs 12% more than the sandals, find the cost price of the sandals.</p>","a":[{"id":1749733,"option":"Rs.125","correct":false},{"id":1749734,"option":"Rs.150","correct":false},{"id":1749735,"option":"Rs.175","correct":true},{"id":1749736,"option":"Rs.200","correct":false}]},{"q":"<p>Bob bought 350 chocolates at 10 dollars per dozen. If he sold all of them at 1 dollar each, what was his profit percent?</p>","a":[{"id":1749700,"option":"33.33%","correct":true},{"id":1749701,"option":"30%","correct":false},{"id":1749702,"option":"50%","correct":false},{"id":1749703,"option":"25%","correct":false}]},{"q":"<p>Alice sold her bag for 1000 dollars at a profit of 25%. What would have been the actual profit or loss on it, if it had been sold for 900 dollars?</p>","a":[{"id":1749692,"option":"loss, 50","correct":false},{"id":1749693,"option":"profit, 100","correct":true},{"id":1749694,"option":"loss, 150","correct":false},{"id":1749695,"option":"profit, 200","correct":false}]},{"q":"<p>Bob buys a machine for 400 dollars. If that machine is sold at a loss of 20%, what will be its cost price as a percentage of its selling price?</p>","a":[{"id":1749684,"option":"100%","correct":false},{"id":1749685,"option":"120%","correct":false},{"id":1749686,"option":"125%","correct":true},{"id":1749687,"option":"130%","correct":false}]},{"q":"<p>By selling a watch for 500 dollars, a shopkeeper incurs a loss of 10%. Find the cost price of the watch for the shopkeeper.</p>","a":[{"id":1749676,"option":"450","correct":false},{"id":1749677,"option":"450.5","correct":false},{"id":1749678,"option":"453","correct":false},{"id":1749679,"option":"454.5","correct":true}]},{"q":"<p>Bob decides to buy a motorcycle for 4000 dollars and spent 1500 dollars on its repairs. If he sells the motorcycle for 6000 dollars, what will be his gain percent?</p>","a":[{"id":1748214,"option":"100/11%","correct":true},{"id":1748215,"option":"25/2%","correct":false},{"id":1748216,"option":"11/2%","correct":false},{"id":1748217,"option":"110/11%","correct":false}]},{"q":"<p>Alice had a certain sum of money that amounts to 1010 dollars in 2 years and to 1160 dollars in 3 ½&nbsp; years. Determine the sum and the rate of interest?</p>","a":[{"id":1748187,"option":"12%","correct":false},{"id":1748188,"option":"12.34%","correct":true},{"id":1748189,"option":"12.66%","correct":false},{"id":1748190,"option":"13%","correct":false}]},{"q":"<p>Bob borrowed 4000 dollars from his friend at 5% per annum simple interest for the time period of 3 years. What will his sum amount to at the end of 3 years?</p>","a":[{"id":1748183,"option":"4500","correct":false},{"id":1748184,"option":"4600","correct":true},{"id":1748185,"option":"4700","correct":false},{"id":1748186,"option":"4400","correct":false}]},{"q":"<p>Alice borrowed a certain sum of money. At what rate percent per annum will the sum of money triple itself in 20 years?</p>","a":[{"id":1748179,"option":"5%","correct":false},{"id":1748180,"option":"6%","correct":false},{"id":1748181,"option":"8%","correct":false},{"id":1748182,"option":"10%","correct":true}]},{"q":"<p>Mike owes a sum of 10,000 dollars which amounts to 13,000 dollars in 4 years at the rate of simple interest. What will be the rate of interest he has gained?</p>","a":[{"id":1748171,"option":"4%","correct":false},{"id":1748172,"option":"5%","correct":false},{"id":1748173,"option":"6.25%","correct":false},{"id":1748174,"option":"7.5%","correct":true}]},{"q":"<p>Mike&nbsp;borrowed some money at the rate of interest 3 % p.a. for the first 3 years, 5 % p.a. for the next 6 years, and 7 % p.a. for a period beyond 9 years. If he pays a total interest of Rs. 5000 at the end of 18 years, then determine the money Mike borrowed.</p>","a":[{"id":1748175,"option":"4902","correct":true},{"id":1748176,"option":"4901","correct":false},{"id":1748177,"option":"4900","correct":false},{"id":1748178,"option":"4800","correct":false}]},{"q":"<p>Bob put a sum at simple interest at a certain rate for 3 years. Had it been put at 4% higher rate, it would have fetched Rs. 600 more. Find the sum.<br>\n&nbsp;</p>","a":[{"id":1748139,"option":"3000","correct":false},{"id":1748140,"option":"4000","correct":false},{"id":1748141,"option":"5000","correct":true},{"id":1748142,"option":"10000","correct":false}]},{"q":"<p>The Simple interest. on a certain sum of money borrowed by Bob for 4 years at 15 % per annum is Rs. 200 more than S.I. on the same sum borrowed by Mike for 5 years at 10 % per annum. What will be the sum?</p>","a":[{"id":1748091,"option":"1800","correct":false},{"id":1748092,"option":"2000","correct":true},{"id":1748093,"option":"2200","correct":false},{"id":1748094,"option":"2400","correct":false}]},{"q":"<p>Mike borrowed 6000 dollars at 6%&nbsp;per annum for the period from 5<sup>th</sup>&nbsp;Feb to 19<sup>th</sup>&nbsp;April 2021. What will be the simple interest on it?</p>","a":[{"id":1748081,"option":"42","correct":false},{"id":1748082,"option":"52","correct":false},{"id":1748083,"option":"62","correct":false},{"id":1748084,"option":"72","correct":true}]},{"q":"<p>Alice was born on 29<sup>th</sup> February 2016 which happened to be Monday. Assume if she lives&nbsp;till 2071, how many birthdays would she celebrate on Monday?</p>","a":[{"id":1749725,"option":"1","correct":true},{"id":1749726,"option":"2","correct":false},{"id":1749727,"option":"3","correct":false},{"id":1749728,"option":"5","correct":false}]},{"q":"<p>Alice, Ben, and Bob purchased sweets from a candy shop. The number of sweets of Alice and Ben is respectively 40% and 35% more than the number of sweets of Bob. What is the ratio of the number of sweets Alice and Ben had?</p>","a":[{"id":1754975,"option":"7:5","correct":false},{"id":1754976,"option":"27:20","correct":false},{"id":1754977,"option":"28:27","correct":true},{"id":1754978,"option":"54:17","correct":false}]},{"q":"<p>Which of the following dates of March 2001 was a Thursday?</p>","a":[{"id":1749680,"option":"1, 8, 15, 22, 29","correct":true},{"id":1749681,"option":"2, 9, 16, 23, 30","correct":false},{"id":1749682,"option":"4, 11, 18,  25","correct":false},{"id":1749683,"option":"5, 12, 19, 26","correct":false}]},{"q":"<p>You want to distribute masks and sanitizers among 4 people Alice, Ben, Bob, Tara and you divided it in the proportion of 6:5:4:1. If Bob gets 60 masks and sanitizers more than Tara, then how many does Alice gets?</p>\n\n<p>&nbsp;</p>","a":[{"id":1755131,"option":"20","correct":false},{"id":1755132,"option":"80","correct":false},{"id":1755133,"option":"100","correct":false},{"id":1755134,"option":"120","correct":true}]},{"q":"<p>If the fortnight of a month is 3 days earlier than Saturday, what day will it be on the 21<sup>st&nbsp;</sup>day of the month?</p>","a":[{"id":1749668,"option":"Sunday","correct":false},{"id":1749669,"option":"Tuesday","correct":false},{"id":1749670,"option":"Friday","correct":false},{"id":1749671,"option":"Wednesday","correct":true}]},{"q":"<p>In a family there are two members. Father told his daughter that he is four times her age. If after 5 years, he would be three times of daughter's age, then further after 15 years how many times he would be of his daughter's age?</p>","a":[{"id":1748167,"option":"2 times","correct":true},{"id":1748168,"option":"2.5 times","correct":false},{"id":1748169,"option":"5.5 times","correct":false},{"id":1748170,"option":"7.5 times","correct":false}]},{"q":"<p>There are 5 children. All five children are born at an interval of 3 years which means that the difference between consecutive children is 3 years. The sum of ages of all the children is 60 years. What is the age of the oldest child?</p>","a":[{"id":1748159,"option":"21 years","correct":false},{"id":1748160,"option":"6 years","correct":false},{"id":1748161,"option":"12 years","correct":false},{"id":1748162,"option":"18 years","correct":true}]},{"q":"<p>The salaries of Alice, Ben, and Bob are in the ratio 1:2:5. The company gained some profit and want to increase the salaries of each employee by 5%, 5%, and 6% respectively. What will be the&nbsp;ratio of the increased salaries?</p>","a":[{"id":1755135,"option":"20:66:95","correct":false},{"id":1755136,"option":"19:66:96","correct":false},{"id":1755137,"option":"21:42:106","correct":true},{"id":1755138,"option":"1:4:9","correct":false}]},{"q":"<p>You are working in a organization where you have 3 departments. The number of employees in those three departments is in the ratio 2:3:4. If 12 employees are increased in each department the ratio changes to 8:11:14. Determine the total number of employees in the beginning?</p>","a":[{"id":1755139,"option":"126","correct":false},{"id":1755140,"option":"162","correct":true},{"id":1755141,"option":"153","correct":false},{"id":1755142,"option":"189","correct":false}]},{"q":"<p>In an organization, the number of female employees is 40% more than that of male employees. The total number of employees working over there is 72. If 3 more female employees are admitted to the organization, determine the ratio of the number of male employees to that of the female?</p>","a":[{"id":1755143,"option":"1:2","correct":false},{"id":1755144,"option":"2:3","correct":true},{"id":1755145,"option":"33:42","correct":false},{"id":1755146,"option":"39:47","correct":false}]},{"q":"<p>You have a collection of 120 stationery items where the ratio of pen and notebooks was 3:2. If you want this ratio to be 2:3,&nbsp;then determine the number of notebooks to be further added?</p>","a":[{"id":1757527,"option":"108","correct":false},{"id":1757528,"option":"60","correct":true},{"id":1757529,"option":"72","correct":false},{"id":1757530,"option":"48","correct":false}]},{"q":"<p>If 0.25:a::5:7, then what is the value of a?</p>","a":[{"id":1757539,"option":"0.50","correct":false},{"id":1757540,"option":"0.05","correct":false},{"id":1757541,"option":"0.35","correct":true},{"id":1757542,"option":"0.25","correct":false}]},{"q":"<p>Alice is 6 times older than Ben. If the total of the ages is the smallest prime factor in the prime factorization of 119, then what is the age of Ben?</p>","a":[{"id":1748065,"option":"1 years old","correct":true},{"id":1748066,"option":"6 years old","correct":false},{"id":1748067,"option":"7 years old","correct":false},{"id":1748068,"option":"5 years old","correct":false}]},{"q":"<p>Mike is 4 years older than Alice who is thrice as old as Bob. If the sum of ages of Mike, Alice, and Bob is 32, then how much is Mike older than Bob?</p>","a":[{"id":1748061,"option":"16","correct":false},{"id":1748062,"option":"8","correct":false},{"id":1748063,"option":"12","correct":true},{"id":1748064,"option":"4","correct":false}]},{"q":"<p>A candy store sells chocolates. If the store sells 60% of chocholates and still has 760 chocolates. Then calculate the number of chocolates the store had in the beginning?</p>","a":[{"id":1754303,"option":"1900","correct":true},{"id":1754304,"option":"1600","correct":false},{"id":1754305,"option":"2000","correct":false},{"id":1754306,"option":"2100","correct":false}]},{"q":"<p>Alice score 60 marks and Mark scored 75 marks. Calculate how much percent of Alice's mark is Mark's mark?</p>","a":[{"id":1754299,"option":"125","correct":true},{"id":1754300,"option":"75","correct":false},{"id":1754301,"option":"95","correct":false},{"id":1754302,"option":"60","correct":false}]},{"q":"<p>If Alice's and Bob’s monthly salaries together amount to 18,000 dollars and if Alice spends 65% of her salary and Bob spends 30% of his. After expenditure, if their savings are the same, then calculate Alice’s salary?</p>","a":[{"id":1754291,"option":"13600","correct":false},{"id":1754292,"option":"14400","correct":true},{"id":1754293,"option":"15000","correct":false},{"id":1754294,"option":"15400","correct":false}]},{"q":"<p>If 65% of a number is more than 35% of 1850 by 660, then determine the number?</p>","a":[{"id":1754287,"option":"2011.5","correct":true},{"id":1754288,"option":"2012","correct":false},{"id":1754289,"option":"2001.5","correct":false},{"id":1754290,"option":"2002","correct":false}]},{"q":"<p>John took a random number and subtracted 33 from 75% of that number. If the result was 87 then find the number chosen by John?</p>","a":[{"id":1754139,"option":"150","correct":false},{"id":1754140,"option":"160","correct":true},{"id":1754141,"option":"180","correct":false},{"id":1754142,"option":"200","correct":false}]},{"q":"<p>To clear a class test, John must score 40% marks. If John gets 90 marks and fails by 55 marks, then what is the total marks of the class test?</p>","a":[{"id":1754045,"option":"360","correct":false},{"id":1754046,"option":"362","correct":true},{"id":1754047,"option":"350","correct":false},{"id":1754048,"option":"400","correct":false}]},{"q":"<p>Mark works at a bookstore and he places&nbsp;12 books on a shelf at random. What is the probability that a pair of random books will always be adjacent to each other?</p>","a":[{"id":1749869,"option":"1/6","correct":true},{"id":1749870,"option":"5/12","correct":false},{"id":1749871,"option":"7/24","correct":false},{"id":1749872,"option":"9/12","correct":false}]},{"q":"<p>Ben selected 3 random numbers from a random set of 17 consecutive numbers. Then what is the probability that the numbers chosen are either even numbers or prime numbers?</p>","a":[{"id":1749745,"option":"1/21","correct":false},{"id":1749746,"option":"7/20","correct":false},{"id":1749747,"option":"10/17","correct":false},{"id":1749748,"option":"None of these","correct":true}]},{"q":"<p>John brought 8 lottery tickets numbered 1 to 10 and all the tickets are jumbled up. If John picks a ticket at random then find the probability that the picked ticket number is a multiple of 2 or 5?</p>","a":[{"id":1750357,"option":"6/10","correct":true},{"id":1750358,"option":"7/10","correct":false},{"id":1750359,"option":"1/2","correct":false},{"id":1750360,"option":"2/5","correct":false}]},{"q":"<p>If a box contains 5 red marbles, 3 green marbles,&nbsp;4 blue marbles, and 1 yellow marble. If Ben picks 4 marbles at random from the total, then what is the probability that the picked marbles are not blue?</p>","a":[{"id":1749737,"option":"126/715","correct":true},{"id":1749738,"option":"214/715","correct":false},{"id":1749739,"option":"108/715","correct":false},{"id":1749740,"option":"426/715","correct":false}]},{"q":"<p>If the probability that Bob speaks truth is 4/5 and that of Alice speaking truth is 3/6. Then find the probability that both Bob and Alice agree to state one fact?</p>","a":[{"id":1749717,"option":"1/2","correct":true},{"id":1749718,"option":"12/10","correct":false},{"id":1749719,"option":"5/10","correct":false},{"id":1749720,"option":"3/10","correct":false}]},{"q":"<p>In a marathon competition 5 friends&nbsp; Bob, John, Mark, Ben, and Lisa participated in a half-day marathon. Then in how many ways can Lisa finish always before Ben in the marathon?</p>","a":[{"id":1749696,"option":"120","correct":false},{"id":1749697,"option":"60","correct":true},{"id":1749698,"option":"80","correct":false},{"id":1749699,"option":"24","correct":false}]},{"q":"<p>Mark invested 16000 dollars from his savings in a fixed deposit at compound interest of rate 5% per annum for 2 years. How much amount will Mark get on maturity of FD?</p>","a":[{"id":1748147,"option":"17640","correct":true},{"id":1748148,"option":"18320","correct":false},{"id":1748149,"option":"16960","correct":false},{"id":1748150,"option":"19092","correct":false}]},{"q":"<p>If the sum of 50000 dollars was taken by Ben at 12% per annum for 2 years. What will be the compound interest of the sum?</p>","a":[{"id":1748143,"option":"62720","correct":true},{"id":1748144,"option":"9720","correct":false},{"id":1748145,"option":"8163.90","correct":false},{"id":1748146,"option":"10123.20","correct":false}]},{"q":"<p>If Bob borrowed 7500 dollars at Compound Interest of the rate of 4% per annum, then how much is the amount that is to be paid after 2 years?</p>","a":[{"id":1748111,"option":"4056","correct":true},{"id":1748112,"option":"4110","correct":false},{"id":1748113,"option":"8082","correct":false},{"id":1748114,"option":"8100","correct":false}]},{"q":"<p>Determine the compound Interest of 16000 dollars at 5% per annum for 3 years when compound Interest is calculated annually?</p>","a":[{"id":1748107,"option":"2522","correct":true},{"id":1748108,"option":"1511","correct":false},{"id":1748109,"option":"1,261","correct":false},{"id":1748110,"option":"2,440","correct":false}]},{"q":"<p>Determine the compound Interest for the principle amounts of 9826 dollars in 3 years at 6 1/4 % per annum?&nbsp;</p>","a":[{"id":1748099,"option":"8192","correct":true},{"id":1748100,"option":"4096","correct":false},{"id":1748101,"option":"3096","correct":false},{"id":1748102,"option":"6192","correct":false}]},{"q":"<p>John offers 5% compound interest to Bob on a biannual basis. Bob deposits 3200 dollars each on 15<sup>th</sup> June and 15<sup>th</sup> December of a year. Determine the amount Bob would have gained by interest?</p>","a":[{"id":1748085,"option":"6642","correct":true},{"id":1748086,"option":"3321","correct":false},{"id":1748087,"option":"3642","correct":false},{"id":1748088,"option":"4642","correct":false}]},{"q":"<p>Bob notices that the hands of his wristwatch coincide with each other every 45 minutes. How much time will his watch lose per day in this scenario?</p>","a":[{"id":1401042,"option":"650 minutes 50 seconds","correct":false},{"id":1401043,"option":"650 minutes 18 seconds","correct":true},{"id":1401044,"option":"656 minutes 39 seconds","correct":false},{"id":1401045,"option":"655 minutes 46 seconds","correct":false}]},{"q":"<p>You are asked to use two pipes A and B to fill a tank that has another pipe C at the bottom of it. Given that pipes A and B can fill the tank in <em>15</em> and <em>20</em> minutes, respectively and pipe C can empty <em>5</em> gallons per minute from the tank.<br>\nIn the given context, what is the capacity of the tank if all three pipes working together can fill the tank in <em>10</em> minutes?</p>","a":[{"id":1401062,"option":"300 gallons","correct":true},{"id":1401063,"option":"400 gallons ","correct":false},{"id":1401064,"option":"450 gallons","correct":false},{"id":1401065,"option":"350 gallons ","correct":false}]},{"q":"<p>You are filling a large bowl with a solution made up of <em>10</em> parts of water and <em>5</em> parts of syrup. How much of the mixture should be drawn out of the bowl and replaced with syrup so that the mixture is half water and half syrup?<br>\n<em>Note</em>: Assume that the bowl contains <em>15</em> liters of solution.</p>","a":[{"id":1401346,"option":"43834","correct":true},{"id":1401347,"option":"43838","correct":false},{"id":1401348,"option":"43832","correct":false},{"id":1401349,"option":"43833","correct":false}]},{"q":"<p>A shoemaker incurs an expense of Rs. 200 for producing a shoe. She also incurs an additional expenditure of Rs. 50,000, independent of the number of shoes produced. If she can sell a shoe during the season, she sells it for Rs. 300 else, she sells each shoe for Rs. 150. If she produces 2000 shoes, Determine the number of shoes that she must sell during the season to breakeven?<br>\n[<em>Note</em>: Assume that she can sell all the shoes produced]</p>","a":[{"id":1401210,"option":"1200","correct":false},{"id":1401211,"option":"1500","correct":true},{"id":1401212,"option":"1000","correct":false},{"id":1401213,"option":"900","correct":false}]},{"q":"<p>A school has two alarms <em>A</em> and <em>B</em>. Alarm A rings once every two hours and alarm B rings once every four hours.<br>\n<br>\nDetermine the percentage by which the number of times A would ring in 24 hours is greater than the number of times alarm B would ring in that same period?</p>","a":[{"id":1401202,"option":"100%","correct":true},{"id":1401203,"option":"120%","correct":false},{"id":1401204,"option":"150%","correct":false},{"id":1401205,"option":"110%","correct":false}]},{"q":"<p>A man can row <em>40</em> km upstream and <em>60</em> km downstream in <em>13</em> hours. He can also row <em>50</em> km upstream and <em>72</em> km downstream in <em>16</em> hours.<br>\nIn the given context, what is the rate of the current?</p>","a":[{"id":1401322,"option":"2.5 km/hr","correct":false},{"id":1401323,"option":"3.5 km/hr","correct":true},{"id":1401324,"option":"4.5 km/hr","correct":false},{"id":1401325,"option":"5.5 km/hr","correct":false}]},{"q":"<p>Julian went to the market and bought fish worth Rs. <em>30</em> out of which <em>50</em> paise were spent as sales tax. What is the cost of tax-free items if the tax rate is <em>5%</em>?<br>\n<em>Note</em>: Choose the option that coincides with the nearest integer.</p>","a":[{"id":1401306,"option":"Rs. 20","correct":true},{"id":1401307,"option":"Rs. 50","correct":false},{"id":1401308,"option":"Rs. 30","correct":false},{"id":1401309,"option":"Rs. 25","correct":false}]},{"q":"<p>A painter paints n number of paintings each month from March to June. He has sold <em>n/2</em> number of paintings at the beginning of each month from July to February. He hasn't paid extra charges for storage from March through June, but he paid <em>$ 0.10</em> per painting each month from July to February for the unsold paintings.<br>\nWhat was the total additional cost (in terms of <em>n</em>) for storage that the painter had to pay for the <em>12</em> months from March to February?</p>","a":[{"id":1404103,"option":"1.4n","correct":true},{"id":1404104,"option":"1.6n","correct":false},{"id":1404105,"option":"1.2n","correct":false},{"id":1404106,"option":"1.1n","correct":false}]},{"q":"<p>In what ratio should a vendor mix water with milk to gain <em>12 2/3%</em> on selling the mixture at cost price?<br>\n<em>Note</em>: Choose the option that coincides with the nearest integer.</p>","a":[{"id":1401350,"option":"50:6","correct":false},{"id":1401351,"option":"0.2847222222","correct":true},{"id":1401352,"option":"45 : 10","correct":false},{"id":1401353,"option":"10 : 45","correct":false}]},{"q":"<p>Bob has allocated a budget <em>x</em> for painting his shop. However, the price of paint increases by <em>45%</em>. If Bob decides to spend an additional <em>30%</em> of <em>x</em> for buying paint then by what percentage will the quantity of paint purchased be reduced?</p>","a":[{"id":1401310,"option":"15.66 %","correct":false},{"id":1401311,"option":"10.34 %","correct":true},{"id":1401312,"option":"0.1233","correct":false},{"id":1401313,"option":"14.34 %","correct":false}]},{"q":"<p>Mr. John attends a party at his friend's house for Christmas in <em>2017</em>. His friend introduces him to a girl named Alice who is a mathematician.<br>\n<em>3</em> years later, Mr. John runs into Alice celebrating her 5th birthday on the <em>29th of February 2020</em>.<br>\nIf Mr. John remarks that he is only <em>2</em> years older than her, what is Mr. John's current age?</p>","a":[{"id":1401254,"option":"17 years","correct":false},{"id":1401255,"option":"18 years","correct":false},{"id":1401256,"option":"17 years","correct":false},{"id":1401257,"option":"22 years","correct":true}]},{"q":"<p>The sum of the ages of <em>A</em> and <em>B</em> at present is <em>7</em> times the difference in their ages. After <em>5</em> years, the sum of their ages will be <em>9</em> times the difference in their ages.<br>\nDetermine the present age of the older one?</p>","a":[{"id":1401246,"option":"30 years","correct":false},{"id":1401247,"option":"40 years","correct":false},{"id":1401248,"option":"35 years","correct":false},{"id":1401249,"option":"20 years","correct":true}]},{"q":"<p>At what time will the minute hand and hour hand of a wall clock make one-third angle of the right angle between <em>8</em> PM and <em>9</em> PM?<br>\n<em>Note</em>: Select the accurate time in hours and minutes.</p>","a":[{"id":1401314,"option":"8:49 PM","correct":true},{"id":1401315,"option":"8:20 PM","correct":false},{"id":1401316,"option":"8:40 PM","correct":false},{"id":1401317,"option":"8:37 PM","correct":false}]},{"q":"<p>A student gets an aggregate of <em>60%</em> marks in five subjects in the ratio <em>8:7:6:5:4</em>. The passing marks are <em>40%</em> of the maximum marks and each subject has the same maximum marks. In the given context, how many subjects did the student pass?</p>","a":[{"id":1401270,"option":"5","correct":true},{"id":1401271,"option":"3","correct":false},{"id":1401272,"option":"4","correct":false},{"id":1401273,"option":"Cannot be determined","correct":false}]},{"q":"<p>Rob sold an oven at a profit of 35%. If one-fifth of the selling price is Rs. 2,700, then what is 20% of the total amount that he paid to purchase the oven?</p>","a":[{"id":1401007,"option":"Rs. 10,000","correct":false},{"id":1401008,"option":"Rs. 1,200","correct":false},{"id":1401009,"option":"Rs. 12,000","correct":false},{"id":1401010,"option":"Rs. 2,000","correct":true}]},{"q":"<p>A library has a collection of books out of which 55% of books are more than 50 years old and 60% of books are less than or equal to 70 years old. Also, 40% of the total collection of books in the library is mostly fictional novels.<br>\nIf 40% of the books that are more than 70 years old are fictional novels then, what percentage of fictional novels are less than or equal to 70 years?</p>","a":[{"id":1401002,"option":"58 %","correct":false},{"id":1401003,"option":"56 %","correct":false},{"id":1401004,"option":"60 %","correct":true},{"id":1401005,"option":"54 %","correct":false}]},{"q":"<p>Jim set his wristwatch to show the correct time at <em>9 AM</em>. If the watch gains <em>10</em> minutes in <em>12</em> hours, determine the actual time when the watch shows <em>11 AM</em> on the <em>6th</em> day?</p>","a":[{"id":1401226,"option":"9:00 AM","correct":true},{"id":1401227,"option":"8:00 AM","correct":false},{"id":1401228,"option":"10:00 AM","correct":false},{"id":1401229,"option":"11:00 AM","correct":false}]},{"q":"<p>A scientist named Bob was exposed to some radiation which caused him to age backward after he turned <em>40</em>. Four years later, his current age and his daughter Alice's age are in the ratio <em>3:1</em>.<br>\nDetermine the ratio of Bob's and Alice's age four years before Bob turned <em>40</em>.</p>","a":[{"id":1401087,"option":"9:1","correct":true},{"id":1401088,"option":"3:2","correct":false},{"id":1401089,"option":"4:1","correct":false},{"id":1401090,"option":"9:2","correct":false}]},{"q":"<p>You have two pipes <em>P1</em> and <em>P2</em> that can fill a large bucket in <em>4</em> hours and <em>2</em> hours, respectively. Also, assume that you open the pipes at alternate hours.<br>\nIn the given context, how many hours will it take to fill the bucket if you open <em>P1</em> first?<br>\n<em>Note</em>: Select the accurate time in hours and minutes.</p>","a":[{"id":1401072,"option":"3 hours 00 minutes","correct":true},{"id":1401073,"option":"3 hours 30 minutes ","correct":false},{"id":1401074,"option":"4 hours 00 minutes","correct":false},{"id":1401075,"option":"3 hours 15 minutes","correct":false}]},{"q":"<p>It takes <em>400</em> seconds for a train to completely cross two points <em>A</em> and <em>B</em> which are at a distance of <em>7.8 </em>km.<br>\nDetermine the speed of the trains, if the length of the train is <em>200 </em>m?<br>\n<em>Note</em>: Assume that the values that are obtained after the decimal point are neglected.</p>","a":[{"id":1401230,"option":"72 km/h","correct":true},{"id":1401231,"option":"36 km/h","correct":false},{"id":1401232,"option":"48 km/h","correct":false},{"id":1401233,"option":"64 km/h","correct":false}]},{"q":"<p>A boatman goes <em>12</em> km against the current of the stream in <em>6</em> hours and goes <em>2</em> km along with the current in <em>50</em> minutes. How long will it take for him to go <em>8</em> km in still water?<br>\n<em>Note</em>: Select the accurate time in hours and minutes.</p>","a":[{"id":1401326,"option":"3 hrs 30 mins","correct":false},{"id":1401327,"option":"3 hrs 38 mins","correct":true},{"id":1401328,"option":"2 hrs","correct":false},{"id":1401329,"option":"2 hrs 30 mins","correct":false}]},{"q":"<p>The ratio of the time taken by three motorbikes to cover a particular distance is <em>3: 6: 9</em>. Determine the ratio of the speeds of the bikes over the same distance?</p>","a":[{"id":1401282,"option":"6 : 3: 2","correct":true},{"id":1401283,"option":"3 : 6: 2","correct":false},{"id":1401284,"option":"6 : 9: 2","correct":false},{"id":1401285,"option":"4 : 5: 6","correct":false}]},{"q":"<p>The ratio of the score obtained by the two students is <em>4:3</em>. The combined average of their score percent is <em>100</em> and the score obtained is <em>1400</em>.<br>\nWhat is the total score of the exam conducted?</p>","a":[{"id":1401274,"option":"350","correct":false},{"id":1401275,"option":"700","correct":true},{"id":1401276,"option":"1050","correct":false},{"id":1401277,"option":"1400","correct":false}]},{"q":"<p><em>A</em> and <em>B</em> are <em>50</em> and <em>70</em> years old, respectively. How many years ago was the ratio of their ages <em>2:3</em>?</p>","a":[{"id":1401262,"option":"40 years","correct":false},{"id":1401263,"option":"80 years","correct":false},{"id":1401264,"option":"10 years","correct":true},{"id":1401265,"option":"45 years","correct":false}]},{"q":"<p>Two toy trains&nbsp;<em>A</em> and <em>B</em>&nbsp;run towards each other on a conveyor belt of length <em>2500&nbsp;</em>m. The speed of train <em>A</em> is <em>35</em> m/s, and the speed of train <em>B</em> is <em>15</em> m/s. Determine time taken by trains to collide, if the speed of the conveyor belt is <em>10</em> m/s?</p>","a":[{"id":1401330,"option":"125 sec","correct":false},{"id":1401331,"option":"50 sec","correct":true},{"id":1401332,"option":"62 sec","correct":false},{"id":1401333,"option":"65 sec","correct":false}]},{"q":"<p>Bob has a box of <em>14</em> origami papers out of which <em>5</em> are red in colour, <em>6</em> are blue in colour and <em>3</em> are black in colour.<br>\nIn how many ways can he select the papers if he wants every selection to have at least <em>1</em> black paper and at least <em>1</em> blue paper?</p>","a":[{"id":1401102,"option":"15100","correct":false},{"id":1401103,"option":"14112","correct":true},{"id":1401104,"option":"15332","correct":false},{"id":1401105,"option":"14300","correct":false}]},{"q":"<p>You have a grandfather clock that is indicating the time as 6:35. What is the angle formed between the hour hand and the minute hand in the given scenario?</p>","a":[{"id":1401037,"option":"15 degrees","correct":false},{"id":1401038,"option":"14.5 degrees ","correct":false},{"id":1401039,"option":"12.5 degrees","correct":true},{"id":1401040,"option":"13.5 degrees","correct":false}]},{"q":"<p>A retailer buys lentil A at Rs. 20.40 per kg and lentil B at Rs. 18.60 per kg. He wants to mix A and B to make a new mixture C that costs Rs. 19.40 per kg.<br>\nIn what ratio should he mix lentil A and B to do so?</p>","a":[{"id":1401017,"option":"8 : 10","correct":true},{"id":1401018,"option":"10 : 8","correct":false},{"id":1401019,"option":"4 : 10 ","correct":false},{"id":1401020,"option":"10 : 4","correct":false}]},{"q":"<p>A clock gains <em>4</em> minutes after every <em>4</em> minutes. You set the correct time in the clock at <em>6:00 A.M.</em> every day to deal with this issue. Determine the correct time when the clock shows <em>8:00 P.M.</em>?</p>","a":[{"id":1401218,"option":"1:00 PM","correct":true},{"id":1401219,"option":"2:00 PM","correct":false},{"id":1401220,"option":"4:00 PM","correct":false},{"id":1401221,"option":"7:00 PM","correct":false}]},{"q":"<p>In a factory packing red and green apples, 6% of the apples were found to be defective. Also, 90% of the non-defective apples were red apples. If 4700 non-defective apples were all green, then how many apples in total were packed in the factory?</p>","a":[{"id":1400997,"option":"1,06,300","correct":false},{"id":1400998,"option":"1,00,000","correct":true},{"id":1400999,"option":"60300","correct":false},{"id":1401000,"option":"1,60,300","correct":false}]},{"q":"<p>The present age of the father is <em>4</em> years more than thrice the age of his son. Three years later, the father's age will be <em>10</em> years more than twice the age of his son.<br>\nDetermine the present age of the father (in years)?</p>","a":[{"id":1401334,"option":"33 years","correct":false},{"id":1401335,"option":"31 years","correct":true},{"id":1401336,"option":"45 years","correct":false},{"id":1401337,"option":"43 years","correct":false}]},{"q":"<p>Two trains <em>A</em> and <em>B</em> start at the same time from points <em>P1</em> and <em>P2</em> towards each other. After crossing each other, they take <em>25</em> seconds and <em>9</em> seconds to reach <em>P2</em> and <em>P1</em> respectively.<br>\nDetermine the ratio of the speed of <em>A</em> to <em>B</em>?</p>","a":[{"id":1401238,"option":"3:5","correct":true},{"id":1401239,"option":"1:2","correct":false},{"id":1401240,"option":"5:3","correct":false},{"id":1401241,"option":"2:1","correct":false}]},{"q":"<p>You have a mixture of 100 liters of water and milk containing 25% milk.<br>\nThe amount of milk that should be added to the mixture so that the percentage of milk in the new mixture becomes 30% is X.YZ liters when rounded off to two decimal places.<br>\nDetermine the value of X + Y?</p>","a":[{"id":1401214,"option":"8","correct":true},{"id":1401215,"option":"11","correct":false},{"id":1401216,"option":"4","correct":false},{"id":1401217,"option":"6","correct":false}]},{"q":"<p>You have three pipes P1, P2, and P3 that fill a tank completely in 5 hours, 10 hours, and 15 hours, respectively. You open P1, P2, and P3 for 2 hours each in sequence.</p>\n\n<p>Approximately, how many hours will P1 take to fill the tank completely?</p>","a":[{"id":1401077,"option":"6 hours 10 minutes","correct":false},{"id":1401078,"option":"6 hours 20 minutes","correct":false},{"id":1401079,"option":"7 hours 20 minutes","correct":true},{"id":1401080,"option":"6 hours 30 minutes","correct":false}]},{"q":"<p>You have a mixture of <em>100</em> liters of water and milk which contains <em>25% </em>milk. Let the amount of milk that should be added to the mixture so that the percentage of milk in the new mixture is <em>30%</em> be <em>X.YZ</em> liters when rounded off to two decimal places. What is the value of <em>X + Y</em>?</p>","a":[{"id":1418125,"option":"8","correct":true},{"id":1418126,"option":"11","correct":false},{"id":1418127,"option":"4","correct":false},{"id":1418128,"option":"6","correct":false}]},{"q":"<p>In how many rearrangements of the word PREJUDICE, is the letter J positioned in between the 2 Es?</p>","a":[{"id":1401107,"option":"60480","correct":true},{"id":1401108,"option":"60420","correct":false},{"id":1401109,"option":"50600","correct":false},{"id":1401110,"option":"55600","correct":false}]},{"q":"<p>In the year <em>2000</em>, Alice turned 25 and gave birth to her son Bob. Due to some side effects, Alice stopped aging right after she gave birth. Now, the present ages of Alice and Bob are in the ratio <em>2:1</em>.<br>\nWhat would the ratio of Alice and Bob's present ages be if Alice hadn't stopped aging?</p>","a":[{"id":1401082,"option":"3 : 2","correct":false},{"id":1401083,"option":"2 : 3","correct":true},{"id":1401084,"option":"5 : 3","correct":false},{"id":1401085,"option":"3 : 5","correct":false}]},{"q":"<p>Alice wants to sell artisanal drinks during the holiday season. He produces 160 litres of the drink and sells a part of it at 10% profit. He then sells the rest of the drink at 6% profit.<br>\nWhat quantity of the drink did he sell at 10% profit if he gained 9% profit on the entire 160 litres?</p>","a":[{"id":1401027,"option":"120 litres","correct":true},{"id":1401028,"option":"100 litres","correct":false},{"id":1401029,"option":"140 litres","correct":false},{"id":1401030,"option":"90 litres","correct":false}]},{"q":"<p>Alice is a flower seller who buys 85 roses at Rs. 350. Unfortunately, 5 of the roses were damaged and he could not sell them.<br>\nAt what price should he sell each of the roses to make a profit of 17%?</p>","a":[{"id":1401012,"option":"Rs. 4.12","correct":false},{"id":1401013,"option":"Rs. 4.19","correct":false},{"id":1401014,"option":"Rs. 5.12","correct":true},{"id":1401015,"option":"Rs. 5.43","correct":false}]},{"q":"<p><em>T1</em> and <em>T2</em> are two different times. The hour hand at time <em>T1</em> and <em>T2</em> have a difference of <em>67.5</em> degrees.<br>\n<br>\nWhat is the time <em>T2</em> if <em>T1 </em>is <em>12:15 A.M</em>.?</p>","a":[{"id":1401222,"option":"2 : 20 AM","correct":false},{"id":1401223,"option":"2 : 25 AM","correct":false},{"id":1401224,"option":"2 : 30 AM","correct":true},{"id":1401225,"option":"2:45 AM","correct":false}]},{"q":"<p>A YouTuber decides to launch limited edition merchandise that includes bags, shoes, and jackets. In <em>2018</em>, she launches the merchandise in the ratio <em>2:3:4</em>, respectively. In <em>2019</em>, she removes '<em>n</em>' items from each type of merchandise launched in <em>2018</em> so that the new ratio is <em>3:5:7</em>.<br>\nSimilarly, in <em>2020</em>, she removes <em>10</em> items from each type of merchandise produced in <em>2019</em> so that the ratio <em>1:2:3</em>.<br>\nWhat is the total number of items that were removed from the merchandise launched in <em>2019</em>?</p>","a":[{"id":1401132,"option":"30","correct":true},{"id":1401133,"option":"20","correct":false},{"id":1401134,"option":"15","correct":false},{"id":1401135,"option":"25","correct":false}]},{"q":"<p>You are baking a cake using rare ingredients <em>A, B,</em> and <em>C</em>. Assume that you put <em>45%</em> of<em> A</em> in the cake. Additionally, you put B as <em>1/3</em> of the amount of ingredient <em>C</em> while baking the cake. If the amount of <em>C</em> used to bake the cake is <em>8</em> Tablespoons (Tbsp), then how many Tbsp of ingredients were put in the cake?<br>\n<em>Note</em>: Assume that no other ingredients apart from <em>A, B</em> and <em>C</em> were used in baking the cake and choose the option that coincides with the nearest integer.</p>","a":[{"id":1401302,"option":"16 Tbsp","correct":false},{"id":1401303,"option":"17 Tbsp","correct":false},{"id":1401304,"option":"19 Tbsp","correct":true},{"id":1401305,"option":"15 Tbsp","correct":false}]},{"q":"<p>Six fixed baskets have been numbered <em>1, 2,.....,6</em>.<br>\nEach of the six baskets is to be filled up either with an apple or an orange in such a way that at least one basket contains orange and the baskets containing the oranges are consecutively numbered.<br>\nDetermine the total number of ways in which this can be done?</p>","a":[{"id":1401294,"option":"60","correct":false},{"id":1401295,"option":"5","correct":false},{"id":1401296,"option":"21","correct":true},{"id":1401297,"option":"33","correct":false}]},{"q":"<p>Mango <em>A</em> worth Rs <em>130/kg</em> and mango <em>B</em> worth Rs <em>120/kg</em> is mixed with the third variety <em>C</em> in the ratio <em>1:1:2</em>.<br>\nIf the mixture is worth Rs <em>160</em>, what is the price of the variety <em>C</em> mango?</p>","a":[{"id":1401278,"option":"Rs 195","correct":true},{"id":1401279,"option":"Rs 200","correct":false},{"id":1401280,"option":"Rs 225","correct":false},{"id":1401281,"option":"Rs 230","correct":false}]},{"q":"<p>John's and Bob's ages are in the ratio <em>3:4</em>; Bob's and Lisa's ages are in the ratio <em>4:7, </em>and Lisa's and Ben's ages are in the ratio <em>7:9</em>.<br>\nDetermine the ratio of John's and Ben's ages?</p>","a":[{"id":1401250,"option":"1:3","correct":true},{"id":1401251,"option":"2:3","correct":false},{"id":1401252,"option":"3:1","correct":false},{"id":1401253,"option":"3:2","correct":false}]},{"q":"<p>A wholesaler decides to mix two varieties of lentils worth Rs. 170 per kg and Rs. 180 per kg with a third variety of lentils in the ratio 2:2:3.<br>\nWhat is the price per kg of the third variety of lentils if the lentil mixture is worth 173 per kg?</p>","a":[{"id":1401022,"option":"Rs. 174.30","correct":false},{"id":1401023,"option":"Rs. 178.33","correct":false},{"id":1401024,"option":"Rs. 176.40","correct":false},{"id":1401025,"option":"Rs. 170.33","correct":true}]},{"q":"<p>The ratio of Ben's age 4 years ago and Anita's age after <em>4</em> years is <em>1:1</em>. Presently, the ratio of their ages is <em>5:3</em>.<br>\nWhat is the ratio of Ben's age <em>4</em> years hence and Anita's age <em>4</em> years ago?</p>","a":[{"id":1401258,"option":"1:3","correct":false},{"id":1401259,"option":"3:1","correct":true},{"id":1401260,"option":"5:7","correct":false},{"id":1401261,"option":"4:3","correct":false}]},{"q":"<p><em>4</em> units are drawn from a container full of milk and is then filled with water. This operation is performed two more times. The ratio of the quantity of milk now left in the container to that of water is <em>8:19</em>.<br>\nHow much milk did the container hold originally?</p>","a":[{"id":1404107,"option":"11 units","correct":false},{"id":1404108,"option":"12 units","correct":true},{"id":1404109,"option":"9 units","correct":false},{"id":1404110,"option":"10 units","correct":false}]},{"q":"<p>You are asked to form a CSR team consisting of <em>2</em> men and <em>2</em> women from a group of <em>5</em> men and <em>7</em> women.<br>\nIn how many ways can you form the team if one man and one woman refused to work together?</p>","a":[{"id":1401122,"option":"198","correct":false},{"id":1401123,"option":"120","correct":false},{"id":1401124,"option":"186","correct":true},{"id":1401125,"option":"140","correct":false}]},{"q":"<p>You want to arrange digits <em>0</em> to <em>9</em> such that <em>1</em> and <em>2</em> always have <em>2</em> digits between them.<br>\nIn how many ways can you do this without repeating any digit?</p>","a":[{"id":1401097,"option":"14 x 8! ways ","correct":true},{"id":1401098,"option":"9 x 8! ways ","correct":false},{"id":1401099,"option":"12 x 8! ways ","correct":false},{"id":1401100,"option":"10 x 7! ways ","correct":false}]},{"q":"<p>A large concrete bed is filled using five small pipes and two large pipes. Each of the five small pipes works at <em>2/5</em> the rate of the large pipe. If all the <em>7</em> pipes are opened at the same time, they should fill the entire bed in what fraction of time that it would have taken the large pipe alone?</p>","a":[{"id":1401298,"option":"1/4","correct":true},{"id":1401299,"option":"1/3","correct":false},{"id":1401300,"option":"2/3","correct":false},{"id":1401301,"option":"3/4","correct":false}]},{"q":"<p>Bob is using two taps <em>A</em> and <em>B</em> to fill a tank in <em>12</em> hours and <em>15</em> hours, respectively. He opens both the taps and observes that it took him <em>20</em> minutes more to fill the tank due to some leakage.<br>\nHow long will the leakage take to empty a full tank in the given scenario?<br>\n<em>Note</em>: Select the accurate time in hours and minutes.</p>","a":[{"id":1401067,"option":"53 hours 12 minutes ","correct":true},{"id":1401068,"option":"54 hours 00 minutes","correct":false},{"id":1401069,"option":"55 hours 00 minutes","correct":false},{"id":1401070,"option":"52 hours 12 minutes","correct":false}]},{"q":"<p>Jake owns a boat named Santa Maria. When Jake was born, Santa Maria had already been his family for <em>1/6th</em> of his present age.<br>\nAssume that Santa Maria has turned <em>70</em> this year. Determine Jake's present age?</p>","a":[{"id":1401338,"option":"60","correct":true},{"id":1401339,"option":"50","correct":false},{"id":1401340,"option":"55","correct":false},{"id":1401341,"option":"65","correct":false}]},{"q":"<p>There are <em>n</em> balls, out of which <em>B<sub>1</sub></em> balls are alike, <em>B<sub>2</sub></em> balls are alike, <em>B<sub>3</sub></em> balls are alike and so on and <em>B<sub>r</sub></em> balls are of <em>r<sup>th</sup></em> kind such that (<em>B<sub>1</sub> balls+ B<sub>2</sub> balls + B<sub>3</sub> balls+......+B<sub>r</sub> balls) = n</em> balls.<br>\nWhat is the number of permutations of n balls?</p>","a":[{"id":1401266,"option":"n(B1+B2+B3......+Br)","correct":false},{"id":1401267,"option":"n!(B1xB2xB3x......xBr)","correct":false},{"id":1401268,"option":"n!/(B1!xB2!xB3!x.......xBr!)","correct":true},{"id":1401269,"option":"n!/(B1xB2xB3x.......xBr)","correct":false}]},{"q":"<p>There are <em>16</em> pipes that are connected to a tank. Some of them are used to fill the tank and the others are used to drain the tank. Each of the fill pipes can fill the tank in 12 hours and each of the drain pipes can drain the tank completely in 8 hours.<br>\nIf all the pipes and drain pipes are kept open, an empty tank gets filled in 12 hours. Determine the count of fill pipes out of all the 16 pipes?</p>","a":[{"id":1401242,"option":"11","correct":false},{"id":1401243,"option":"12","correct":false},{"id":1401244,"option":"13","correct":false},{"id":1401245,"option":"10","correct":true}]},{"q":"<p>You have a mason jar of juice containing 44% of lemon juice. You decide to replace a part of this juice with another juice containing 20% of lemon juice.<br>\nWhat fraction of juice did you replace if the mixture now contains 24% of lemon juice?</p>","a":[{"id":1401032,"option":"5/6","correct":true},{"id":1401033,"option":"4/5","correct":false},{"id":1401034,"option":"3/5","correct":false},{"id":1401035,"option":"2/5","correct":false}]},{"q":"<p>The letters <em>E, E, G, M,</em> and <em>T</em> can be used to form <em>5</em>-letter strings such as <em>MEGET</em> or <em>MGEET</em>.<br>\nYou have to use these letters to form <em>5</em>-letter strings such that two occurrences of the letter <em>E</em> are separated by at least one letter.<br>\nDetrmine how many strings can be formed?</p>","a":[{"id":1401290,"option":"24","correct":false},{"id":1401291,"option":"28","correct":false},{"id":1401292,"option":"36","correct":true},{"id":1401293,"option":"16","correct":false}]},{"q":"<p>Two trains <em>A</em> and <em>B</em> are traveling in the same direction at a speed of 36 km/h and 72 km/h respectively. Train <em>B</em> approaches train A at <em>t=0 </em>and both are parallel after <em>30</em> seconds. Determine the length of train <em>A</em>?</p>","a":[{"id":1401234,"option":"300 m","correct":true},{"id":1401235,"option":"900 m","correct":false},{"id":1401236,"option":"450 m","correct":false},{"id":1401237,"option":"250 m","correct":false}]},{"q":"<p>A bus traveling from Bangalore to Hyderabad makes <em>4</em> stops during the entire journey. Four people enter the bus after it has started from Bangalore with four different tickets.<br>\nHow many different sets of tickets can the four people possibly have in the given scenario?</p>","a":[{"id":1401117,"option":"210","correct":true},{"id":1401118,"option":"220","correct":false},{"id":1401119,"option":"215","correct":false},{"id":1401120,"option":"212","correct":false}]},{"q":"<p>On a particular day, Alice buys a wall clock from an online store which was set at <em>10:00 AM</em> on the same day and delivered to him. Alice receives the clock three days later and notices that the clock is indicating <em>3:00 PM</em>.<br>\nIn the given scenario, determine what the true time is if the clock loses <em>10 minutes</em> in <em>24 hours</em>?<br>\n<em>Note</em>: Select the accurate time in hours and minutes.</p>","a":[{"id":1401047,"option":"3 : 22 PM","correct":true},{"id":1401048,"option":"4 : 00 pm","correct":false},{"id":1401049,"option":"3 : 15 pm","correct":false},{"id":1401050,"option":"4 : 20 pm","correct":false}]},{"q":"<p>Four glasses of sizes <em>2</em> units, <em>8</em> units, <em>12</em> units, and <em>16</em> units contain a mixture of juice &amp; water in the ratio 1 : 1, 3 : 5, 7 : 5, and 9 : 7, respectively. The contents of all four glasses are poured into a single jar. Determine the ratio of juice &amp; water in the resultant mixture?</p>","a":[{"id":1401286,"option":"10 : 9","correct":true},{"id":1401287,"option":"3 : 7","correct":false},{"id":1401288,"option":"11 : 10","correct":false},{"id":1401289,"option":"4 : 9","correct":false}]},{"q":"<p>Alice and <em>Mary</em> are two sisters who collect stamps as a hobby and have a total collection in the ratio <em>6:12</em>, respectively. Mary gave some of her stamps to Alice and the ratio of the total collection of stamps changed to <em>7:8</em>.<br>\nIn the given context, determine the fraction of stamps that Mary gave to Alice from her original collection.</p>","a":[{"id":1401137,"option":"1/5","correct":true},{"id":1401138,"option":"3/5","correct":false},{"id":1401139,"option":"4/5","correct":false},{"id":1401140,"option":"2/5","correct":false}]},{"q":"<p>A newly appointed class teacher wants to assign a unique <em>5</em> digit roll number to her students. She also wants all the roll numbers to start with <em>14</em>.<br>\nIn how many ways can she form the roll numbers if no digit appears more than once?</p>","a":[{"id":1401112,"option":"336 ways ","correct":true},{"id":1401113,"option":"337 ways ","correct":false},{"id":1401114,"option":"400 ways ","correct":false},{"id":1401115,"option":"415 ways ","correct":false}]},{"q":"<p>Determine the time between <em>1:15</em> and <em>2:45</em> at which the hands of a clock are at right angles.</p>","a":[{"id":1401052,"option":"21 9/11 minutes past 1:15","correct":false},{"id":1401053,"option":"6 9/11 minutes past 1:15","correct":false},{"id":1401054,"option":"21 9/11 minutes past 1:00","correct":false},{"id":1401055,"option":"Either 1 or 2","correct":false},{"id":1401056,"option":"Either 2 or 3","correct":true}]},{"q":"<p>A newspaper hawker selling newspapers and magazines gets <em>7% </em>commission on all sales up to Rs. <em>8,000</em>. Additionally, for all sales above Rs. <em>8000</em>, he gets<em> 5% </em>commission.<br>\nIf the total sales amount after deducting his commission is Rs. <em>30,000</em>, then what is the total sales made by him?</p>","a":[{"id":1400992,"option":"Rs. 40,748","correct":false},{"id":1400993,"option":"Rs. 32,748","correct":false},{"id":1400994,"option":"Rs. 30,748","correct":false},{"id":1400995,"option":"Rs. 31,748","correct":true}]},{"q":"<p>A coaching institute provides physics and mathematics classes to a group of students. The institute has male and female students in the ratio of <em>5:4</em> and a male student population of <em>1175</em>.<br>\nSuppose, a few weeks later a group of male students join the institute and the ratio of male to female students becomes <em>3:2</em>. What would the number of male students who joined the institute later be?</p>","a":[{"id":1401127,"option":"215","correct":false},{"id":1401128,"option":"176","correct":false},{"id":1401129,"option":"260","correct":false},{"id":1401130,"option":"235","correct":true}]},{"q":"<p><em>4</em> years ago, Bob was twelve times as old as his daughter and <em>4</em> years hence, four times his age will be equal to fourteen times that of his daughter.<br>\nCalculate the ratio of the present age of father and daughter after rounding off the values to their nearest integers?</p>","a":[{"id":1401342,"option":"16:3","correct":true},{"id":1401343,"option":"4:1","correct":false},{"id":1401344,"option":"2:1","correct":false},{"id":1401345,"option":"12:3","correct":false}]},{"q":"<p>You bought a vintage clock from an online store and set it at <em>8</em> AM. You notice that the clock gains <em>20</em> seconds every <em>5</em> minutes. If the clock shows <em>10:15</em> at night on the same day, what is the correct time?<br>\n<em>Note</em>: Select the accurate time in hours and minutes.</p>","a":[{"id":1401318,"option":"9:15 PM","correct":false},{"id":1401319,"option":"9:21 PM","correct":true},{"id":1401320,"option":"9:50 PM","correct":false},{"id":1401321,"option":"9:36 PM","correct":false}]},{"q":"<p>Bob set his wall clock at <em>8:00 AM </em>and noticed that the clock gained <em>10</em> minutes every <em>12</em> hours. On the third day, he decided to reset the clock again at <em>8:00 AM</em>.<br>\nIf the clock indicates <em>12</em> <em>PM</em> on the <em>4th</em> day, what will the true time be?<br>\n<em>Note</em>: Select the time in hours and minutes.</p>","a":[{"id":1401057,"option":"10 : 17 AM","correct":false},{"id":1401058,"option":"11 : 37 AM","correct":true},{"id":1401059,"option":"9 : 47 AM","correct":false},{"id":1401060,"option":"11 : 00 AM","correct":false}]},{"q":"<p>Your office has arranged for a box of food packets containing <em>2</em> packets of noodles, <em>3</em> packets of pasta and <em>4</em> packets of sushi.<br>\nIn how many ways can you pick <em>3</em> food packets from the box, so that at least one of them contains pasta?</p>","a":[{"id":1401092,"option":"24","correct":false},{"id":1401093,"option":"48","correct":false},{"id":1401094,"option":"64","correct":true},{"id":1401095,"option":"120","correct":false}]},{"q":"<p>Bob bought a bicycle for Rs. 15,000 last year and sold it to Ben a loss of 10%. Ben then sold the bicycle to Lisa at a profit of 20% and Lisa sold it to Tara at a profit of 10%.<br>\n<br>\nDetermine how much Tara paid for the bicycle?</p>","a":[{"id":1401206,"option":"Rs.17,820","correct":true},{"id":1401207,"option":"Rs. 17,500","correct":false},{"id":1401208,"option":"Rs. 18,620","correct":false},{"id":1401209,"option":"Rs. 17,680","correct":false}]}]