[{"q":"<p>Read the passage and select the correct option to complete following sentence:</p>\n<p>Walter Gropius, Charles Jeanneret (better known as Le Corbusier) and Ludwig Mies van der Rohe was among the most influential of the many architects who contributed to the development of Modernism in the first half of the century. But the economic depression of the 1930s and the second world war (1939-45) prevented their ideas from being widely realized until the economic conditions improved and war-torn cities had to be rebuilt. By the 1950s, the International Style had developed into a universal approach to building, which standardized the appearance of new buildings in cities across the world.</p>\n<p>Modernist ideas were not put into practice until the second half of the 20th century because ______________________________.</p>","a":[{"id":388570,"option":"An economic depression and the second world war hit Europe.","correct":true},{"id":388571,"option":"Historical buildings were preserved.","correct":false},{"id":388572,"option":"The quality of life is improved.","correct":false},{"id":388573,"option":"Architecture reflects the age.","correct":false}]},{"q":"<p>Read the paragraph and answer the following question:</p>\n<p>Zoos were originally created as places of entertainment, and their suggested involvement with conservation didn’t seriously arise until about 30 years ago when the Zoological Society of London held the first formal international meeting on the subject. Eight years later, a series of world conferences took place, entitled “The Breeding of Endangered Species”, and from this point onwards conservation became the zoo community’s buzzword. This commitment has now been clearly defined in The World Zoo\nConservation Strategy (WZGS, September 1993), which although an important and welcome document does seem to be based on an unrealistic optimism about the nature of the zoo industry</p>\n<p>What were the objectives of the WZCS document?</p>","a":[{"id":388512,"option":"To improve the calibre of zoos worldwide","correct":false},{"id":388513,"option":"To identify zoos suitable for conservation practice","correct":true},{"id":388514,"option":"To provide funds for zoos in underdeveloped countries","correct":false},{"id":388515,"option":"To list the endangered species of the world","correct":false}]},{"q":"<p>Read the paragraph and answer the following question:</p>\n<p>Many companies have measured energy consumption for some time in an attempt to reduce running costs. Other firms have tracked emissions of different types in order to comply with pollution regulations. In recent times, public pressure has led to more companies publishing emissions data in their annual reports or to organizations like the Carbon Monitoring Project. However, most firms will need to upgrade from the basic tools, such as spreadsheets, they have been using.</p>\n<p>What is the author trying to convey?</p>","a":[{"id":388562,"option":"Huge industrial growth is expected","correct":false},{"id":388563,"option":"Reasons why firms must monitor carbon output","correct":false},{"id":388564,"option":"Basic software will not be enough","correct":true},{"id":388565,"option":"A new software for a boring job","correct":false}]},{"q":"<p>Read the passage and answer the following question:</p>\n<p>Building big commercial buildings underground can be a way to avoid disfiguring or threatening a beautiful or “environmentally sensitive” landscape. Indeed many of the buildings which consume most land such as cinemas, supermarkets, theatres, warehouses or libraries have no need to be on the surface since they do not need windows.</p>\n<p>Which of the following headings is apt for the given passage?</p>","a":[{"id":388566,"option":"An underground home is discovered","correct":false},{"id":388567,"option":"The plans for future homes","correct":false},{"id":388568,"option":"Some buildings do not require natural light","correct":true},{"id":388569,"option":"Simulating a natural environment","correct":false}]}]