[{"q":"<p>Mike was developing a home page for his hostel website. So to make it more diverse in colours, he added a feature to customise the colour of the home where context remains the same. He added a button to automatically switch colour randomly. So to develop this which of the following XML attributes of the class Transition did he used?</p>\n\n<p> </p>\n\n<p><strong>XML attributes</strong></p>\n\n<ol>\n\t<li>android: duration<br>\n\t </li>\n\t<li>android: endDelay<br>\n\t </li>\n\t<li>android: Interpolator</li>\n</ol>","a":[{"id":1565647,"option":"1 and 2","correct":false},{"id":1565648,"option":"2 and 3","correct":false},{"id":1565649,"option":"1 and 3","correct":true},{"id":1565650,"option":"None of these","correct":false}]},{"q":"<p>Anita is developing an Android application for food delivery from various restaurants. She wants to make UI more interactive. While the user tries to sign in or signup for the application, she wanted to include a transition effect in such a way that when the user clicks on the Login button, the window fades off and navigates to the next window. For this, she wants to explore more about its XML attributes. She had designed the following statements about the transition effects from her learning process. Try to help her by picking out the correct statements regarding these XML attributes:</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>\n\t<p>The XML attribute <strong>android.duration</strong> represents the amount of time (in milliseconds) that the transition should run. </p>\n\t</li>\n\t<li>\n\t<p>The XML attribute <strong>android.delay</strong> represents the delay in milliseconds before the transition starts. </p>\n\t</li>\n\t<li>\n\t<p>The XML attribute <strong>android.interpolator</strong> represents an interpolator to be used in the animations spawned by this transition.</p>\n\t</li>\n</ol>","a":[{"id":1572084,"option":"1 and 2","correct":false},{"id":1572085,"option":"2 and 3","correct":false},{"id":1572086,"option":"1 and 3","correct":true},{"id":1572087,"option":"All of these","correct":false}]},{"q":"<p>In CSS3, you are working on the animation property. If you have implemented the @keyframes at-rules in your script, then which of the following nested at-rules is used to determine the aspect of the change of the layout that can be applied while you are printing the document?</p>\n\n<p> </p>","a":[{"id":1150635,"option":" @import","correct":false},{"id":1150636,"option":"@export-data","correct":false},{"id":1150637,"option":"@page","correct":true},{"id":1150638,"option":"@document","correct":false}]},{"q":"In CSS3, you are working on the animation property of your website. Which of the following statements about subproperties of this property are correct:<br>&nbsp;&nbsp;&nbsp;&nbsp;1. The animation-timing-function subproperty is used to configure the length of the time that animation must take to complete one cycle.<br>&nbsp;&nbsp;&nbsp;&nbsp;2. The animation-delay subproperty is used to configure the delay between the time an element is loaded and the beginning of the animation sequence.<br>&nbsp;&nbsp;&nbsp;&nbsp;3. The animation-iteration-count subproperty is used to configure the number of times the animation must repeat.","a":[{"id":1150531,"option":"1 and 2","correct":false},{"id":1150532,"option":"2 and 3","correct":true},{"id":1150533,"option":"1 and 3","correct":false},{"id":1150534,"option":"All of these","correct":false}]}]