[{"q":"<p>In MS SSIS, which of the following transformations is used for <strong>Pattern Matching</strong> and ranking based on the <strong>Fuzzy Logic</strong>?</p>","a":[{"id":400727,"option":"Fuzzy Grouping","correct":false},{"id":400728,"option":"Multicast ","correct":false},{"id":400729,"option":"Fuzzy Lookup ","correct":true},{"id":400730,"option":"Conditional Split","correct":false}]},{"q":"<p>In MS SSIS, which of the following is different from rest of the options in terms of the <strong>Aggregation</strong> transformation operation?</p>","a":[{"id":400558,"option":"Count","correct":true},{"id":400559,"option":"Count distinct","correct":false},{"id":400560,"option":"Group by","correct":false},{"id":400561,"option":"Aggregate","correct":false}]},{"q":"<p>In MS SSIS, which of the following transformations is asynchronous?</p>","a":[{"id":400546,"option":"Aggregate","correct":true},{"id":400547,"option":"Multicast","correct":false},{"id":400548,"option":"Conditional Split","correct":false},{"id":400549,"option":"Derived Column","correct":false}]},{"q":"<p>In MS SSIS, which of the following tasks is not a part of non-blocking?</p>","a":[{"id":400342,"option":"Conditional split","correct":false},{"id":400343,"option":"Multicast","correct":false},{"id":400344,"option":"Script component","correct":false},{"id":400345,"option":"Union all","correct":true}]},{"q":"In CSS3, you are working on 2D transformations. You have embedded an image on your web page. If you are required to increase the size of your image such that the height should be 3 times greater than the original size of the image and the width should be 2 times greater than the original size of the image, then which of the following syntaxes is used to perform this task?","a":[{"id":1150559,"option":"transform: scale(2,3);","correct":true},{"id":1150560,"option":"transform: scale(3,2);","correct":false},{"id":1150561,"option":"scale:transform(2,3);","correct":false},{"id":1150562,"option":"scale:transform(3,2);","correct":false}]},{"q":"In CSS3, you are working on 3D transformations. Which of the following statements about transformation properties are correct:<br>&nbsp;&nbsp;&nbsp;&nbsp;1. The transform properties are used to change the position of transformed elements.<br>&nbsp;&nbsp;&nbsp;&nbsp;2. The transform-style property is used to determine how the nested elements are rendered in a 3D space.<br>&nbsp;&nbsp;&nbsp;&nbsp;3. The perspective-origin property is used to determine the bottom position of 3D elements.<br>&nbsp;&nbsp;&nbsp;&nbsp;4. The backface-visibility property is used to determine if an element must be visible when it is not displayed on the screen.","a":[{"id":1150563,"option":"1, 2, and 3","correct":false},{"id":1150564,"option":"2, 3, and 4","correct":true},{"id":1150565,"option":"1, 2, and 4","correct":false},{"id":1150566,"option":"1, 3, and 4","correct":false}]},{"q":"<p>In MS SSIS, which of the following transformations is used to unnormalize the data structure by converting columns into rows incase of building <strong>Data Warehouses</strong>?</p>","a":[{"id":400723,"option":"Pivot","correct":false},{"id":400724,"option":"Row Count","correct":false},{"id":400725,"option":"Unpivot","correct":true},{"id":400726,"option":"Row Sampling","correct":false}]},{"q":"<p>In MS SSIS, which of the following transformations is used to create the less normalized version of a normalized table?</p>","a":[{"id":400578,"option":"Pivot","correct":true},{"id":400579,"option":"Unpivot","correct":false},{"id":400580,"option":"Sort","correct":false},{"id":400581,"option":"Row Sampling","correct":false}]},{"q":"<p>In MS SSIS, which of the following tasks is used to push the files in a folder?</p>","a":[{"id":400534,"option":"Data Flow","correct":false},{"id":400535,"option":"Execute SQL ","correct":false},{"id":400536,"option":"File System ","correct":true},{"id":400537,"option":"ActiveX Script ","correct":false}]},{"q":"<p>Which of the following transformations distributes buffer of incoming rows uniformly across the outputs on threads separately to improve the performance of MS SSIS packages running on the multi-core and multi-processor servers?</p>","a":[{"id":400394,"option":"Cache ","correct":false},{"id":400395,"option":"Balanced Data Distributor ","correct":true},{"id":400396,"option":"Character Map","correct":false},{"id":400397,"option":"Row Count ","correct":false}]},{"q":"<p>In MS SSIS, which of the following transformations is a <strong>row set</strong> transformation?</p>","a":[{"id":400350,"option":"Character map","correct":false},{"id":400351,"option":"Aggregate","correct":true},{"id":400352,"option":"Data conversion ","correct":false},{"id":400353,"option":"Derived column","correct":false}]},{"q":"<p>In MS SSIS, which of the following transformations is synchronous?</p>","a":[{"id":400542,"option":"Merge","correct":false},{"id":400543,"option":"Union All","correct":false},{"id":400544,"option":"Lookup","correct":true},{"id":400545,"option":"Sort","correct":false}]},{"q":"<p>In MS SSIS, which of the following properties is not present in the <strong>Data Conversion</strong> transformation?</p>","a":[{"id":400538,"option":"Output column","correct":true},{"id":400539,"option":"Length","correct":false},{"id":400540,"option":"Scale","correct":false},{"id":400541,"option":"Precision","correct":false}]},{"q":"<p>In MS SSIS, which of the following transformations use the sorted data?</p>","a":[{"id":400478,"option":"Merge","correct":true},{"id":400479,"option":"Union All","correct":false},{"id":400480,"option":"Merge join","correct":false},{"id":400481,"option":"Sort","correct":false}]},{"q":"<p>In MS SSIS, the <strong>Script</strong> component is a part of __________________________ transformation.</p>","a":[{"id":400382,"option":"Row ","correct":true},{"id":400383,"option":"Rowset","correct":false},{"id":400384,"option":"Audit ","correct":false},{"id":400385,"option":"Split & Join ","correct":false}]},{"q":"<p>In MS SSIS, which of the following categories cannot be classified as the <strong>transformation buffer</strong> usage?</p>","a":[{"id":400338,"option":"Full blocking","correct":false},{"id":400339,"option":"Open blocking","correct":true},{"id":400340,"option":"Partial blocking","correct":false},{"id":400341,"option":"Non blocking","correct":false}]},{"q":"<p>In MS SSIS, which of the following tasks is not a part of partial-blocking?</p>","a":[{"id":400346,"option":"Merge join","correct":true},{"id":400347,"option":"Merge","correct":false},{"id":400348,"option":"Sort","correct":false},{"id":400349,"option":"Data mining","correct":false}]},{"q":"<p>In Informatica, you are working on the transformations. Which of the following statements about Identity Resolution Transformation are correct:</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>The Identity Resolution transformation is a passive transformation that you can use to search and match data in Informatica Identity Resolution (IIR).</li>\n\t<li>The PowerCenter Integration Service uses the search definition that you specify in the Identity Resolution transformation to search and match data residing in the IIR tables. </li>\n\t<li>The input and output views in the system determine the input and output ports of the transformation.</li>\n</ol>","a":[{"id":1755171,"option":"1 and 2","correct":false},{"id":1755172,"option":"2 and 3","correct":true},{"id":1755173,"option":"1 and 3","correct":false},{"id":1755174,"option":"All of these","correct":false}]},{"q":"<p>In Informatica, you are working on the transformations. You have an Employee details table which contains all the information about the employees that work in your organization. Now, if you are required to adjust employee salaries, concatenate first and last names, or convert strings to numbers, then which of the following transformations must be implemented to perform this action in this scenario?</p>","a":[{"id":1755167,"option":"Aggregate Transformation","correct":false},{"id":1755168,"option":"SQL Transformation","correct":false},{"id":1755169,"option":"Data Masking Transformation","correct":false},{"id":1755170,"option":"Expression Transformation","correct":true}]},{"q":"<p>In Informatica, you are working on the transformations. If you are required to change sensitive production data to realistic test data for non-production environments, then which of the following transformations must be implemented to perform this action in this scenario?</p>","a":[{"id":1755163,"option":"Aggregate Transformation","correct":false},{"id":1755164,"option":"Custom Transformation","correct":false},{"id":1755165,"option":"Expression Transformation","correct":false},{"id":1755166,"option":"Data Masking Transformation","correct":true}]},{"q":"<p>In Informatica, you are working on the transformations. You wanted to receive a row that contains multiple-occurring columns and returns a row for each instance of the multiple-occurring data. For this, you have implemented a Normalizer transformation. If you are required to process multiple-occurring data from relational tables or flat files, then which of the following types of Normalizer transformation must be implemented to perform this action in this scenario?</p>","a":[{"id":1755159,"option":"VSAM Normalizer transformation","correct":false},{"id":1755160,"option":"Pipeline Normalizer transformation","correct":true},{"id":1755161,"option":"Trobleshooting Normalizer transformation","correct":false},{"id":1755162,"option":"Both 1 and 3","correct":false}]},{"q":"<p>In Informatica, you are working on the transformations. Which of the following statements about Sorter transformation are correct:</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>You can also configure the Sorter transformation for case-sensitive sorting, and specify whether the output rows should be distinct.</li>\n\t<li>The Sorter transformation is a passive transformation. It must be connected to the data flow.</li>\n\t<li>When you create a Sorter transformation in a mapping, you specify one or more ports as a sort key and configure each sort key port to sort in ascending or descending order. </li>\n\t<li>You can use the Sorter transformation to sort data passing through an Aggregator transformation configured to use sorted input.</li>\n</ol>","a":[{"id":1755155,"option":"1, 2, and 3","correct":false},{"id":1755156,"option":"2, 3, and 4","correct":false},{"id":1755157,"option":"1, 2, and 4","correct":false},{"id":1755158,"option":"1, 3, and 4","correct":true}]},{"q":"<p>In Informatica, you are working on the transformations. You are required to process your SQL queries midstream in a pipeline. For this, you are required to create an SQL transformation. While creating an SQL transformation, you are required to configure options. You wanted to execute your SQL scripts from text files. For this, you are running your SQL transformation in Script mode. Now, which of the following statements about the default ports when an SQL transformation is configured for Script modes are correct:</p>\n\n<ol>\n\t<li>The port <em>ScriptName</em> with <em>output</em> type receives the name of the script to execute for the current row.</li>\n\t<li>The port <em>ScriptResult</em> with <em>output</em> type returns PASSED if the script execution succeeds for the row. Otherwise contains FAILED.</li>\n\t<li>The port <em>ScriptError</em> with <em>output</em> type returns errors that occur when a script fails for a row.</li>\n\t<li>The port <em>ScriptName</em> with <em>input</em> type receives the name of the script to execute for the current row.</li>\n</ol>","a":[{"id":1755151,"option":"1, 2, and 3","correct":false},{"id":1755152,"option":"2, 3, and 4","correct":true},{"id":1755153,"option":"1, 2, and 4","correct":false},{"id":1755154,"option":"1, 3, and 4","correct":false}]},{"q":"<p>In Informatica, you are working on the transformations. You are using Transaction Control Transformations in the mappings. You are given the mappings containing two pipelines. The pipeline branch at <em>TransactionControl1</em>, which occurs after a source and source qualifier. The first branch contains <em>Expression1</em> and <em>Target1</em>. The second branch contains an <em>Aggregator transformation(Aggregator2), Expression2, TransactionControl2</em>, and <em>Target2</em>. Now, which of the following statements in this scenario are correct:</p>\n\n<p><strong>Figure</strong></p>\n\n<p><strong><img alt=\"\" height=\"228\" src=\"https://he-s3.s3.ap-southeast-1.amazonaws.com/media/uploads/7e1b01cc-6e8b-4230-9eec-10f8560e0dd5.png\" width=\"866\"></strong></p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>The mapping does not include any transformation that drops transaction boundaries between <em>TransactionControl2</em> and <em>Target2</em>, making <em>TransactionControl1</em> effective for <em>Target1</em>.</li>\n\t<li>The Integration Service uses the transaction boundaries defined by <em>TransactionControl1</em> for <em>Target1</em>.</li>\n\t<li>The mapping includes a transformation that drops transaction boundaries between <em>TransactionControl1</em> and <em>Target2</em>, making <em>TransactionControl1</em> ineffective for <em>Target2</em>. </li>\n\t<li>When the Integration Service processes <em>Aggregator2</em>, with Transformation Scope set to All Input, it drops the transaction boundaries defined by <em>TransactionControl1</em> and outputs all rows in an open transaction. </li>\n</ol>","a":[{"id":1755147,"option":"1, 2, and 3","correct":false},{"id":1755148,"option":"2, 3, and 4","correct":true},{"id":1755149,"option":"1, 2, and 4","correct":false},{"id":1755150,"option":"1, 3, and 4","correct":false}]},{"q":"<p>In Informatica, you are working on the transformations. If you are required to create a Sequence Generator Transformation, then which of the following sequences of steps should be performed in this scenario:</p>\n\n<p><strong>Steps</strong></p>\n\n<ol>\n\t<li>In the Mapping Designer, click Transformation &gt; Create. Select the Sequence Generator transformation.</li>\n\t<li>Double-click the title bar of the transformation.</li>\n\t<li>Enter a description for the transformation.</li>\n\t<li>Select the Properties tab. Enter settings.</li>\n\t<li>To generate new sequences during a session, connect the NEXTVAL port to at least one transformation in the mapping.</li>\n\t<li>Enter a name for the Sequence Generator, and click Create. Click Done.</li>\n</ol>","a":[{"id":1754851,"option":"1 -> 2 -> 3 -> 4 -> 5 -> 6","correct":false},{"id":1754852,"option":"1 -> 6 -> 2 -> 3 -> 4 -> 5","correct":true},{"id":1754853,"option":"1 -> 2 -> 6 -> 3 -> 4 -> 5","correct":false},{"id":1754854,"option":"1 -> 6 -> 5 -> 4 -> 3 -> 2","correct":false}]},{"q":"<p>In Informatica, you are working on transformations. You are working on the output groups from the Router transformation. You have created a user-defined group to test a condition based on incoming data that consists of both output ports and a group filter condition. Now, which of the following statements about the actions that are performed by the Integration Service in this scenario are correct:</p>\n\n<p><strong>Statements</strong></p>\n\n<ol>\n\t<li>The Integration Service tests the conditions of each user-defined group after processing the default group.</li>\n\t<li>The Integration Service determines the order of evaluation for each condition based on the order of the connected output groups. </li>\n\t<li>The Integration Service processes user-defined groups that are connected to a transformation or a target in mapping. </li>\n\t<li>The Integration Service only processes user-defined groups that are not connected in a mapping if the default group is connected to a transformation or a target.</li>\n</ol>","a":[{"id":1754611,"option":"1, 2, and 3","correct":false},{"id":1754612,"option":"2, 3, and 4","correct":true},{"id":1754613,"option":"1, 2, and 4","correct":false},{"id":1754614,"option":"1, 3, and 4","correct":false}]},{"q":"<p>In Informatica, you are working on the transformations. A connected Lookup transformation is a Lookup transformation that is connected to a source or target in mapping. You have run a mapping that contains a connected Lookup transformation. Now, Integration Service passes values from another transformation to input ports in the Lookup transformation. For each input row, the Integration Service queries the lookup source or cache based on the lookup ports and the lookup condition in the transformation. Now, if the transformation is uncached or uses a static cache, then which of the following actions will be performed by the Integration Service in this scenario?</p>\n\n<ol>\n</ol>","a":[{"id":1754591,"option":"The Integration Service inserts the row into the cache","correct":false},{"id":1754592,"option":"The Integration Service inserts the row into the cache and returns values from the lookup query.","correct":false},{"id":1754593,"option":"The Integration Service inserts the row into the cache when it does not find the row in the cache.","correct":false},{"id":1754594,"option":"The Integration Service returns values from the lookup query.","correct":true}]}]