[{"q":"In Bootstrap 4, you are working on utilities. If you are required to include red color to the border of your input text box, then which of the following utility classes is used to perform this task?","a":[{"id":1150675,"option":".border-red","correct":false},{"id":1150676,"option":".border-danger","correct":true},{"id":1150677,"option":".border-warning","correct":false},{"id":1150678,"option":".border-abort","correct":false}]},{"q":"In Bootstrap 4, you are working on utilities. If you are required to place your button exactly at the center of your screen with respect to your marginal alignments, then which of the following classes is used to perform this task?","a":[{"id":1150671,"option":".mx-auto","correct":true},{"id":1150672,"option":".my-auto","correct":false},{"id":1150673,"option":".mx-my-auto","correct":false},{"id":1150674,"option":"None of these","correct":false}]},{"q":"In Shell Scripting, you are working on the Telnet network communication utilities. Which of the following statements about the Telnet tags are correct:<br>1) The slc state tag is used to change the state of the special characters when the TELNET LINEMODE option has been disabled.<br>2) The export tag is used to switch to the local defaults for the special characters.<br>3) The import tag is used to switch to the remote defaults for the special characters.<br>4) The ? tag is used to print the help information for the slc tag command.<br>","a":[{"id":1124278,"option":"1, 2, and 3","correct":false},{"id":1124279,"option":"2, 3, and 4","correct":true},{"id":1124280,"option":"1, 2, and 4","correct":false},{"id":1124281,"option":"1, 3, and 4","correct":false}]},{"q":"In Bootstrap 4, you are working on utilities. If you are required to embed a video to your web page by using the Embed utility, then which of the following elements is used to perform this task?","a":[{"id":1150679,"option":"<a>","correct":false},{"id":1150680,"option":"<href>","correct":false},{"id":1150681,"option":"<iframe>","correct":true},{"id":1150682,"option":"<video>","correct":false}]},{"q":"In Bootstrap 4, you are working on utilities. If you are required to control the visibility of various elements of your website, then which of the following statements about the visibility classes are correct:<br>&nbsp;&nbsp;&nbsp;&nbsp;1. The .visible class is used to show the particular elements of a website.<br>&nbsp;&nbsp;&nbsp;&nbsp;2. The .invisible class is used to hide the particular elements of a website.","a":[{"id":1150691,"option":"1","correct":false},{"id":1150692,"option":"2","correct":false},{"id":1150693,"option":"Both of these","correct":true},{"id":1150694,"option":"None of these","correct":false}]},{"q":"In Shell Scripting, you are working on the Finger network communication utilities. If you have executed the following terminal command, then which of the following is represented information is displayed along with the login name, write status, idle time, and the office location:<br><pre class=\"prettyprint\"><code><br>finger - s<br></code></pre> <br>1) Real name<br>2) Terminal name<br>3) Login time<br>4) Directory name","a":[{"id":1124282,"option":"1, 2, and 3","correct":false},{"id":1124283,"option":"2, 3, and 4","correct":true},{"id":1124284,"option":"1, 2, and 4","correct":false},{"id":1124285,"option":"1, 3, and 4","correct":false}]},{"q":"In Shell Scripting, you are working on the content of a file by using the vi editor. Which of the following statements about the cursor commands are correct:<br>1) The pipe ( | ) command is used to locate the cursor at the beginning of the line.<br>2) The dot (.) command is used to locate the cursor at the ending of the line.<br>3) The ‘b’ command is used to locate the cursor to the previous word.<br>4) The closed-parentheses ( ‘)’ ) command is used to locate the cursor to the beginning of the next sentence.","a":[{"id":1124286,"option":"1, 2, and 3","correct":false},{"id":1124287,"option":"2, 3, and 4","correct":false},{"id":1124288,"option":"1, 2, and 4","correct":false},{"id":1124289,"option":"1, 3, and 4","correct":true}]},{"q":"In Shell Scripting, you are working on the Telnet network communication utilities. Which of the following statements about the telnet terminal commands are correct:<br>1) The telnet - x command is used to enable the decryption of the data stream.<br>2) The telnet - n traceline command is used to open the tracefile for recording the tracing information.<br>3) The telnet - f command is used to allow the local credentials to be forwarded to the remote system when the Kerberos V5 authentication is being used.","a":[{"id":1124274,"option":"1 and 2","correct":false},{"id":1124275,"option":"2 and 3","correct":true},{"id":1124276,"option":"1 and 3","correct":false},{"id":1124277,"option":"All of these","correct":false}]},{"q":"In Bootstrap 4, you are working on utilities. Which of the following statements about breakpoints with respect to various screen widths are correct:<br>&nbsp;&nbsp;&nbsp;&nbsp;1. If the screen width is 578px, then the respective breakpoint is xs.<br>&nbsp;&nbsp;&nbsp;&nbsp;2. If the screen width is 768px, then the respective breakpoint is md.<br>&nbsp;&nbsp;&nbsp;&nbsp;3. If the screen width is 998px, then the respective breakpoint is lg.<br>&nbsp;&nbsp;&nbsp;&nbsp;4. If the screen width is 1208px, then the respective breakpoint is xl.","a":[{"id":1150687,"option":"1, 2, and 3","correct":false},{"id":1150688,"option":"2, 3, and 4","correct":true},{"id":1150689,"option":"1, 3, and 4","correct":false},{"id":1150690,"option":"All of these","correct":false}]},{"q":"In Bootstrap 4, you are working on utilities. If you are required to print an image with a large round border radius, then which of the following classes is used to perform this task?","a":[{"id":1150667,"option":"rounded-lg","correct":true},{"id":1150668,"option":"rounded-large","correct":false},{"id":1150669,"option":"border-rounded-lg","correct":false},{"id":1150670,"option":"border-rounded-large","correct":false}]},{"q":"In Shell Scripting, you are working on the Telnet network communication utilities. You are connecting to the services that use the IP addresses for authentication. You have observed that the reconfiguration of the server is not possible. If you are required to use the bind(2) function on a local socket to bind this function to an aliased address, then which of the following Telnet terminal commands is used to perform this action?","a":[{"id":1124270,"option":"telnet - a","correct":false},{"id":1124271,"option":"telnet - b","correct":true},{"id":1124272,"option":"telnet - s","correct":false},{"id":1124273,"option":"telnet - e","correct":false}]},{"q":"In Shell Scripting, you are working on the Network Communication Utilities. Telnet is a utility that allows a computer user at one site to make a connection, login, and then conduct work on a computer at another site. Which of the following statements about this utility commands are correct:<br>1) The telnet - E command is used to stop a character from being recognized as an escape character.<br>2) The telnet - F command is used to allow the local credentials to be forwarded to the remote system.<br>3) The telnet - J command is used to specify that no automatic login is required for the remote system.<br>4) The telnet - L command is used to specify an 8-bit data on the output.","a":[{"id":1124266,"option":"1, 2, and 3","correct":false},{"id":1124267,"option":"1, 2, and 4","correct":false},{"id":1124268,"option":"1, 3, and 4","correct":true},{"id":1124269,"option":"All of these","correct":false}]},{"q":"In Bootstrap 4, which of the following statements about utilities are correct:<br>&nbsp;&nbsp;&nbsp;&nbsp;1. The clearfix utility is used to clear the floated content in the container.<br>&nbsp;&nbsp;&nbsp;&nbsp;2. The close icon is used to dismiss the content with respect to its session ID.","a":[{"id":1150683,"option":"1","correct":true},{"id":1150684,"option":"2","correct":false},{"id":1150685,"option":"Both of these","correct":false},{"id":1150686,"option":"None of these","correct":false}]}]