[{"q":"In Shell Scripting, if you are editing the lines from a file by using the vi editor, then which of the following statements about the vi terminal commands in this scenario are correct:<br>1) The vi - ~ command is used to switch the case of the character under the cursor.<br>2) The vi - U command is used to undo the last change that was done in the file.<br>3) The vi - J command is used to join the current line with the next line.<br>4) The vi -:f command is used to display the current position in the file in % and the file name.","a":[{"id":1124302,"option":"1, 2, and 3","correct":false},{"id":1124303,"option":"1, 2, and 4","correct":false},{"id":1124304,"option":"1, 3, and 4","correct":true},{"id":1124305,"option":"All of these","correct":false}]},{"q":"In Shell Scripting, if you are required to change the characters or the lines in a file without deleting them by using the vi editor, then  which of the following statements about the vi terminal commands in this scenario are correct:<br>1) The ‘cc’ command is used to remove the contents of the line in the insert mode.<br>2) The ‘r’ command is used to overwrite the multiple characters beginning with the character currently under the cursor.<br>3) The ‘S’ command is used to delete the line the cursor is on and replaces the line with the new text.<br>4) The ‘cw’ command is used to change the word that the cursor is on from the cursor to the lowercase w end of the word.","a":[{"id":1124306,"option":"1, 2, and 3","correct":false},{"id":1124307,"option":"1, 2, and 4","correct":false},{"id":1124308,"option":"1, 3, and 4","correct":true},{"id":1124309,"option":"All of these","correct":false}]},{"q":"In Shell Scripting, you are working on the screen and the page layouts by using the vi editor. Which of the following control commands in this scenario are correct:<br>1) The CTRL+d command is used to move the ¼ screen forward.<br>2) The CTRL+f command is used to move the ½ screen backward.<br>3) The CTRl+b command is used to move the full screen backward.<br>4) The CTRL+e command is used to move the screen up one line.<br>5) The CTRL+y command is used to move the screen down one line.","a":[{"id":1124290,"option":"1, 2, and 3","correct":false},{"id":1124291,"option":"2, 3, and 4","correct":false},{"id":1124292,"option":"3, 4, and 5","correct":true},{"id":1124293,"option":"1, 3, and 5","correct":false}]},{"q":"In Shell Scripting, if you are required to delete the characters in a file by using the vi editor, then which of the following statements about the deletion operations are correct:<br>1) The d^ command is used to delete the characters that are available from the current cursor position to the beginning of the line<br>2) The d$ command is used to delete the characters that are available from the current cursor position to the end of the line.<br>3) The d~ command is used to delete the characters that are available from the current cursor location to the next word.<br>4) The D command is used to delete the characters that are available from the cursor position to the end of the current line.","a":[{"id":1124294,"option":"1, 2, and 3","correct":false},{"id":1124295,"option":"2, 3, and 4","correct":false},{"id":1124296,"option":"1, 2, and 4","correct":true},{"id":1124297,"option":"1, 3, and 4","correct":false}]},{"q":"In Shell Scripting, if you are required to perform the copy-paste operations on a file by using the vi editor, then  which of the following statements about the terminal commands in this scenario are correct:<br>1) The ‘yx’ command is used to copy the current line.<br>2) The ‘yw’ command is used to copy the current word from the character that contains  the lowercase w cursor is on<br>3) The ‘p’ command is used to place the copied text after the cursor.<br>4) The ‘P’ command is used to place the yanked text before the cursor.","a":[{"id":1124298,"option":"1, 2, and 3","correct":false},{"id":1124299,"option":"1, 2, and 4","correct":false},{"id":1124300,"option":"1, 3, and 4","correct":false},{"id":1124301,"option":"2, 3, and 4","correct":true}]}]